the-nw1-group/acb-modules/acb-common/include/stm/stm32f30x.inc
  I2C2_ER_IRQn                = 34     /*!< I2C2 Error Interrupt                                              */
  SPI1_IRQn                   = 35     /*!< SPI1 global Interrupt                                             */
  SPI2_IRQn                   = 36     /*!< SPI2 global Interrupt                                             */
  USART1_IRQn                 = 37     /*!< USART1 global Interrupt                                           */
  USART2_IRQn                 = 38     /*!< USART2 global Interrupt                                           */
  USART3_IRQn                 = 39     /*!< USART3 global Interrupt                                           */  
  EXTI15_10_IRQn              = 40     /*!< External Line[15:10] Interrupts                                   */
  RTC_Alarm_IRQn              = 41     /*!< RTC Alarm (A and B) through EXTI Line Interrupt                   */
  USBWakeUp_IRQn              = 42     /*!< USB Wakeup Interrupt                                              */
  TIM8_BRK_IRQn               = 43     /*!< TIM8 Break Interrupt                                              */
  TIM8_UP_IRQn                = 44     /*!< TIM8 Update Interrupt                                             */
  TIM8_TRG_COM_IRQn           = 45     /*!< TIM8 Trigger and Commutation Interrupt                            */
  TIM8_CC_IRQn                = 46     /*!< TIM8 Capture Compare Interrupt                                    */
  ADC3_IRQn                   = 47     /*!< ADC3 global Interrupt                                             */
  FMC_IRQn                    = 48     /*!< FMC global Interrupt                                              */
  SPI3_IRQn                   = 51     /*!< SPI3 global Interrupt                                             */
  UART4_IRQn                  = 52     /*!< UART4 global Interrupt                                            */
  UART5_IRQn                  = 53     /*!< UART5 global Interrupt                                            */
  TIM6_DAC_IRQn               = 54     /*!< TIM6 global and DAC1&2 underrun error  interrupts                 */
  TIM7_IRQn                   = 55     /*!< TIM7 global Interrupt                                             */
  DMA2_Channel1_IRQn          = 56     /*!< DMA2 Channel 1 global Interrupt                                   */
  DMA2_Channel2_IRQn          = 57     /*!< DMA2 Channel 2 global Interrupt                                   */
  DMA2_Channel3_IRQn          = 58     /*!< DMA2 Channel 3 global Interrupt                                   */
  DMA2_Channel4_IRQn          = 59     /*!< DMA2 Channel 4 global Interrupt                                   */
  DMA2_Channel5_IRQn          = 60     /*!< DMA2 Channel 5 global Interrupt                                   */
  ADC4_IRQn                   = 61     /*!< ADC4  global Interrupt                                            */
  COMP1_2_3_IRQn              = 64     /*!< COMP1 COMP2 and COMP3 global Interrupt                           */
  COMP4_5_6_IRQn              = 65     /*!< COMP5 COMP6 and COMP4 global Interrupt                           */
  COMP7_IRQn                  = 66     /*!< COMP7 global Interrupt                                            */
  I2C3_EV_IRQn                = 72     /*!< I2C3 event interrupt                                              */
  I2C3_ER_IRQn                = 73     /*!< I2C3 error interrupt                                              */
  USB_HP_IRQn                 = 74     /*!< USB High Priority global Interrupt remap                          */
  USB_LP_IRQn                 = 75     /*!< USB Low Priority global Interrupt  remap                          */
  USBWakeUp_RMP_IRQn          = 76     /*!< USB Wakeup Interrupt remap                                        */
  TIM20_BRK_IRQn              = 77     /*!< TIM20 Break Interrupt                                             */
  TIM20_UP_IRQn               = 78     /*!< TIM20 Update Interrupt                                            */
  TIM20_TRG_COM_IRQn          = 79     /*!< TIM20 Trigger and Commutation Interrupt                           */
  TIM20_CC_IRQn               = 80     /*!< TIM20 Capture Compare Interrupt                                   */
  FPU_IRQn                    = 81     /*!< Floating point Interrupt                                          */
  SPI4_IRQn                   = 84      /*!< SPI4 global Interrupt                                             */ 
#endif /* STM32F303xE */

/**
  * @}
  */


/** @addtogroup Exported_types
  * @{
  */  








RESET = 0
SET = !RESET

DISABLE = 0
ENABLE = !DISABLE
#define IS_FUNCTIONAL_STATE(STATE) (((STATE) == DISABLE) || ((STATE) == ENABLE))

ERROR = 0
SUCCESS = !ERROR

/**
  * @}
  */

/** @addtogroup Peripheral_registers_structures
  * @{
  */   

/** 
  * @brief Analog to Digital Converter  
  */


#define ADC_ISR_OFFSET          0x0000    /*!< ADC Interrupt and Status Register,                 Address offset: 0x00 */
#define ADC_IER_OFFSET          0x0004    /*!< ADC Interrupt Enable Register,                     Address offset: 0x04 */
#define ADC_CR_OFFSET           0x0008    /*!< ADC control register,                              Address offset: 0x08 */
#define ADC_CFGR_OFFSET         0x000C    /*!< ADC Configuration register,                        Address offset: 0x0C */
#define ADC_RESERVED0_OFFSET    0x0010    /*!< Reserved, 0x010                                                         */
#define ADC_SMPR1_OFFSET        0x0014    /*!< ADC sample time register 1,                        Address offset: 0x14 */
#define ADC_SMPR2_OFFSET        0x0018    /*!< ADC sample time register 2,                        Address offset: 0x18 */
#define ADC_RESERVED1_OFFSET    0x001C    /*!< Reserved, 0x01C                                                         */
#define ADC_TR1_OFFSET          0x0020    /*!< ADC watchdog threshold register 1,                 Address offset: 0x20 */
#define ADC_TR2_OFFSET          0x0024    /*!< ADC watchdog threshold register 2,                 Address offset: 0x24 */
#define ADC_TR3_OFFSET          0x0028    /*!< ADC watchdog threshold register 3,                 Address offset: 0x28 */
#define ADC_RESERVED2_OFFSET    0x002C    /*!< Reserved, 0x02C                                                         */
#define ADC_SQR1_OFFSET         0x0030    /*!< ADC regular sequence register 1,                   Address offset: 0x30 */
#define ADC_SQR2_OFFSET         0x0034    /*!< ADC regular sequence register 2,                   Address offset: 0x34 */
#define ADC_SQR3_OFFSET         0x0038    /*!< ADC regular sequence register 3,                   Address offset: 0x38 */
#define ADC_SQR4_OFFSET         0x003C    /*!< ADC regular sequence register 4,                   Address offset: 0x3C */
#define ADC_DR_OFFSET           0x0040    /*!< ADC regular data register,                         Address offset: 0x40 */
#define ADC_RESERVED3_OFFSET    0x0044    /*!< Reserved, 0x044                                                         */
#define ADC_RESERVED4_OFFSET    0x0048    /*!< Reserved, 0x048                                                         */
#define ADC_JSQR_OFFSET         0x004C    /*!< ADC injected sequence register,                    Address offset: 0x4C */
#define ADC_RESERVED5_OFFSET    0x0050    /*!< Reserved, 0x050 - 0x05C                                                 */
#define ADC_OFR1_OFFSET         0x0060    /*!< ADC offset register 1,                             Address offset: 0x60 */
#define ADC_OFR2_OFFSET         0x0064    /*!< ADC offset register 2,                             Address offset: 0x64 */
#define ADC_OFR3_OFFSET         0x0068    /*!< ADC offset register 3,                             Address offset: 0x68 */
#define ADC_OFR4_OFFSET         0x006C    /*!< ADC offset register 4,                             Address offset: 0x6C */
#define ADC_RESERVED6_OFFSET    0x0070    /*!< Reserved, 0x070 - 0x07C                                                 */
#define ADC_JDR1_OFFSET         0x0080    /*!< ADC injected data register 1,                      Address offset: 0x80 */
#define ADC_JDR2_OFFSET         0x0084    /*!< ADC injected data register 2,                      Address offset: 0x84 */
#define ADC_JDR3_OFFSET         0x0088    /*!< ADC injected data register 3,                      Address offset: 0x88 */
#define ADC_JDR4_OFFSET         0x008C    /*!< ADC injected data register 4,                      Address offset: 0x8C */
#define ADC_RESERVED7_OFFSET    0x0090    /*!< Reserved, 0x090 - 0x09C                                                 */
#define ADC_AWD2CR_OFFSET       0x00A0    /*!< ADC  Analog Watchdog 2 Configuration Register,     Address offset: 0xA0 */
#define ADC_AWD3CR_OFFSET       0x00A4    /*!< ADC  Analog Watchdog 3 Configuration Register,     Address offset: 0xA4 */
#define ADC_RESERVED8_OFFSET    0x00A8    /*!< Reserved, 0x0A8                                                         */
#define ADC_RESERVED9_OFFSET    0x00AC    /*!< Reserved, 0x0AC                                                         */
#define ADC_DIFSEL_OFFSET       0x00B0    /*!< ADC  Differential Mode Selection Register,         Address offset: 0xB0 */
#define ADC_CALFACT_OFFSET      0x00B4    /*!< ADC  Calibration Factors,                          Address offset: 0xB4 */

#define ADC_Common_CSR_OFFSET         0x0000    /*!< ADC Common status register,                  Address offset: ADC1/3 base address + 0x300 */
#define ADC_Common_RESERVED_OFFSET    0x0004    /*!< Reserved, ADC1/3 base address + 0x304                                                    */
#define ADC_Common_CCR_OFFSET         0x0008    /*!< ADC common control register,                 Address offset: ADC1/3 base address + 0x308 */
#define ADC_Common_CDR_OFFSET         0x000C    /*!< ADC common regular data register for dual */


/** 
  * @brief Controller Area Network TxMailBox 
  */
#define CAN_TxMailBox_TIR_OFFSET     0x0000    /*!< CAN TX mailbox identifier register */
#define CAN_TxMailBox_TDTR_OFFSET    0x0004    /*!< CAN mailbox data length control and time stamp register */
#define CAN_TxMailBox_TDLR_OFFSET    0x0008    /*!< CAN mailbox data low register */
#define CAN_TxMailBox_TDHR_OFFSET    0x000C    /*!< CAN mailbox data high register */

/** 
  * @brief Controller Area Network FIFOMailBox 
  */
#define CAN_FIFOMailBox_RIR_OFFSET     0x0000    /*!< CAN receive FIFO mailbox identifier register */
#define CAN_FIFOMailBox_RDTR_OFFSET    0x0004    /*!< CAN receive FIFO mailbox data length control and time stamp register */
#define CAN_FIFOMailBox_RDLR_OFFSET    0x0008    /*!< CAN receive FIFO mailbox data low register */
#define CAN_FIFOMailBox_RDHR_OFFSET    0x000C    /*!< CAN receive FIFO mailbox data high register */

/** 
  * @brief Controller Area Network FilterRegister 
  */
#define CAN_FilterRegister_FR1_OFFSET    0x0000    /*!< CAN Filter bank register 1 */
#define CAN_FilterRegister_FR2_OFFSET    0x0004    /*!< CAN Filter bank register 1 */

/** 
  * @brief Controller Area Network 
  */
#define CAN_MCR_OFFSET                0x0000    /*!< CAN master control register,         Address offset: 0x00          */
#define CAN_MSR_OFFSET                0x0004    /*!< CAN master status register,          Address offset: 0x04          */
#define CAN_TSR_OFFSET                0x0008    /*!< CAN transmit status register,        Address offset: 0x08          */
#define CAN_RF0R_OFFSET               0x000C    /*!< CAN receive FIFO 0 register,         Address offset: 0x0C          */
#define CAN_RF1R_OFFSET               0x0010    /*!< CAN receive FIFO 1 register,         Address offset: 0x10          */
#define CAN_IER_OFFSET                0x0014    /*!< CAN interrupt enable register,       Address offset: 0x14          */
#define CAN_ESR_OFFSET                0x0018    /*!< CAN error status register,           Address offset: 0x18          */
#define CAN_BTR_OFFSET                0x001C    /*!< CAN bit timing register,             Address offset: 0x1C          */
#define CAN_RESERVED0_OFFSET          0x0020    /*!< Reserved, 0x020 - 0x17F                                            */
#define CAN_sTxMailBox_OFFSET         0x0180    /*!< CAN Tx MailBox,                      Address offset: 0x180 - 0x1AC */
#define CAN_sFIFOMailBox_OFFSET       0x01B0    /*!< CAN FIFO MailBox,                    Address offset: 0x1B0 - 0x1CC */
#define CAN_RESERVED1_OFFSET          0x01D0    /*!< Reserved, 0x1D0 - 0x1FF                                            */
#define CAN_FMR_OFFSET                0x0200    /*!< CAN filter master register,          Address offset: 0x200         */
#define CAN_FM1R_OFFSET               0x0204    /*!< CAN filter mode register,            Address offset: 0x204         */
#define CAN_RESERVED2_OFFSET          0x0208    /*!< Reserved, 0x208                                                    */
#define CAN_FS1R_OFFSET               0x020C    /*!< CAN filter scale register,           Address offset: 0x20C         */
#define CAN_RESERVED3_OFFSET          0x0210    /*!< Reserved, 0x210                                                    */
#define CAN_FFA1R_OFFSET              0x0214    /*!< CAN filter FIFO assignment register, Address offset: 0x214         */
#define CAN_RESERVED4_OFFSET          0x0218    /*!< Reserved, 0x218                                                    */
#define CAN_FA1R_OFFSET               0x021C    /*!< CAN filter activation register,      Address offset: 0x21C         */
#define CAN_RESERVED5_OFFSET          0x0220    /*!< Reserved, 0x220-0x23F                                              */
#define CAN_sFilterRegister_OFFSET    0x0240    /*!< CAN Filter Register,                 Address offset: 0x240-0x31C   */


/** 
  * @brief Analog Comparators 
  */

#define COMP_CSR_OFFSET    0x0000    /*!< Comparator control Status register, Address offset: 0x00 */

/** 
  * @brief CRC calculation unit 
  */

