the-nw1-group/acb-modules/acb-common/include/stm/stm32f30x.inc
#define CRC_DR_OFFSET           0x0000    /*!< CRC Data register,                           Address offset: 0x00 */
#define CRC_IDR_OFFSET          0x0004    /*!< CRC Independent data register,               Address offset: 0x04 */
#define CRC_RESERVED0_OFFSET    0x0005    /*!< Reserved,                                                    0x05 */
#define CRC_RESERVED1_OFFSET    0x0006    /*!< Reserved,                                                    0x06 */
#define CRC_CR_OFFSET           0x0008    /*!< CRC Control register,                        Address offset: 0x08 */
#define CRC_RESERVED2_OFFSET    0x000C    /*!< Reserved,                                                    0x0C */
#define CRC_INIT_OFFSET         0x0010    /*!< Initial CRC value register,                  Address offset: 0x10 */
#define CRC_POL_OFFSET          0x0014    /*!< CRC polynomial register,                     Address offset: 0x14 */

/** 
  * @brief Digital to Analog Converter
  */

#define DAC_CR_OFFSET         0x0000    /*!< DAC control register,                                    Address offset: 0x00 */
#define DAC_SWTRIGR_OFFSET    0x0004    /*!< DAC software trigger register,                           Address offset: 0x04 */
#define DAC_DHR12R1_OFFSET    0x0008    /*!< DAC channel1 12-bit right-aligned data holding register, Address offset: 0x08 */
#define DAC_DHR12L1_OFFSET    0x000C    /*!< DAC channel1 12-bit left aligned data holding register,  Address offset: 0x0C */
#define DAC_DHR8R1_OFFSET     0x0010    /*!< DAC channel1 8-bit right aligned data holding register,  Address offset: 0x10 */
#define DAC_DHR12R2_OFFSET    0x0014    /*!< DAC channel2 12-bit right aligned data holding register, Address offset: 0x14 */
#define DAC_DHR12L2_OFFSET    0x0018    /*!< DAC channel2 12-bit left aligned data holding register,  Address offset: 0x18 */
#define DAC_DHR8R2_OFFSET     0x001C    /*!< DAC channel2 8-bit right-aligned data holding register,  Address offset: 0x1C */
#define DAC_DHR12RD_OFFSET    0x0020    /*!< Dual DAC 12-bit right-aligned data holding register,     Address offset: 0x20 */
#define DAC_DHR12LD_OFFSET    0x0024    /*!< DUAL DAC 12-bit left aligned data holding register,      Address offset: 0x24 */
#define DAC_DHR8RD_OFFSET     0x0028    /*!< DUAL DAC 8-bit right aligned data holding register,      Address offset: 0x28 */
#define DAC_DOR1_OFFSET       0x002C    /*!< DAC channel1 data output register,                       Address offset: 0x2C */
#define DAC_DOR2_OFFSET       0x0030    /*!< DAC channel2 data output register,                       Address offset: 0x30 */
#define DAC_SR_OFFSET         0x0034    /*!< DAC status register,                                     Address offset: 0x34 */

/** 
  * @brief Debug MCU
  */

#define DBGMCU_IDCODE_OFFSET    0x0000    /*!< MCU device ID code,               Address offset: 0x00 */
#define DBGMCU_CR_OFFSET        0x0004    /*!< Debug MCU configuration register, Address offset: 0x04 */
#define DBGMCU_APB1FZ_OFFSET    0x0008    /*!< Debug MCU APB1 freeze register,   Address offset: 0x08 */
#define DBGMCU_APB2FZ_OFFSET    0x000C    /*!< Debug MCU APB2 freeze register,   Address offset: 0x0C */

/** 
  * @brief DMA Controller
  */

#define DMA_Channel_CCR_OFFSET      0x0000    /*!< DMA channel x configuration register                                           */
#define DMA_Channel_CNDTR_OFFSET    0x0004    /*!< DMA channel x number of data register                                          */
#define DMA_Channel_CPAR_OFFSET     0x0008    /*!< DMA channel x peripheral address register                                      */
#define DMA_Channel_CMAR_OFFSET     0x000C    /*!< DMA channel x memory address register                                          */

#define DMA_ISR_OFFSET     0x0000    /*!< DMA interrupt status register,      Address offset: 0x00 */
#define DMA_IFCR_OFFSET    0x0004    /*!< DMA interrupt clear flag register,  Address offset: 0x04 */

/** 
  * @brief External Interrupt/Event Controller
  */

#define EXTI_IMR_OFFSET          0x0000    /*!< EXTI Interrupt mask register,                Address offset: 0x00 */
#define EXTI_EMR_OFFSET          0x0004    /*!< EXTI Event mask register,                    Address offset: 0x04 */
#define EXTI_RTSR_OFFSET         0x0008    /*!< EXTI Rising trigger selection register,      Address offset: 0x08 */
#define EXTI_FTSR_OFFSET         0x000C    /*!< EXTI Falling trigger selection register,     Address offset: 0x0C */
#define EXTI_SWIER_OFFSET        0x0010    /*!< EXTI Software interrupt event register,      Address offset: 0x10 */
#define EXTI_PR_OFFSET           0x0014    /*!< EXTI Pending register,                       Address offset: 0x14 */
#define EXTI_RESERVED1_OFFSET    0x0018    /*!< Reserved, 0x18                                                    */
#define EXTI_RESERVED2_OFFSET    0x001C    /*!< Reserved, 0x1C                                                    */
#define EXTI_IMR2_OFFSET         0x0020    /*!< EXTI Interrupt mask register,                Address offset: 0x20 */
#define EXTI_EMR2_OFFSET         0x0024    /*!< EXTI Event mask register,                    Address offset: 0x24 */
#define EXTI_RTSR2_OFFSET        0x0028    /*!< EXTI Rising trigger selection register,      Address offset: 0x28 */
#define EXTI_FTSR2_OFFSET        0x002C    /*!< EXTI Falling trigger selection register,     Address offset: 0x2C */
#define EXTI_SWIER2_OFFSET       0x0030    /*!< EXTI Software interrupt event register,      Address offset: 0x30 */
#define EXTI_PR2_OFFSET          0x0034    /*!< EXTI Pending register,                       Address offset: 0x34 */

/** 
  * @brief FLASH Registers
  */


#define FLASH_ACR_OFFSET         0x0000    /*!< FLASH access control register,              Address offset: 0x00 */
#define FLASH_KEYR_OFFSET        0x0004    /*!< FLASH key register,                         Address offset: 0x04 */
#define FLASH_OPTKEYR_OFFSET     0x0008    /*!< FLASH option key register,                  Address offset: 0x08 */
#define FLASH_SR_OFFSET          0x000C    /*!< FLASH status register,                      Address offset: 0x0C */
#define FLASH_CR_OFFSET          0x0010    /*!< FLASH control register,                     Address offset: 0x10 */
#define FLASH_AR_OFFSET          0x0014    /*!< FLASH address register,                     Address offset: 0x14 */
#define FLASH_RESERVED_OFFSET    0x0018    /*!< Reserved, 0x18                                                   */
#define FLASH_OBR_OFFSET         0x001C    /*!< FLASH Option byte register,                 Address offset: 0x1C */
#define FLASH_WRPR_OFFSET        0x0020    /*!< FLASH Write register,                       Address offset: 0x20 */

/** 
  * @brief Flexible Memory Controller
  */

#define FMC_Bank1_BTCR_OFFSET    0x0000    /*!< NOR/PSRAM chip-select control register(BCR) and chip-select timing register(BTR), Address offset: 0x00-1C */

/** 
  * @brief Flexible Memory Controller Bank1E
  */

