the-nw1-group/acb-modules/acb-common/include/stm/stm32f30x.inc
#define FMC_Bank1E_BWTR_OFFSET    0x0000    /*!< NOR/PSRAM write timing registers, Address offset: 0x104-0x11C */

/** 
  * @brief Flexible Memory Controller Bank2
  */

#define FMC_Bank2_PCR2_OFFSET         0x0000    /*!< NAND Flash control register 2,                       Address offset: 0x60 */
#define FMC_Bank2_SR2_OFFSET          0x0004    /*!< NAND Flash FIFO status and interrupt register 2,     Address offset: 0x64 */
#define FMC_Bank2_PMEM2_OFFSET        0x0008    /*!< NAND Flash Common memory space timing register 2,    Address offset: 0x68 */
#define FMC_Bank2_PATT2_OFFSET        0x000C    /*!< NAND Flash Attribute memory space timing register 2, Address offset: 0x6C */
#define FMC_Bank2_RESERVED0_OFFSET    0x0010    /*!< Reserved, 0x70                                                            */
#define FMC_Bank2_ECCR2_OFFSET        0x0014    /*!< NAND Flash ECC result registers 2,                   Address offset: 0x74 */

/** 
  * @brief Flexible Memory Controller Bank3
  */

#define FMC_Bank3_PCR3_OFFSET         0x0000    /*!< NAND Flash control register 3,                       Address offset: 0x80 */
#define FMC_Bank3_SR3_OFFSET          0x0004    /*!< NAND Flash FIFO status and interrupt register 3,     Address offset: 0x84 */
#define FMC_Bank3_PMEM3_OFFSET        0x0008    /*!< NAND Flash Common memory space timing register 3,    Address offset: 0x88 */
#define FMC_Bank3_PATT3_OFFSET        0x000C    /*!< NAND Flash Attribute memory space timing register 3, Address offset: 0x8C */
#define FMC_Bank3_RESERVED0_OFFSET    0x0010    /*!< Reserved, 0x90                                                            */
#define FMC_Bank3_ECCR3_OFFSET        0x0014    /*!< NAND Flash ECC result registers 3,                   Address offset: 0x94 */

/** 
  * @brief Flexible Memory Controller Bank4
  */

#define FMC_Bank4_PCR4_OFFSET     0x0000    /*!< PC Card  control register 4,                       Address offset: 0xA0 */
#define FMC_Bank4_SR4_OFFSET      0x0004    /*!< PC Card  FIFO status and interrupt register 4,     Address offset: 0xA4 */
#define FMC_Bank4_PMEM4_OFFSET    0x0008    /*!< PC Card  Common memory space timing register 4,    Address offset: 0xA8 */
#define FMC_Bank4_PATT4_OFFSET    0x000C    /*!< PC Card  Attribute memory space timing register 4, Address offset: 0xAC */
#define FMC_Bank4_PIO4_OFFSET     0x0010    /*!< PC Card  I/O space timing register 4,              Address offset: 0xB0 */

/** 
  * @brief Option Bytes Registers
  */
#define OB_RDP_OFFSET          0x0000    /*!<FLASH option byte Read protection,             Address offset: 0x00 */
#define OB_USER_OFFSET         0x0002    /*!<FLASH option byte user options,                Address offset: 0x02 */
#define OB_RESERVED0_OFFSET    0x0004    /*!< Reserved,                                                     0x04 */
#define OB_RESERVED1_OFFSET    0x0006    /*!< Reserved,                                                     0x06 */
#define OB_WRP0_OFFSET         0x0008    /*!<FLASH option byte write protection 0,          Address offset: 0x08 */
#define OB_WRP1_OFFSET         0x000A    /*!<FLASH option byte write protection 1,          Address offset: 0x0C */
#define OB_WRP2_OFFSET         0x000C    /*!<FLASH option byte write protection 2,          Address offset: 0x10 */
#define OB_WRP3_OFFSET         0x000E    /*!<FLASH option byte write protection 3,          Address offset: 0x12 */

/** 
  * @brief General Purpose I/O
  */

#define GPIO_MODER_OFFSET        0x0000    /*!< GPIO port mode register,                                  Address offset: 0x00 */
#define GPIO_OTYPER_OFFSET       0x0004    /*!< GPIO port output type register,                           Address offset: 0x04 */
#define GPIO_RESERVED0_OFFSET    0x0006    /*!< Reserved,                                                                 0x06 */
#define GPIO_OSPEEDR_OFFSET      0x0008    /*!< GPIO port output speed register,                          Address offset: 0x08 */
#define GPIO_PUPDR_OFFSET        0x000C    /*!< GPIO port pull-up/pull-down register,                     Address offset: 0x0C */
#define GPIO_IDR_OFFSET          0x0010    /*!< GPIO port input data register,                            Address offset: 0x10 */
#define GPIO_RESERVED1_OFFSET    0x0012    /*!< Reserved,                                                                 0x12 */
#define GPIO_ODR_OFFSET          0x0014    /*!< GPIO port output data register,                           Address offset: 0x14 */
#define GPIO_RESERVED2_OFFSET    0x0016    /*!< Reserved,                                                                 0x16 */
#define GPIO_BSRR_OFFSET         0x0018    /*!< GPIO port bit set/reset registerBSRR,                     Address offset: 0x18 */
#define GPIO_LCKR_OFFSET         0x001C    /*!< GPIO port configuration lock register,                    Address offset: 0x1C */
#define GPIO_AFR_OFFSET          0x0020    /*!< GPIO alternate function low register,                Address offset: 0x20-0x24 */
#define GPIO_BRR_OFFSET          0x0028    /*!< GPIO bit reset register,                                  Address offset: 0x28 */
#define GPIO_RESERVED3_OFFSET    0x002A    /*!< Reserved,                                                                 0x2A */

/** 
  * @brief High resolution Timer (HRTIM)
  */
#define HRTIM_Master_MCR_OFFSET          0x0000    /*!< HRTIM Master Timer control register,                     Address offset: 0x00 */
#define HRTIM_Master_MISR_OFFSET         0x0004    /*!< HRTIM Master Timer interrupt status register,            Address offset: 0x04 */
#define HRTIM_Master_MICR_OFFSET         0x0008    /*!< HRTIM Master Timer interrupt clear register,              Address offset: 0x08 */
#define HRTIM_Master_MDIER_OFFSET        0x000C    /*!< HRTIM Master Timer DMA/interrupt enable register         Address offset: 0x0C */
#define HRTIM_Master_MCNTR_OFFSET        0x0010    /*!< HRTIM Master Timer counter register,                     Address offset: 0x10 */
#define HRTIM_Master_MPER_OFFSET         0x0014    /*!< HRTIM Master Timer period register,                      Address offset: 0x14 */
#define HRTIM_Master_MREP_OFFSET         0x0018    /*!< HRTIM Master Timer repetition register,                  Address offset: 0x18 */
#define HRTIM_Master_MCMP1R_OFFSET       0x001C    /*!< HRTIM Master Timer compare 1 register,                   Address offset: 0x1C */
#define HRTIM_Master_RESERVED0_OFFSET    0x0020    /*!< Reserved,                                                                0x20 */
#define HRTIM_Master_MCMP2R_OFFSET       0x0024    /*!< HRTIM Master Timer compare 2 register,                   Address offset: 0x24 */
#define HRTIM_Master_MCMP3R_OFFSET       0x0028    /*!< HRTIM Master Timer compare 3 register,                   Address offset: 0x28 */
#define HRTIM_Master_MCMP4R_OFFSET       0x002C    /*!< HRTIM Master Timer compare 4 register,                   Address offset: 0x2C */

#define HRTIM_Timerx_TIMxCR_OFFSET       0x0000    /*!< HRTIM Timerx control register,                              Address offset: 0x00  */
#define HRTIM_Timerx_TIMxISR_OFFSET      0x0004    /*!< HRTIM Timerx interrupt status register,                     Address offset: 0x04  */
#define HRTIM_Timerx_TIMxICR_OFFSET      0x0008    /*!< HRTIM Timerx interrupt clear register,                      Address offset: 0x08  */
#define HRTIM_Timerx_TIMxDIER_OFFSET     0x000C    /*!< HRTIM Timerx DMA/interrupt enable register,                 Address offset: 0x0C  */
#define HRTIM_Timerx_CNTxR_OFFSET        0x0010    /*!< HRTIM Timerx counter register,                              Address offset: 0x10  */
#define HRTIM_Timerx_PERxR_OFFSET        0x0014    /*!< HRTIM Timerx period register,                               Address offset: 0x14  */
#define HRTIM_Timerx_REPxR_OFFSET        0x0018    /*!< HRTIM Timerx repetition register,                           Address offset: 0x18  */
#define HRTIM_Timerx_CMP1xR_OFFSET       0x001C    /*!< HRTIM Timerx compare 1 register,                            Address offset: 0x1C  */
#define HRTIM_Timerx_CMP1CxR_OFFSET      0x0020    /*!< HRTIM Timerx compare 1 compound register,                   Address offset: 0x20  */
#define HRTIM_Timerx_CMP2xR_OFFSET       0x0024    /*!< HRTIM Timerx compare 2 register,                            Address offset: 0x24  */
#define HRTIM_Timerx_CMP3xR_OFFSET       0x0028    /*!< HRTIM Timerx compare 3 register,                            Address offset: 0x28  */
#define HRTIM_Timerx_CMP4xR_OFFSET       0x002C    /*!< HRTIM Timerx compare 4 register,                            Address offset: 0x2C  */
#define HRTIM_Timerx_CPT1xR_OFFSET       0x0030    /*!< HRTIM Timerx capture 1 register,                            Address offset: 0x30  */
#define HRTIM_Timerx_CPT2xR_OFFSET       0x0034    /*!< HRTIM Timerx capture 2 register,                            Address offset: 0x34 */
#define HRTIM_Timerx_DTxR_OFFSET         0x0038    /*!< HRTIM Timerx dead time register,                            Address offset: 0x38 */
#define HRTIM_Timerx_SETx1R_OFFSET       0x003C    /*!< HRTIM Timerx output 1 set register,                         Address offset: 0x3C */
#define HRTIM_Timerx_RSTx1R_OFFSET       0x0040    /*!< HRTIM Timerx output 1 reset register,                       Address offset: 0x40 */
#define HRTIM_Timerx_SETx2R_OFFSET       0x0044    /*!< HRTIM Timerx output 2 set register,                         Address offset: 0x44 */
#define HRTIM_Timerx_RSTx2R_OFFSET       0x0048    /*!< HRTIM Timerx output 2 reset register,                       Address offset: 0x48 */
#define HRTIM_Timerx_EEFxR1_OFFSET       0x004C    /*!< HRTIM Timerx external event filtering 1 register,           Address offset: 0x4C */
#define HRTIM_Timerx_EEFxR2_OFFSET       0x0050    /*!< HRTIM Timerx external event filtering 2 register,           Address offset: 0x50 */
#define HRTIM_Timerx_RSTxR_OFFSET        0x0054    /*!< HRTIM Timerx Reset register,                                Address offset: 0x54 */
#define HRTIM_Timerx_CHPxR_OFFSET        0x0058    /*!< HRTIM Timerx Chopper register,                              Address offset: 0x58 */
#define HRTIM_Timerx_CPT1xCR_OFFSET      0x005C    /*!< HRTIM Timerx Capture 1 register,                            Address offset: 0x5C */
#define HRTIM_Timerx_CPT2xCR_OFFSET      0x0060    /*!< HRTIM Timerx Capture 2 register,                            Address offset: 0x60 */
#define HRTIM_Timerx_OUTxR_OFFSET        0x0064    /*!< HRTIM Timerx Output register,                               Address offset: 0x64 */
#define HRTIM_Timerx_FLTxR_OFFSET        0x0068    /*!< HRTIM Timerx Fault register,                                Address offset: 0x68 */
#define HRTIM_Timerx_RESERVED0_OFFSET    0x006C    /*!< Reserved,                                                                       */

#define HRTIM_Common_CR1_OFFSET         0x0000    /*!< HRTIM control register1,                                    Address offset: 0x00 */
#define HRTIM_Common_CR2_OFFSET         0x0004    /*!< HRTIM control register2,                                    Address offset: 0x04 */
#define HRTIM_Common_ISR_OFFSET         0x0008    /*!< HRTIM interrupt status register,                            Address offset: 0x08 */
#define HRTIM_Common_ICR_OFFSET         0x000C    /*!< HRTIM interrupt clear register,                             Address offset: 0x0C */
#define HRTIM_Common_IER_OFFSET         0x0010    /*!< HRTIM interrupt enable register,                            Address offset: 0x10 */
#define HRTIM_Common_OENR_OFFSET        0x0014    /*!< HRTIM Output enable register,                               Address offset: 0x14 */
#define HRTIM_Common_DISR_OFFSET        0x0018    /*!< HRTIM Output disable register,                              Address offset: 0x18 */
#define HRTIM_Common_ODSR_OFFSET        0x001C    /*!< HRTIM Output disable status register,                       Address offset: 0x1C */
#define HRTIM_Common_BMCR_OFFSET        0x0020    /*!< HRTIM Burst mode control register,                          Address offset: 0x20 */
#define HRTIM_Common_BMTRGR_OFFSET      0x0024    /*!< HRTIM Busrt mode trigger register,                          Address offset: 0x24 */
#define HRTIM_Common_BMCMPR_OFFSET      0x0028    /*!< HRTIM Burst mode compare register,                          Address offset: 0x28 */
#define HRTIM_Common_BMPER_OFFSET       0x002C    /*!< HRTIM Burst mode period register,                           Address offset: 0x2C */
#define HRTIM_Common_EECR1_OFFSET       0x0030    /*!< HRTIM Timer external event control register1,               Address offset: 0x30 */
#define HRTIM_Common_EECR2_OFFSET       0x0034    /*!< HRTIM Timer external event control register2,               Address offset: 0x34 */
#define HRTIM_Common_EECR3_OFFSET       0x0038    /*!< HRTIM Timer external event control register3,               Address offset: 0x38 */
#define HRTIM_Common_ADC1R_OFFSET       0x003C    /*!< HRTIM ADC Trigger 1 register,                               Address offset: 0x3C */
#define HRTIM_Common_ADC2R_OFFSET       0x0040    /*!< HRTIM ADC Trigger 2 register,                               Address offset: 0x40 */
#define HRTIM_Common_ADC3R_OFFSET       0x0044    /*!< HRTIM ADC Trigger 3 register,                               Address offset: 0x44 */
#define HRTIM_Common_ADC4R_OFFSET       0x0048    /*!< HRTIM ADC Trigger 4 register,                               Address offset: 0x48 */
#define HRTIM_Common_DLLCR_OFFSET       0x004C    /*!< HRTIM DLL control register,                                 Address offset: 0x4C */
#define HRTIM_Common_FLTINxR1_OFFSET    0x0050    /*!< HRTIM Fault input register1,                                Address offset: 0x50 */
#define HRTIM_Common_FLTINxR2_OFFSET    0x0054    /*!< HRTIM Fault input register2,                                Address offset: 0x54 */
#define HRTIM_Common_BDMUPDR_OFFSET     0x0058    /*!< HRTIM Burst DMA Master Timer update register,               Address offset: 0x58 */
#define HRTIM_Common_BDTAUPR_OFFSET     0x005C    /*!< HRTIM Burst DMA Timerx update register,                     Address offset: 0x5C */
#define HRTIM_Common_BDTBUPR_OFFSET     0x0060    /*!< HRTIM Burst DMA Timerx update register,                     Address offset: 0x60 */
#define HRTIM_Common_BDTCUPR_OFFSET     0x0064    /*!< HRTIM Burst DMA Timerx update register,                     Address offset: 0x64 */
#define HRTIM_Common_BDTDUPR_OFFSET     0x0068    /*!< HRTIM Burst DMA Timerx update register,                     Address offset: 0x68 */
#define HRTIM_Common_BDTEUPR_OFFSET     0x006C    /*!< HRTIM Burst DMA Timerx update register,                     Address offset: 0x6C */
#define HRTIM_Common_BDMADR_OFFSET      0x0070    /*!< HRTIM Burst DMA Master Data register,                       Address offset: 0x70 */

#define HRTIM_HRTIM_MASTER_OFFSET    0x0000    
#define HRTIM_RESERVED0_OFFSET       0x0030    
#define HRTIM_HRTIM_TIMERx_OFFSET    0x0080    
#define HRTIM_RESERVED1_OFFSET       0x0300    
#define HRTIM_HRTIM_COMMON_OFFSET    0x0380    

/** 
  * @brief Operational Amplifier (OPAMP)
  */

#define OPAMP_CSR_OFFSET    0x0000    /*!< OPAMP control and status register,            Address offset: 0x00 */


/** 
  * @brief System configuration controller
  */

#define SYSCFG_CFGR1_OFFSET         0x0000    /*!< SYSCFG configuration register 1,                   Address offset: 0x00 */
#define SYSCFG_RCR_OFFSET           0x0004    /*!< SYSCFG CCM SRAM protection register,               Address offset: 0x04 */
#define SYSCFG_EXTICR_OFFSET        0x0008    /*!< SYSCFG external interrupt configuration registers, Address offset: 0x14-0x08 */
#define SYSCFG_CFGR2_OFFSET         0x0018    /*!< SYSCFG configuration register 2,                    Address offset: 0x18 */
#define SYSCFG_RESERVED0_OFFSET     0x001C    /*!< Reserved,                                                           0x1C */
#define SYSCFG_RESERVED1_OFFSET     0x0020    /*!< Reserved,                                                          0x20 */
#define SYSCFG_RESERVED2_OFFSET     0x0024    /*!< Reserved,                                                          0x24 */
#define SYSCFG_RESERVED4_OFFSET     0x0028    /*!< Reserved,                                                          0x28 */
#define SYSCFG_RESERVED5_OFFSET     0x002C    /*!< Reserved,                                                          0x2C */
#define SYSCFG_RESERVED6_OFFSET     0x0030    /*!< Reserved,                                                          0x30 */
#define SYSCFG_RESERVED7_OFFSET     0x0034    /*!< Reserved,                                                          0x34 */
#define SYSCFG_RESERVED8_OFFSET     0x0038    /*!< Reserved,                                                          0x38 */
#define SYSCFG_RESERVED9_OFFSET     0x003C    /*!< Reserved,                                                          0x3C */
#define SYSCFG_RESERVED10_OFFSET    0x0040    /*!< Reserved,                                                          0x40 */
#define SYSCFG_RESERVED11_OFFSET    0x0044    /*!< Reserved,                                                          0x44 */
#define SYSCFG_CFGR4_OFFSET         0x0048    /*!< SYSCFG configuration register 4,                   Address offset: 0x48 */
#define SYSCFG_RESERVED13_OFFSET    0x004C    /*!< Reserved,                                                          0x4C */
#define SYSCFG_CFGR3_OFFSET         0x0050    /*!< SYSCFG configuration register 3,                   Address offset: 0x50 */

/**
  * @brief Inter-integrated Circuit Interface
  */

