the-nw1-group/acb-modules/acb-common/include/stm/stm32f30x.inc
#define I2C_CR1_OFFSET         0x0000    /*!< I2C Control register 1,            Address offset: 0x00 */
#define I2C_CR2_OFFSET         0x0004    /*!< I2C Control register 2,            Address offset: 0x04 */
#define I2C_OAR1_OFFSET        0x0008    /*!< I2C Own address 1 register,        Address offset: 0x08 */
#define I2C_OAR2_OFFSET        0x000C    /*!< I2C Own address 2 register,        Address offset: 0x0C */
#define I2C_TIMINGR_OFFSET     0x0010    /*!< I2C Timing register,               Address offset: 0x10 */
#define I2C_TIMEOUTR_OFFSET    0x0014    /*!< I2C Timeout register,              Address offset: 0x14 */
#define I2C_ISR_OFFSET         0x0018    /*!< I2C Interrupt and status register, Address offset: 0x18 */
#define I2C_ICR_OFFSET         0x001C    /*!< I2C Interrupt clear register,      Address offset: 0x1C */
#define I2C_PECR_OFFSET        0x0020    /*!< I2C PEC register,                  Address offset: 0x20 */
#define I2C_RXDR_OFFSET        0x0024    /*!< I2C Receive data register,         Address offset: 0x24 */
#define I2C_TXDR_OFFSET        0x0028    /*!< I2C Transmit data register,        Address offset: 0x28 */

/**
  * @brief Independent WATCHDOG
  */

#define IWDG_KR_OFFSET      0x0000    /*!< IWDG Key register,       Address offset: 0x00 */
#define IWDG_PR_OFFSET      0x0004    /*!< IWDG Prescaler register, Address offset: 0x04 */
#define IWDG_RLR_OFFSET     0x0008    /*!< IWDG Reload register,    Address offset: 0x08 */
#define IWDG_SR_OFFSET      0x000C    /*!< IWDG Status register,    Address offset: 0x0C */
#define IWDG_WINR_OFFSET    0x0010    /*!< IWDG Window register,    Address offset: 0x10 */

/**
  * @brief Power Control
  */

#define PWR_CR_OFFSET     0x0000    /*!< PWR power control register,        Address offset: 0x00 */
#define PWR_CSR_OFFSET    0x0004    /*!< PWR power control/status register, Address offset: 0x04 */

/**
  * @brief Reset and Clock Control
  */
#define RCC_CR_OFFSET          0x0000    /*!< RCC clock control register,                                  Address offset: 0x00 */
#define RCC_CFGR_OFFSET        0x0004    /*!< RCC clock configuration register,                            Address offset: 0x04 */
#define RCC_CIR_OFFSET         0x0008    /*!< RCC clock interrupt register,                                Address offset: 0x08 */
#define RCC_APB2RSTR_OFFSET    0x000C    /*!< RCC APB2 peripheral reset register,                          Address offset: 0x0C */
#define RCC_APB1RSTR_OFFSET    0x0010    /*!< RCC APB1 peripheral reset register,                          Address offset: 0x10 */
#define RCC_AHBENR_OFFSET      0x0014    /*!< RCC AHB peripheral clock register,                           Address offset: 0x14 */
#define RCC_APB2ENR_OFFSET     0x0018    /*!< RCC APB2 peripheral clock enable register,                   Address offset: 0x18 */
#define RCC_APB1ENR_OFFSET     0x001C    /*!< RCC APB1 peripheral clock enable register,                   Address offset: 0x1C */
#define RCC_BDCR_OFFSET        0x0020    /*!< RCC Backup domain control register,                          Address offset: 0x20 */
#define RCC_CSR_OFFSET         0x0024    /*!< RCC clock control & status register,                         Address offset: 0x24 */
#define RCC_AHBRSTR_OFFSET     0x0028    /*!< RCC AHB peripheral reset register,                           Address offset: 0x28 */
#define RCC_CFGR2_OFFSET       0x002C    /*!< RCC clock configuration register 2,                          Address offset: 0x2C */
#define RCC_CFGR3_OFFSET       0x0030    /*!< RCC clock configuration register 3,                          Address offset: 0x30 */

/**
  * @brief Real-Time Clock
  */

#define RTC_TR_OFFSET           0x0000    /*!< RTC time register,                                        Address offset: 0x00 */
#define RTC_DR_OFFSET           0x0004    /*!< RTC date register,                                        Address offset: 0x04 */
#define RTC_CR_OFFSET           0x0008    /*!< RTC control register,                                     Address offset: 0x08 */
#define RTC_ISR_OFFSET          0x000C    /*!< RTC initialization and status register,                   Address offset: 0x0C */
#define RTC_PRER_OFFSET         0x0010    /*!< RTC prescaler register,                                   Address offset: 0x10 */
#define RTC_WUTR_OFFSET         0x0014    /*!< RTC wakeup timer register,                                Address offset: 0x14 */
#define RTC_RESERVED0_OFFSET    0x0018    /*!< Reserved, 0x18                                                                 */
#define RTC_ALRMAR_OFFSET       0x001C    /*!< RTC alarm A register,                                     Address offset: 0x1C */
#define RTC_ALRMBR_OFFSET       0x0020    /*!< RTC alarm B register,                                     Address offset: 0x20 */
#define RTC_WPR_OFFSET          0x0024    /*!< RTC write protection register,                            Address offset: 0x24 */
#define RTC_SSR_OFFSET          0x0028    /*!< RTC sub second register,                                  Address offset: 0x28 */
#define RTC_SHIFTR_OFFSET       0x002C    /*!< RTC shift control register,                               Address offset: 0x2C */
#define RTC_TSTR_OFFSET         0x0030    /*!< RTC time stamp time register,                             Address offset: 0x30 */
#define RTC_TSDR_OFFSET         0x0034    /*!< RTC time stamp date register,                             Address offset: 0x34 */
#define RTC_TSSSR_OFFSET        0x0038    /*!< RTC time-stamp sub second register,                       Address offset: 0x38 */
#define RTC_CALR_OFFSET         0x003C    /*!< RTC calibration register,                                 Address offset: 0x3C */
#define RTC_TAFCR_OFFSET        0x0040    /*!< RTC tamper and alternate function configuration register, Address offset: 0x40 */
#define RTC_ALRMASSR_OFFSET     0x0044    /*!< RTC alarm A sub second register,                          Address offset: 0x44 */
#define RTC_ALRMBSSR_OFFSET     0x0048    /*!< RTC alarm B sub second register,                          Address offset: 0x48 */
#define RTC_RESERVED7_OFFSET    0x004C    /*!< Reserved, 0x4C                                                                 */
#define RTC_BKP0R_OFFSET        0x0050    /*!< RTC backup register 0,                                    Address offset: 0x50 */
#define RTC_BKP1R_OFFSET        0x0054    /*!< RTC backup register 1,                                    Address offset: 0x54 */
#define RTC_BKP2R_OFFSET        0x0058    /*!< RTC backup register 2,                                    Address offset: 0x58 */
#define RTC_BKP3R_OFFSET        0x005C    /*!< RTC backup register 3,                                    Address offset: 0x5C */
#define RTC_BKP4R_OFFSET        0x0060    /*!< RTC backup register 4,                                    Address offset: 0x60 */
#define RTC_BKP5R_OFFSET        0x0064    /*!< RTC backup register 5,                                    Address offset: 0x64 */
#define RTC_BKP6R_OFFSET        0x0068    /*!< RTC backup register 6,                                    Address offset: 0x68 */
#define RTC_BKP7R_OFFSET        0x006C    /*!< RTC backup register 7,                                    Address offset: 0x6C */
#define RTC_BKP8R_OFFSET        0x0070    /*!< RTC backup register 8,                                    Address offset: 0x70 */
#define RTC_BKP9R_OFFSET        0x0074    /*!< RTC backup register 9,                                    Address offset: 0x74 */
#define RTC_BKP10R_OFFSET       0x0078    /*!< RTC backup register 10,                                   Address offset: 0x78 */
#define RTC_BKP11R_OFFSET       0x007C    /*!< RTC backup register 11,                                   Address offset: 0x7C */
#define RTC_BKP12R_OFFSET       0x0080    /*!< RTC backup register 12,                                   Address offset: 0x80 */
#define RTC_BKP13R_OFFSET       0x0084    /*!< RTC backup register 13,                                   Address offset: 0x84 */
#define RTC_BKP14R_OFFSET       0x0088    /*!< RTC backup register 14,                                   Address offset: 0x88 */
#define RTC_BKP15R_OFFSET       0x008C    /*!< RTC backup register 15,                                   Address offset: 0x8C */


/**
  * @brief Serial Peripheral Interface
  */

#define SPI_CR1_OFFSET          0x0000    /*!< SPI Control register 1 (not used in I2S mode),       Address offset: 0x00 */
#define SPI_RESERVED0_OFFSET    0x0002    /*!< Reserved, 0x02                                                            */
#define SPI_CR2_OFFSET          0x0004    /*!< SPI Control register 2,                              Address offset: 0x04 */
#define SPI_RESERVED1_OFFSET    0x0006    /*!< Reserved, 0x06                                                            */
#define SPI_SR_OFFSET           0x0008    /*!< SPI Status register,                                 Address offset: 0x08 */
#define SPI_RESERVED2_OFFSET    0x000A    /*!< Reserved, 0x0A                                                            */
#define SPI_DR_OFFSET           0x000C    /*!< SPI data register,                                   Address offset: 0x0C */
#define SPI_RESERVED3_OFFSET    0x000E    /*!< Reserved, 0x0E                                                            */
#define SPI_CRCPR_OFFSET        0x0010    /*!< SPI CRC polynomial register (not used in I2S mode),  Address offset: 0x10 */
#define SPI_RESERVED4_OFFSET    0x0012    /*!< Reserved, 0x12                                                            */
#define SPI_RXCRCR_OFFSET       0x0014    /*!< SPI Rx CRC register (not used in I2S mode),          Address offset: 0x14 */
#define SPI_RESERVED5_OFFSET    0x0016    /*!< Reserved, 0x16                                                            */
#define SPI_TXCRCR_OFFSET       0x0018    /*!< SPI Tx CRC register (not used in I2S mode),          Address offset: 0x18 */
#define SPI_RESERVED6_OFFSET    0x001A    /*!< Reserved, 0x1A                                                            */
#define SPI_I2SCFGR_OFFSET      0x001C    /*!< SPI_I2S configuration register,                      Address offset: 0x1C */
#define SPI_RESERVED7_OFFSET    0x001E    /*!< Reserved, 0x1E                                                            */
#define SPI_I2SPR_OFFSET        0x0020    /*!< SPI_I2S prescaler register,                          Address offset: 0x20 */
#define SPI_RESERVED8_OFFSET    0x0022    /*!< Reserved, 0x22                                                            */

/**
  * @brief TIM
  */
#define TIM_CR1_OFFSET           0x0000    /*!< TIM control register 1,              Address offset: 0x00 */
#define TIM_RESERVED0_OFFSET     0x0002    /*!< Reserved, 0x02                                            */
#define TIM_CR2_OFFSET           0x0004    /*!< TIM control register 2,              Address offset: 0x04 */
#define TIM_SMCR_OFFSET          0x0008    /*!< TIM slave mode control register,     Address offset: 0x08 */
#define TIM_DIER_OFFSET          0x000C    /*!< TIM DMA/interrupt enable register,   Address offset: 0x0C */
#define TIM_SR_OFFSET            0x0010    /*!< TIM status register,                 Address offset: 0x10 */
#define TIM_EGR_OFFSET           0x0014    /*!< TIM event generation register,       Address offset: 0x14 */
#define TIM_CCMR1_OFFSET         0x0018    /*!< TIM capture/compare mode register 1, Address offset: 0x18 */
#define TIM_CCMR2_OFFSET         0x001C    /*!< TIM capture/compare mode register 2, Address offset: 0x1C */
#define TIM_CCER_OFFSET          0x0020    /*!< TIM capture/compare enable register, Address offset: 0x20 */
#define TIM_CNT_OFFSET           0x0024    /*!< TIM counter register,                Address offset: 0x24 */
#define TIM_PSC_OFFSET           0x0028    /*!< TIM prescaler,                       Address offset: 0x28 */
#define TIM_RESERVED9_OFFSET     0x002A    /*!< Reserved, 0x2A                                            */
#define TIM_ARR_OFFSET           0x002C    /*!< TIM auto-reload register,            Address offset: 0x2C */
#define TIM_RCR_OFFSET           0x0030    /*!< TIM repetition counter register,     Address offset: 0x30 */
#define TIM_RESERVED10_OFFSET    0x0032    /*!< Reserved, 0x32                                            */
#define TIM_CCR1_OFFSET          0x0034    /*!< TIM capture/compare register 1,      Address offset: 0x34 */
#define TIM_CCR2_OFFSET          0x0038    /*!< TIM capture/compare register 2,      Address offset: 0x38 */
#define TIM_CCR3_OFFSET          0x003C    /*!< TIM capture/compare register 3,      Address offset: 0x3C */
#define TIM_CCR4_OFFSET          0x0040    /*!< TIM capture/compare register 4,      Address offset: 0x40 */
#define TIM_BDTR_OFFSET          0x0044    /*!< TIM break and dead-time register,    Address offset: 0x44 */
#define TIM_DCR_OFFSET           0x0048    /*!< TIM DMA control register,            Address offset: 0x48 */
#define TIM_RESERVED12_OFFSET    0x004A    /*!< Reserved, 0x4A                                            */
#define TIM_DMAR_OFFSET          0x004C    /*!< TIM DMA address for full transfer,   Address offset: 0x4C */
#define TIM_RESERVED13_OFFSET    0x004E    /*!< Reserved, 0x4E                                            */
#define TIM_OR_OFFSET            0x0050    /*!< TIM option register,                 Address offset: 0x50 */
#define TIM_CCMR3_OFFSET         0x0052    /*!< TIM capture/compare mode register 3, Address offset: 0x54 */
#define TIM_CCR5_OFFSET          0x0056    /*!< TIM capture/compare register5,      Address offset: 0x58 */
#define TIM_CCR6_OFFSET          0x005A    /*!< TIM capture/compare register 4,      Address offset: 0x5C */


/**
  * @brief Touch Sensing Controller (TSC)
  */
#define TSC_CR_OFFSET           0x0000    /*!< TSC control register,                                     Address offset: 0x00 */
#define TSC_IER_OFFSET          0x0004    /*!< TSC interrupt enable register,                            Address offset: 0x04 */
#define TSC_ICR_OFFSET          0x0008    /*!< TSC interrupt clear register,                             Address offset: 0x08 */
#define TSC_ISR_OFFSET          0x000C    /*!< TSC interrupt status register,                            Address offset: 0x0C */
#define TSC_IOHCR_OFFSET        0x0010    /*!< TSC I/O hysteresis control register,                      Address offset: 0x10 */
#define TSC_RESERVED1_OFFSET    0x0014    /*!< Reserved,                                                 Address offset: 0x14 */
#define TSC_IOASCR_OFFSET       0x0018    /*!< TSC I/O analog switch control register,                   Address offset: 0x18 */
#define TSC_RESERVED2_OFFSET    0x001C    /*!< Reserved,                                                 Address offset: 0x1C */
#define TSC_IOSCR_OFFSET        0x0020    /*!< TSC I/O sampling control register,                        Address offset: 0x20 */
#define TSC_RESERVED3_OFFSET    0x0024    /*!< Reserved,                                                 Address offset: 0x24 */
#define TSC_IOCCR_OFFSET        0x0028    /*!< TSC I/O channel control register,                         Address offset: 0x28 */
#define TSC_RESERVED4_OFFSET    0x002C    /*!< Reserved,                                                 Address offset: 0x2C */
#define TSC_IOGCSR_OFFSET       0x0030    /*!< TSC I/O group control status register,                    Address offset: 0x30 */
#define TSC_IOGXCR_OFFSET       0x0034    /*!< TSC I/O group x counter register,                         Address offset: 0x34-50 */

/**
  * @brief Universal Synchronous Asynchronous Receiver Transmitter
  */

#define USART_CR1_OFFSET          0x0000    /*!< USART Control register 1,                 Address offset: 0x00 */
#define USART_CR2_OFFSET          0x0004    /*!< USART Control register 2,                 Address offset: 0x04 */
#define USART_CR3_OFFSET          0x0008    /*!< USART Control register 3,                 Address offset: 0x08 */
#define USART_BRR_OFFSET          0x000C    /*!< USART Baud rate register,                 Address offset: 0x0C */
#define USART_RESERVED1_OFFSET    0x000E    /*!< Reserved, 0x0E                                                 */
#define USART_GTPR_OFFSET         0x0010    /*!< USART Guard time and prescaler register,  Address offset: 0x10 */
#define USART_RESERVED2_OFFSET    0x0012    /*!< Reserved, 0x12                                                 */
#define USART_RTOR_OFFSET         0x0014    /*!< USART Receiver Time Out register,         Address offset: 0x14 */
#define USART_RQR_OFFSET          0x0018    /*!< USART Request register,                   Address offset: 0x18 */
#define USART_RESERVED3_OFFSET    0x001A    /*!< Reserved, 0x1A                                                 */
#define USART_ISR_OFFSET          0x001C    /*!< USART Interrupt and status register,      Address offset: 0x1C */
#define USART_ICR_OFFSET          0x0020    /*!< USART Interrupt flag Clear register,      Address offset: 0x20 */
#define USART_RDR_OFFSET          0x0024    /*!< USART Receive Data register,              Address offset: 0x24 */
#define USART_RESERVED4_OFFSET    0x0026    /*!< Reserved, 0x26                                                 */
#define USART_TDR_OFFSET          0x0028    /*!< USART Transmit Data register,             Address offset: 0x28 */
#define USART_RESERVED5_OFFSET    0x002A    /*!< Reserved, 0x2A                                                 */

/**
  * @brief Window WATCHDOG
  */
#define WWDG_CR_OFFSET     0x0000    /*!< WWDG Control register,       Address offset: 0x00 */
#define WWDG_CFR_OFFSET    0x0004    /*!< WWDG Configuration register, Address offset: 0x04 */
#define WWDG_SR_OFFSET     0x0008    /*!< WWDG Status register,        Address offset: 0x08 */


/** @addtogroup Peripheral_memory_map
  * @{
  */
#define FLASH_BASE            (0x08000000) /*!< FLASH base address in the alias region                                       */
#define CCMDATARAM_BASE       (0x10000000) /*!< CCM(core coupled memory) data RAM(16 KB) base address in the alias region    */
#define SRAM_BASE             (0x20000000) /*!< SRAM base address in the alias region                                        */
#define PERIPH_BASE           (0x40000000) /*!< Peripheral base address in the alias region                                  */
#define FMC_R_BASE            (0xA0000000) /*!< FMC registers base address                                                   */

