the-nw1-group/acb-modules/acb-common/include/stm/stm32f30x.inc
#define CCMDATARAM_BB_BASE    (0x12000000) /*!< CCM(core coupled memory) data RAM base address in the bit-band region        */
#define SRAM_BB_BASE          (0x22000000) /*!< SRAM base address in the bit-band region                                     */
#define PERIPH_BB_BASE        (0x42000000) /*!< Peripheral base address in the bit-band region                               */

#define APB1PERIPH_BASE       PERIPH_BASE
#define APB2PERIPH_BASE       (PERIPH_BASE + 0x00010000)
#define AHB1PERIPH_BASE       (PERIPH_BASE + 0x00020000)
#define AHB2PERIPH_BASE       (PERIPH_BASE + 0x08000000)
#define AHB3PERIPH_BASE       (PERIPH_BASE + 0x10000000)

#define TIM2_BASE             (APB1PERIPH_BASE + 0x00000000)
#define TIM3_BASE             (APB1PERIPH_BASE + 0x00000400)
#define TIM4_BASE             (APB1PERIPH_BASE + 0x00000800)
#define TIM6_BASE             (APB1PERIPH_BASE + 0x00001000)
#define TIM7_BASE             (APB1PERIPH_BASE + 0x00001400)
#define RTC_BASE              (APB1PERIPH_BASE + 0x00002800)
#define WWDG_BASE             (APB1PERIPH_BASE + 0x00002C00)
#define IWDG_BASE             (APB1PERIPH_BASE + 0x00003000)
#define I2S2ext_BASE          (APB1PERIPH_BASE + 0x00003400)
#define SPI2_BASE             (APB1PERIPH_BASE + 0x00003800)
#define SPI3_BASE             (APB1PERIPH_BASE + 0x00003C00)
#define I2S3ext_BASE          (APB1PERIPH_BASE + 0x00004000)
#define USART2_BASE           (APB1PERIPH_BASE + 0x00004400)
#define USART3_BASE           (APB1PERIPH_BASE + 0x00004800)
#define UART4_BASE            (APB1PERIPH_BASE + 0x00004C00)
#define UART5_BASE            (APB1PERIPH_BASE + 0x00005000)
#define I2C1_BASE             (APB1PERIPH_BASE + 0x00005400)
#define I2C2_BASE             (APB1PERIPH_BASE + 0x00005800)
#define CAN1_BASE             (APB1PERIPH_BASE + 0x00006400)
#define PWR_BASE              (APB1PERIPH_BASE + 0x00007000)
#define DAC1_BASE             (APB1PERIPH_BASE + 0x00007400)
#define I2C3_BASE             (APB1PERIPH_BASE + 0x00007800)
#define DAC2_BASE             (APB1PERIPH_BASE + 0x00009800)
#define DAC_BASE               DAC1_BASE

#define SYSCFG_BASE           (APB2PERIPH_BASE + 0x00000000)
#define COMP_BASE             (APB2PERIPH_BASE + 0x0000001C)
#define COMP1_BASE            (APB2PERIPH_BASE + 0x0000001C)
#define COMP2_BASE            (APB2PERIPH_BASE + 0x00000020)
#define COMP3_BASE            (APB2PERIPH_BASE + 0x00000024)
#define COMP4_BASE            (APB2PERIPH_BASE + 0x00000028)
#define COMP5_BASE            (APB2PERIPH_BASE + 0x0000002C)
#define COMP6_BASE            (APB2PERIPH_BASE + 0x00000030)
#define COMP7_BASE            (APB2PERIPH_BASE + 0x00000034)
#define OPAMP_BASE            (APB2PERIPH_BASE + 0x00000038)
#define OPAMP1_BASE           (APB2PERIPH_BASE + 0x00000038)
#define OPAMP2_BASE           (APB2PERIPH_BASE + 0x0000003C)
#define OPAMP3_BASE           (APB2PERIPH_BASE + 0x00000040)
#define OPAMP4_BASE           (APB2PERIPH_BASE + 0x00000044)
#define EXTI_BASE             (APB2PERIPH_BASE + 0x00000400)
#define TIM1_BASE             (APB2PERIPH_BASE + 0x00002C00)
#define SPI1_BASE             (APB2PERIPH_BASE + 0x00003000)
#define TIM8_BASE             (APB2PERIPH_BASE + 0x00003400)
#define USART1_BASE           (APB2PERIPH_BASE + 0x00003800)
#define SPI4_BASE             (APB2PERIPH_BASE + 0x00003C00)
#define TIM15_BASE            (APB2PERIPH_BASE + 0x00004000)
#define TIM16_BASE            (APB2PERIPH_BASE + 0x00004400)
#define TIM17_BASE            (APB2PERIPH_BASE + 0x00004800)
#define TIM20_BASE            (APB2PERIPH_BASE + 0x00005000)
#define HRTIM1_BASE           (APB2PERIPH_BASE + 0x00007400)
#define HRTIM1_TIMA_BASE      (HRTIM1_BASE + 0x00000080)
#define HRTIM1_TIMB_BASE      (HRTIM1_BASE + 0x00000100)
#define HRTIM1_TIMC_BASE      (HRTIM1_BASE + 0x00000180)
#define HRTIM1_TIMD_BASE      (HRTIM1_BASE + 0x00000200)
#define HRTIM1_TIME_BASE      (HRTIM1_BASE + 0x00000280)
#define HRTIM1_COMMON_BASE    (HRTIM1_BASE + 0x00000380)

#define DMA1_BASE             (AHB1PERIPH_BASE + 0x00000000)
#define DMA1_Channel1_BASE    (AHB1PERIPH_BASE + 0x00000008)
#define DMA1_Channel2_BASE    (AHB1PERIPH_BASE + 0x0000001C)
#define DMA1_Channel3_BASE    (AHB1PERIPH_BASE + 0x00000030)
#define DMA1_Channel4_BASE    (AHB1PERIPH_BASE + 0x00000044)
#define DMA1_Channel5_BASE    (AHB1PERIPH_BASE + 0x00000058)
#define DMA1_Channel6_BASE    (AHB1PERIPH_BASE + 0x0000006C)
#define DMA1_Channel7_BASE    (AHB1PERIPH_BASE + 0x00000080)
#define DMA2_BASE             (AHB1PERIPH_BASE + 0x00000400)
#define DMA2_Channel1_BASE    (AHB1PERIPH_BASE + 0x00000408)
#define DMA2_Channel2_BASE    (AHB1PERIPH_BASE + 0x0000041C)
#define DMA2_Channel3_BASE    (AHB1PERIPH_BASE + 0x00000430)
#define DMA2_Channel4_BASE    (AHB1PERIPH_BASE + 0x00000444)
#define DMA2_Channel5_BASE    (AHB1PERIPH_BASE + 0x00000458)
#define RCC_BASE              (AHB1PERIPH_BASE + 0x00001000)
#define FLASH_R_BASE          (AHB1PERIPH_BASE + 0x00002000) /*!< Flash registers base address */
#define OB_BASE               (0x1FFFF800)     /*!< Flash Option Bytes base address */
#define CRC_BASE              (AHB1PERIPH_BASE + 0x00003000)
#define TSC_BASE              (AHB1PERIPH_BASE + 0x00004000)

#define GPIOA_BASE            (AHB2PERIPH_BASE + 0x0000)
#define GPIOB_BASE            (AHB2PERIPH_BASE + 0x0400)
#define GPIOC_BASE            (AHB2PERIPH_BASE + 0x0800)
#define GPIOD_BASE            (AHB2PERIPH_BASE + 0x0C00)
#define GPIOE_BASE            (AHB2PERIPH_BASE + 0x1000)
#define GPIOF_BASE            (AHB2PERIPH_BASE + 0x1400)
#define GPIOG_BASE            (AHB2PERIPH_BASE + 0x00001800)
#define GPIOH_BASE            (AHB2PERIPH_BASE + 0x00001C00)

#define ADC1_BASE             (AHB3PERIPH_BASE + 0x0000)
#define ADC2_BASE             (AHB3PERIPH_BASE + 0x0100)
#define ADC1_2_BASE           (AHB3PERIPH_BASE + 0x0300)
#define ADC3_BASE             (AHB3PERIPH_BASE + 0x0400)
#define ADC4_BASE             (AHB3PERIPH_BASE + 0x0500)
#define ADC3_4_BASE           (AHB3PERIPH_BASE + 0x0700)

#define FMC_Bank1_R_BASE      (FMC_R_BASE + 0x0000)
#define FMC_Bank1E_R_BASE     (FMC_R_BASE + 0x0104)
#define FMC_Bank2_R_BASE      (FMC_R_BASE + 0x0060)
#define FMC_Bank3_R_BASE      (FMC_R_BASE + 0x0080)
#define FMC_Bank4_R_BASE      (FMC_R_BASE + 0x00A0)

#define DBGMCU_BASE          (0xE0042000) /*!< Debug MCU registers base address */
/**
  * @}
  */

/** @addtogroup Peripheral_declaration
  * @{
  */  
#define TIM2                (TIM2_BASE)
#define _TIM2_CR1           (TIM2 + TIM_CR1_OFFSET)           /*!< TIM control register 1,              Address offset: 0x00 */
#define _TIM2_CR2           (TIM2 + TIM_CR2_OFFSET)           /*!< TIM control register 2,              Address offset: 0x04 */
#define _TIM2_SMCR          (TIM2 + TIM_SMCR_OFFSET)          /*!< TIM slave mode control register,     Address offset: 0x08 */
#define _TIM2_DIER          (TIM2 + TIM_DIER_OFFSET)          /*!< TIM DMA/interrupt enable register,   Address offset: 0x0C */
#define _TIM2_SR            (TIM2 + TIM_SR_OFFSET)            /*!< TIM status register,                 Address offset: 0x10 */
#define _TIM2_EGR           (TIM2 + TIM_EGR_OFFSET)           /*!< TIM event generation register,       Address offset: 0x14 */
#define _TIM2_CCMR1         (TIM2 + TIM_CCMR1_OFFSET)         /*!< TIM capture/compare mode register 1, Address offset: 0x18 */
#define _TIM2_CCMR2         (TIM2 + TIM_CCMR2_OFFSET)         /*!< TIM capture/compare mode register 2, Address offset: 0x1C */
#define _TIM2_CCER          (TIM2 + TIM_CCER_OFFSET)          /*!< TIM capture/compare enable register, Address offset: 0x20 */
#define _TIM2_CNT           (TIM2 + TIM_CNT_OFFSET)           /*!< TIM counter register,                Address offset: 0x24 */
#define _TIM2_PSC           (TIM2 + TIM_PSC_OFFSET)           /*!< TIM prescaler,                       Address offset: 0x28 */
#define _TIM2_ARR           (TIM2 + TIM_ARR_OFFSET)           /*!< TIM auto-reload register,            Address offset: 0x2C */
#define _TIM2_RCR           (TIM2 + TIM_RCR_OFFSET)           /*!< TIM repetition counter register,     Address offset: 0x30 */
#define _TIM2_CCR1          (TIM2 + TIM_CCR1_OFFSET)          /*!< TIM capture/compare register 1,      Address offset: 0x34 */
#define _TIM2_CCR2          (TIM2 + TIM_CCR2_OFFSET)          /*!< TIM capture/compare register 2,      Address offset: 0x38 */
#define _TIM2_CCR3          (TIM2 + TIM_CCR3_OFFSET)          /*!< TIM capture/compare register 3,      Address offset: 0x3C */
#define _TIM2_CCR4          (TIM2 + TIM_CCR4_OFFSET)          /*!< TIM capture/compare register 4,      Address offset: 0x40 */
#define _TIM2_BDTR          (TIM2 + TIM_BDTR_OFFSET)          /*!< TIM break and dead-time register,    Address offset: 0x44 */
#define _TIM2_DCR           (TIM2 + TIM_DCR_OFFSET)           /*!< TIM DMA control register,            Address offset: 0x48 */
#define _TIM2_DMAR          (TIM2 + TIM_DMAR_OFFSET)          /*!< TIM DMA address for full transfer,   Address offset: 0x4C */
#define _TIM2_OR            (TIM2 + TIM_OR_OFFSET)            /*!< TIM option register,                 Address offset: 0x50 */
#define _TIM2_CCMR3         (TIM2 + TIM_CCMR3_OFFSET)         /*!< TIM capture/compare mode register 3, Address offset: 0x54 */
#define _TIM2_CCR5          (TIM2 + TIM_CCR5_OFFSET)          /*!< TIM capture/compare register5,      Address offset: 0x58 */
#define _TIM2_CCR6          (TIM2 + TIM_CCR6_OFFSET)          /*!< TIM capture/compare register 4,      Address offset: 0x5C */

#define TIM3                (TIM3_BASE)
#define _TIM3_CR1           (TIM3 + TIM_CR1_OFFSET)           /*!< TIM control register 1,              Address offset: 0x00 */
#define _TIM3_CR2           (TIM3 + TIM_CR2_OFFSET)           /*!< TIM control register 2,              Address offset: 0x04 */
#define _TIM3_SMCR          (TIM3 + TIM_SMCR_OFFSET)          /*!< TIM slave mode control register,     Address offset: 0x08 */
#define _TIM3_DIER          (TIM3 + TIM_DIER_OFFSET)          /*!< TIM DMA/interrupt enable register,   Address offset: 0x0C */
#define _TIM3_SR            (TIM3 + TIM_SR_OFFSET)            /*!< TIM status register,                 Address offset: 0x10 */
#define _TIM3_EGR           (TIM3 + TIM_EGR_OFFSET)           /*!< TIM event generation register,       Address offset: 0x14 */
#define _TIM3_CCMR1         (TIM3 + TIM_CCMR1_OFFSET)         /*!< TIM capture/compare mode register 1, Address offset: 0x18 */
#define _TIM3_CCMR2         (TIM3 + TIM_CCMR2_OFFSET)         /*!< TIM capture/compare mode register 2, Address offset: 0x1C */
#define _TIM3_CCER          (TIM3 + TIM_CCER_OFFSET)          /*!< TIM capture/compare enable register, Address offset: 0x20 */
#define _TIM3_CNT           (TIM3 + TIM_CNT_OFFSET)           /*!< TIM counter register,                Address offset: 0x24 */
#define _TIM3_PSC           (TIM3 + TIM_PSC_OFFSET)           /*!< TIM prescaler,                       Address offset: 0x28 */
#define _TIM3_ARR           (TIM3 + TIM_ARR_OFFSET)           /*!< TIM auto-reload register,            Address offset: 0x2C */
#define _TIM3_RCR           (TIM3 + TIM_RCR_OFFSET)           /*!< TIM repetition counter register,     Address offset: 0x30 */
#define _TIM3_CCR1          (TIM3 + TIM_CCR1_OFFSET)          /*!< TIM capture/compare register 1,      Address offset: 0x34 */
#define _TIM3_CCR2          (TIM3 + TIM_CCR2_OFFSET)          /*!< TIM capture/compare register 2,      Address offset: 0x38 */
#define _TIM3_CCR3          (TIM3 + TIM_CCR3_OFFSET)          /*!< TIM capture/compare register 3,      Address offset: 0x3C */
#define _TIM3_CCR4          (TIM3 + TIM_CCR4_OFFSET)          /*!< TIM capture/compare register 4,      Address offset: 0x40 */
#define _TIM3_BDTR          (TIM3 + TIM_BDTR_OFFSET)          /*!< TIM break and dead-time register,    Address offset: 0x44 */
#define _TIM3_DCR           (TIM3 + TIM_DCR_OFFSET)           /*!< TIM DMA control register,            Address offset: 0x48 */
#define _TIM3_DMAR          (TIM3 + TIM_DMAR_OFFSET)          /*!< TIM DMA address for full transfer,   Address offset: 0x4C */
#define _TIM3_OR            (TIM3 + TIM_OR_OFFSET)            /*!< TIM option register,                 Address offset: 0x50 */
#define _TIM3_CCMR3         (TIM3 + TIM_CCMR3_OFFSET)         /*!< TIM capture/compare mode register 3, Address offset: 0x54 */
#define _TIM3_CCR5          (TIM3 + TIM_CCR5_OFFSET)          /*!< TIM capture/compare register5,      Address offset: 0x58 */
#define _TIM3_CCR6          (TIM3 + TIM_CCR6_OFFSET)          /*!< TIM capture/compare register 4,      Address offset: 0x5C */

#define TIM4                (TIM4_BASE)
#define _TIM4_CR1           (TIM4 + TIM_CR1_OFFSET)           /*!< TIM control register 1,              Address offset: 0x00 */
#define _TIM4_CR2           (TIM4 + TIM_CR2_OFFSET)           /*!< TIM control register 2,              Address offset: 0x04 */
#define _TIM4_SMCR          (TIM4 + TIM_SMCR_OFFSET)          /*!< TIM slave mode control register,     Address offset: 0x08 */
#define _TIM4_DIER          (TIM4 + TIM_DIER_OFFSET)          /*!< TIM DMA/interrupt enable register,   Address offset: 0x0C */
#define _TIM4_SR            (TIM4 + TIM_SR_OFFSET)            /*!< TIM status register,                 Address offset: 0x10 */
#define _TIM4_EGR           (TIM4 + TIM_EGR_OFFSET)           /*!< TIM event generation register,       Address offset: 0x14 */
#define _TIM4_CCMR1         (TIM4 + TIM_CCMR1_OFFSET)         /*!< TIM capture/compare mode register 1, Address offset: 0x18 */
#define _TIM4_CCMR2         (TIM4 + TIM_CCMR2_OFFSET)         /*!< TIM capture/compare mode register 2, Address offset: 0x1C */
#define _TIM4_CCER          (TIM4 + TIM_CCER_OFFSET)          /*!< TIM capture/compare enable register, Address offset: 0x20 */
#define _TIM4_CNT           (TIM4 + TIM_CNT_OFFSET)           /*!< TIM counter register,                Address offset: 0x24 */
#define _TIM4_PSC           (TIM4 + TIM_PSC_OFFSET)           /*!< TIM prescaler,                       Address offset: 0x28 */
#define _TIM4_ARR           (TIM4 + TIM_ARR_OFFSET)           /*!< TIM auto-reload register,            Address offset: 0x2C */
#define _TIM4_RCR           (TIM4 + TIM_RCR_OFFSET)           /*!< TIM repetition counter register,     Address offset: 0x30 */
#define _TIM4_CCR1          (TIM4 + TIM_CCR1_OFFSET)          /*!< TIM capture/compare register 1,      Address offset: 0x34 */
#define _TIM4_CCR2          (TIM4 + TIM_CCR2_OFFSET)          /*!< TIM capture/compare register 2,      Address offset: 0x38 */
#define _TIM4_CCR3          (TIM4 + TIM_CCR3_OFFSET)          /*!< TIM capture/compare register 3,      Address offset: 0x3C */
#define _TIM4_CCR4          (TIM4 + TIM_CCR4_OFFSET)          /*!< TIM capture/compare register 4,      Address offset: 0x40 */
#define _TIM4_BDTR          (TIM4 + TIM_BDTR_OFFSET)          /*!< TIM break and dead-time register,    Address offset: 0x44 */
#define _TIM4_DCR           (TIM4 + TIM_DCR_OFFSET)           /*!< TIM DMA control register,            Address offset: 0x48 */
#define _TIM4_DMAR          (TIM4 + TIM_DMAR_OFFSET)          /*!< TIM DMA address for full transfer,   Address offset: 0x4C */
#define _TIM4_OR            (TIM4 + TIM_OR_OFFSET)            /*!< TIM option register,                 Address offset: 0x50 */
#define _TIM4_CCMR3         (TIM4 + TIM_CCMR3_OFFSET)         /*!< TIM capture/compare mode register 3, Address offset: 0x54 */
#define _TIM4_CCR5          (TIM4 + TIM_CCR5_OFFSET)          /*!< TIM capture/compare register5,      Address offset: 0x58 */
#define _TIM4_CCR6          (TIM4 + TIM_CCR6_OFFSET)          /*!< TIM capture/compare register 4,      Address offset: 0x5C */

