the-nw1-group/acb-modules/acb-common/include/stm/stm32f30x.inc
#define I2C3                (I2C3_BASE)
#define _I2C3_CR1         (I2C3 + I2C_CR1_OFFSET)         /*!< I2C Control register 1,            Address offset: 0x00 */
#define _I2C3_CR2         (I2C3 + I2C_CR2_OFFSET)         /*!< I2C Control register 2,            Address offset: 0x04 */
#define _I2C3_OAR1        (I2C3 + I2C_OAR1_OFFSET)        /*!< I2C Own address 1 register,        Address offset: 0x08 */
#define _I2C3_OAR2        (I2C3 + I2C_OAR2_OFFSET)        /*!< I2C Own address 2 register,        Address offset: 0x0C */
#define _I2C3_TIMINGR     (I2C3 + I2C_TIMINGR_OFFSET)     /*!< I2C Timing register,               Address offset: 0x10 */
#define _I2C3_TIMEOUTR    (I2C3 + I2C_TIMEOUTR_OFFSET)    /*!< I2C Timeout register,              Address offset: 0x14 */
#define _I2C3_ISR         (I2C3 + I2C_ISR_OFFSET)         /*!< I2C Interrupt and status register, Address offset: 0x18 */
#define _I2C3_ICR         (I2C3 + I2C_ICR_OFFSET)         /*!< I2C Interrupt clear register,      Address offset: 0x1C */
#define _I2C3_PECR        (I2C3 + I2C_PECR_OFFSET)        /*!< I2C PEC register,                  Address offset: 0x20 */
#define _I2C3_RXDR        (I2C3 + I2C_RXDR_OFFSET)        /*!< I2C Receive data register,         Address offset: 0x24 */
#define _I2C3_TXDR        (I2C3 + I2C_TXDR_OFFSET)        /*!< I2C Transmit data register,        Address offset: 0x28 */

#define CAN1                (CAN1_BASE)
#define _CAN1_MCR                (CAN1 + CAN_MCR_OFFSET)                /*!< CAN master control register,         Address offset: 0x00          */
#define _CAN1_MSR                (CAN1 + CAN_MSR_OFFSET)                /*!< CAN master status register,          Address offset: 0x04          */
#define _CAN1_TSR                (CAN1 + CAN_TSR_OFFSET)                /*!< CAN transmit status register,        Address offset: 0x08          */
#define _CAN1_RF0R               (CAN1 + CAN_RF0R_OFFSET)               /*!< CAN receive FIFO 0 register,         Address offset: 0x0C          */
#define _CAN1_RF1R               (CAN1 + CAN_RF1R_OFFSET)               /*!< CAN receive FIFO 1 register,         Address offset: 0x10          */
#define _CAN1_IER                (CAN1 + CAN_IER_OFFSET)                /*!< CAN interrupt enable register,       Address offset: 0x14          */
#define _CAN1_ESR                (CAN1 + CAN_ESR_OFFSET)                /*!< CAN error status register,           Address offset: 0x18          */
#define _CAN1_BTR                (CAN1 + CAN_BTR_OFFSET)                /*!< CAN bit timing register,             Address offset: 0x1C          */
#define _CAN1_sTxMailBox         (CAN1 + CAN_sTxMailBox_OFFSET)         /*!< CAN Tx MailBox,                      Address offset: 0x180 - 0x1AC */
#define _CAN1_sFIFOMailBox       (CAN1 + CAN_sFIFOMailBox_OFFSET)       /*!< CAN FIFO MailBox,                    Address offset: 0x1B0 - 0x1CC */
#define _CAN1_FMR                (CAN1 + CAN_FMR_OFFSET)                /*!< CAN filter master register,          Address offset: 0x200         */
#define _CAN1_FM1R               (CAN1 + CAN_FM1R_OFFSET)               /*!< CAN filter mode register,            Address offset: 0x204         */
#define _CAN1_FS1R               (CAN1 + CAN_FS1R_OFFSET)               /*!< CAN filter scale register,           Address offset: 0x20C         */
#define _CAN1_FFA1R              (CAN1 + CAN_FFA1R_OFFSET)              /*!< CAN filter FIFO assignment register, Address offset: 0x214         */
#define _CAN1_FA1R               (CAN1 + CAN_FA1R_OFFSET)               /*!< CAN filter activation register,      Address offset: 0x21C         */
#define _CAN1_sFilterRegister    (CAN1 + CAN_sFilterRegister_OFFSET)    /*!< CAN Filter Register,                 Address offset: 0x240-0x31C   */

#define PWR                 (PWR_BASE)
#define _PWR_CR     (PWR + PWR_CR_OFFSET)     /*!< PWR power control register,        Address offset: 0x00 */
#define _PWR_CSR    (PWR + PWR_CSR_OFFSET)    /*!< PWR power control/status register, Address offset: 0x04 */

#define DAC1                (DAC1_BASE)
#define _DAC1_CR         (DAC1 + DAC_CR_OFFSET)         /*!< DAC control register,                                    Address offset: 0x00 */
#define _DAC1_SWTRIGR    (DAC1 + DAC_SWTRIGR_OFFSET)    /*!< DAC software trigger register,                           Address offset: 0x04 */
#define _DAC1_DHR12R1    (DAC1 + DAC_DHR12R1_OFFSET)    /*!< DAC channel1 12-bit right-aligned data holding register, Address offset: 0x08 */
#define _DAC1_DHR12L1    (DAC1 + DAC_DHR12L1_OFFSET)    /*!< DAC channel1 12-bit left aligned data holding register,  Address offset: 0x0C */
#define _DAC1_DHR8R1     (DAC1 + DAC_DHR8R1_OFFSET)     /*!< DAC channel1 8-bit right aligned data holding register,  Address offset: 0x10 */
#define _DAC1_DHR12R2    (DAC1 + DAC_DHR12R2_OFFSET)    /*!< DAC channel2 12-bit right aligned data holding register, Address offset: 0x14 */
#define _DAC1_DHR12L2    (DAC1 + DAC_DHR12L2_OFFSET)    /*!< DAC channel2 12-bit left aligned data holding register,  Address offset: 0x18 */
#define _DAC1_DHR8R2     (DAC1 + DAC_DHR8R2_OFFSET)     /*!< DAC channel2 8-bit right-aligned data holding register,  Address offset: 0x1C */
#define _DAC1_DHR12RD    (DAC1 + DAC_DHR12RD_OFFSET)    /*!< Dual DAC 12-bit right-aligned data holding register,     Address offset: 0x20 */
#define _DAC1_DHR12LD    (DAC1 + DAC_DHR12LD_OFFSET)    /*!< DUAL DAC 12-bit left aligned data holding register,      Address offset: 0x24 */
#define _DAC1_DHR8RD     (DAC1 + DAC_DHR8RD_OFFSET)     /*!< DUAL DAC 8-bit right aligned data holding register,      Address offset: 0x28 */
#define _DAC1_DOR1       (DAC1 + DAC_DOR1_OFFSET)       /*!< DAC channel1 data output register,                       Address offset: 0x2C */
#define _DAC1_DOR2       (DAC1 + DAC_DOR2_OFFSET)       /*!< DAC channel2 data output register,                       Address offset: 0x30 */
#define _DAC1_SR         (DAC1 + DAC_SR_OFFSET)         /*!< DAC status register,                                     Address offset: 0x34 */

#define DAC2                (DAC2_BASE)
#define _DAC2_CR         (DAC2 + DAC_CR_OFFSET)         /*!< DAC control register,                                    Address offset: 0x00 */
#define _DAC2_SWTRIGR    (DAC2 + DAC_SWTRIGR_OFFSET)    /*!< DAC software trigger register,                           Address offset: 0x04 */
#define _DAC2_DHR12R1    (DAC2 + DAC_DHR12R1_OFFSET)    /*!< DAC channel1 12-bit right-aligned data holding register, Address offset: 0x08 */
#define _DAC2_DHR12L1    (DAC2 + DAC_DHR12L1_OFFSET)    /*!< DAC channel1 12-bit left aligned data holding register,  Address offset: 0x0C */
#define _DAC2_DHR8R1     (DAC2 + DAC_DHR8R1_OFFSET)     /*!< DAC channel1 8-bit right aligned data holding register,  Address offset: 0x10 */
#define _DAC2_DHR12R2    (DAC2 + DAC_DHR12R2_OFFSET)    /*!< DAC channel2 12-bit right aligned data holding register, Address offset: 0x14 */
#define _DAC2_DHR12L2    (DAC2 + DAC_DHR12L2_OFFSET)    /*!< DAC channel2 12-bit left aligned data holding register,  Address offset: 0x18 */
#define _DAC2_DHR8R2     (DAC2 + DAC_DHR8R2_OFFSET)     /*!< DAC channel2 8-bit right-aligned data holding register,  Address offset: 0x1C */
#define _DAC2_DHR12RD    (DAC2 + DAC_DHR12RD_OFFSET)    /*!< Dual DAC 12-bit right-aligned data holding register,     Address offset: 0x20 */
#define _DAC2_DHR12LD    (DAC2 + DAC_DHR12LD_OFFSET)    /*!< DUAL DAC 12-bit left aligned data holding register,      Address offset: 0x24 */
#define _DAC2_DHR8RD     (DAC2 + DAC_DHR8RD_OFFSET)     /*!< DUAL DAC 8-bit right aligned data holding register,      Address offset: 0x28 */
#define _DAC2_DOR1       (DAC2 + DAC_DOR1_OFFSET)       /*!< DAC channel1 data output register,                       Address offset: 0x2C */
#define _DAC2_DOR2       (DAC2 + DAC_DOR2_OFFSET)       /*!< DAC channel2 data output register,                       Address offset: 0x30 */
#define _DAC2_SR         (DAC2 + DAC_SR_OFFSET)         /*!< DAC status register,                                     Address offset: 0x34 */

