the-nw1-group/acb-modules/acb-common/include/stm/stm32f30x.inc
#define DAC                  DAC1
#define SYSCFG              (SYSCFG_BASE)
#define _SYSCFG_CFGR1         (SYSCFG + SYSCFG_CFGR1_OFFSET)         /*!< SYSCFG configuration register 1,                   Address offset: 0x00 */
#define _SYSCFG_RCR           (SYSCFG + SYSCFG_RCR_OFFSET)           /*!< SYSCFG CCM SRAM protection register,               Address offset: 0x04 */
#define _SYSCFG_EXTICR        (SYSCFG + SYSCFG_EXTICR_OFFSET)        /*!< SYSCFG external interrupt configuration registers, Address offset: 0x14-0x08 */
#define _SYSCFG_CFGR2         (SYSCFG + SYSCFG_CFGR2_OFFSET)         /*!< SYSCFG configuration register 2,                    Address offset: 0x18 */
#define _SYSCFG_CFGR4         (SYSCFG + SYSCFG_CFGR4_OFFSET)         /*!< SYSCFG configuration register 4,                   Address offset: 0x48 */
#define _SYSCFG_CFGR3         (SYSCFG + SYSCFG_CFGR3_OFFSET)         /*!< SYSCFG configuration register 3,                   Address offset: 0x50 */

#define COMP                (COMP_BASE)
#define _COMP_CSR    (COMP + COMP_CSR_OFFSET)    /*!< Comparator control Status register, Address offset: 0x00 */

#define COMP1               (COMP1_BASE)
#define _COMP1_CSR    (COMP1 + COMP_CSR_OFFSET)    /*!< Comparator control Status register, Address offset: 0x00 */

#define COMP2               (COMP2_BASE)
#define _COMP2_CSR    (COMP2 + COMP_CSR_OFFSET)    /*!< Comparator control Status register, Address offset: 0x00 */

#define COMP3               (COMP3_BASE)
#define _COMP3_CSR    (COMP3 + COMP_CSR_OFFSET)    /*!< Comparator control Status register, Address offset: 0x00 */

#define COMP4               (COMP4_BASE)
#define _COMP4_CSR    (COMP4 + COMP_CSR_OFFSET)    /*!< Comparator control Status register, Address offset: 0x00 */

#define COMP5               (COMP5_BASE)
#define _COMP5_CSR    (COMP5 + COMP_CSR_OFFSET)    /*!< Comparator control Status register, Address offset: 0x00 */

#define COMP6               (COMP6_BASE)
#define _COMP6_CSR    (COMP6 + COMP_CSR_OFFSET)    /*!< Comparator control Status register, Address offset: 0x00 */

#define COMP7               (COMP7_BASE)
#define _COMP7_CSR    (COMP7 + COMP_CSR_OFFSET)    /*!< Comparator control Status register, Address offset: 0x00 */

#define OPAMP               (OPAMP_BASE)
#define _OPAMP_CSR    (OPAMP + OPAMP_CSR_OFFSET)    /*!< OPAMP control and status register,            Address offset: 0x00 */

#define OPAMP1              (OPAMP1_BASE)
#define _OPAMP1_CSR    (OPAMP1 + OPAMP_CSR_OFFSET)    /*!< OPAMP control and status register,            Address offset: 0x00 */

#define OPAMP2              (OPAMP2_BASE)
#define _OPAMP2_CSR    (OPAMP2 + OPAMP_CSR_OFFSET)    /*!< OPAMP control and status register,            Address offset: 0x00 */

#define OPAMP3              (OPAMP3_BASE)
#define _OPAMP3_CSR    (OPAMP3 + OPAMP_CSR_OFFSET)    /*!< OPAMP control and status register,            Address offset: 0x00 */

#define OPAMP4              (OPAMP4_BASE)
#define _OPAMP4_CSR    (OPAMP4 + OPAMP_CSR_OFFSET)    /*!< OPAMP control and status register,            Address offset: 0x00 */

#define EXTI                (EXTI_BASE)
#define _EXTI_IMR          (EXTI + EXTI_IMR_OFFSET)          /*!< EXTI Interrupt mask register,                Address offset: 0x00 */
#define _EXTI_EMR          (EXTI + EXTI_EMR_OFFSET)          /*!< EXTI Event mask register,                    Address offset: 0x04 */
#define _EXTI_RTSR         (EXTI + EXTI_RTSR_OFFSET)         /*!< EXTI Rising trigger selection register,      Address offset: 0x08 */
#define _EXTI_FTSR         (EXTI + EXTI_FTSR_OFFSET)         /*!< EXTI Falling trigger selection register,     Address offset: 0x0C */
#define _EXTI_SWIER        (EXTI + EXTI_SWIER_OFFSET)        /*!< EXTI Software interrupt event register,      Address offset: 0x10 */
#define _EXTI_PR           (EXTI + EXTI_PR_OFFSET)           /*!< EXTI Pending register,                       Address offset: 0x14 */
#define _EXTI_IMR2         (EXTI + EXTI_IMR2_OFFSET)         /*!< EXTI Interrupt mask register,                Address offset: 0x20 */
#define _EXTI_EMR2         (EXTI + EXTI_EMR2_OFFSET)         /*!< EXTI Event mask register,                    Address offset: 0x24 */
#define _EXTI_RTSR2        (EXTI + EXTI_RTSR2_OFFSET)        /*!< EXTI Rising trigger selection register,      Address offset: 0x28 */
#define _EXTI_FTSR2        (EXTI + EXTI_FTSR2_OFFSET)        /*!< EXTI Falling trigger selection register,     Address offset: 0x2C */
#define _EXTI_SWIER2       (EXTI + EXTI_SWIER2_OFFSET)       /*!< EXTI Software interrupt event register,      Address offset: 0x30 */
#define _EXTI_PR2          (EXTI + EXTI_PR2_OFFSET)          /*!< EXTI Pending register,                       Address offset: 0x34 */

#define TIM1                (TIM1_BASE)
#define _TIM1_CR1           (TIM1 + TIM_CR1_OFFSET)           /*!< TIM control register 1,              Address offset: 0x00 */
#define _TIM1_CR2           (TIM1 + TIM_CR2_OFFSET)           /*!< TIM control register 2,              Address offset: 0x04 */
#define _TIM1_SMCR          (TIM1 + TIM_SMCR_OFFSET)          /*!< TIM slave mode control register,     Address offset: 0x08 */
#define _TIM1_DIER          (TIM1 + TIM_DIER_OFFSET)          /*!< TIM DMA/interrupt enable register,   Address offset: 0x0C */
#define _TIM1_SR            (TIM1 + TIM_SR_OFFSET)            /*!< TIM status register,                 Address offset: 0x10 */
#define _TIM1_EGR           (TIM1 + TIM_EGR_OFFSET)           /*!< TIM event generation register,       Address offset: 0x14 */
#define _TIM1_CCMR1         (TIM1 + TIM_CCMR1_OFFSET)         /*!< TIM capture/compare mode register 1, Address offset: 0x18 */
#define _TIM1_CCMR2         (TIM1 + TIM_CCMR2_OFFSET)         /*!< TIM capture/compare mode register 2, Address offset: 0x1C */
#define _TIM1_CCER          (TIM1 + TIM_CCER_OFFSET)          /*!< TIM capture/compare enable register, Address offset: 0x20 */
#define _TIM1_CNT           (TIM1 + TIM_CNT_OFFSET)           /*!< TIM counter register,                Address offset: 0x24 */
#define _TIM1_PSC           (TIM1 + TIM_PSC_OFFSET)           /*!< TIM prescaler,                       Address offset: 0x28 */
#define _TIM1_ARR           (TIM1 + TIM_ARR_OFFSET)           /*!< TIM auto-reload register,            Address offset: 0x2C */
#define _TIM1_RCR           (TIM1 + TIM_RCR_OFFSET)           /*!< TIM repetition counter register,     Address offset: 0x30 */
#define _TIM1_CCR1          (TIM1 + TIM_CCR1_OFFSET)          /*!< TIM capture/compare register 1,      Address offset: 0x34 */
#define _TIM1_CCR2          (TIM1 + TIM_CCR2_OFFSET)          /*!< TIM capture/compare register 2,      Address offset: 0x38 */
#define _TIM1_CCR3          (TIM1 + TIM_CCR3_OFFSET)          /*!< TIM capture/compare register 3,      Address offset: 0x3C */
#define _TIM1_CCR4          (TIM1 + TIM_CCR4_OFFSET)          /*!< TIM capture/compare register 4,      Address offset: 0x40 */
#define _TIM1_BDTR          (TIM1 + TIM_BDTR_OFFSET)          /*!< TIM break and dead-time register,    Address offset: 0x44 */
#define _TIM1_DCR           (TIM1 + TIM_DCR_OFFSET)           /*!< TIM DMA control register,            Address offset: 0x48 */
#define _TIM1_DMAR          (TIM1 + TIM_DMAR_OFFSET)          /*!< TIM DMA address for full transfer,   Address offset: 0x4C */
#define _TIM1_OR            (TIM1 + TIM_OR_OFFSET)            /*!< TIM option register,                 Address offset: 0x50 */
#define _TIM1_CCMR3         (TIM1 + TIM_CCMR3_OFFSET)         /*!< TIM capture/compare mode register 3, Address offset: 0x54 */
#define _TIM1_CCR5          (TIM1 + TIM_CCR5_OFFSET)          /*!< TIM capture/compare register5,      Address offset: 0x58 */
#define _TIM1_CCR6          (TIM1 + TIM_CCR6_OFFSET)          /*!< TIM capture/compare register 4,      Address offset: 0x5C */

#define SPI1                (SPI1_BASE)
#define _SPI1_CR1          (SPI1 + SPI_CR1_OFFSET)          /*!< SPI Control register 1 (not used in I2S mode),       Address offset: 0x00 */
#define _SPI1_CR2          (SPI1 + SPI_CR2_OFFSET)          /*!< SPI Control register 2,                              Address offset: 0x04 */
#define _SPI1_SR           (SPI1 + SPI_SR_OFFSET)           /*!< SPI Status register,                                 Address offset: 0x08 */
#define _SPI1_DR           (SPI1 + SPI_DR_OFFSET)           /*!< SPI data register,                                   Address offset: 0x0C */
#define _SPI1_CRCPR        (SPI1 + SPI_CRCPR_OFFSET)        /*!< SPI CRC polynomial register (not used in I2S mode),  Address offset: 0x10 */
#define _SPI1_RXCRCR       (SPI1 + SPI_RXCRCR_OFFSET)       /*!< SPI Rx CRC register (not used in I2S mode),          Address offset: 0x14 */
#define _SPI1_TXCRCR       (SPI1 + SPI_TXCRCR_OFFSET)       /*!< SPI Tx CRC register (not used in I2S mode),          Address offset: 0x18 */
#define _SPI1_I2SCFGR      (SPI1 + SPI_I2SCFGR_OFFSET)      /*!< SPI_I2S configuration register,                      Address offset: 0x1C */
#define _SPI1_I2SPR        (SPI1 + SPI_I2SPR_OFFSET)        /*!< SPI_I2S prescaler register,                          Address offset: 0x20 */

#define TIM8                (TIM8_BASE)
#define _TIM8_CR1           (TIM8 + TIM_CR1_OFFSET)           /*!< TIM control register 1,              Address offset: 0x00 */
#define _TIM8_CR2           (TIM8 + TIM_CR2_OFFSET)           /*!< TIM control register 2,              Address offset: 0x04 */
#define _TIM8_SMCR          (TIM8 + TIM_SMCR_OFFSET)          /*!< TIM slave mode control register,     Address offset: 0x08 */
#define _TIM8_DIER          (TIM8 + TIM_DIER_OFFSET)          /*!< TIM DMA/interrupt enable register,   Address offset: 0x0C */
#define _TIM8_SR            (TIM8 + TIM_SR_OFFSET)            /*!< TIM status register,                 Address offset: 0x10 */
#define _TIM8_EGR           (TIM8 + TIM_EGR_OFFSET)           /*!< TIM event generation register,       Address offset: 0x14 */
#define _TIM8_CCMR1         (TIM8 + TIM_CCMR1_OFFSET)         /*!< TIM capture/compare mode register 1, Address offset: 0x18 */
#define _TIM8_CCMR2         (TIM8 + TIM_CCMR2_OFFSET)         /*!< TIM capture/compare mode register 2, Address offset: 0x1C */
#define _TIM8_CCER          (TIM8 + TIM_CCER_OFFSET)          /*!< TIM capture/compare enable register, Address offset: 0x20 */
#define _TIM8_CNT           (TIM8 + TIM_CNT_OFFSET)           /*!< TIM counter register,                Address offset: 0x24 */
#define _TIM8_PSC           (TIM8 + TIM_PSC_OFFSET)           /*!< TIM prescaler,                       Address offset: 0x28 */
#define _TIM8_ARR           (TIM8 + TIM_ARR_OFFSET)           /*!< TIM auto-reload register,            Address offset: 0x2C */
#define _TIM8_RCR           (TIM8 + TIM_RCR_OFFSET)           /*!< TIM repetition counter register,     Address offset: 0x30 */
#define _TIM8_CCR1          (TIM8 + TIM_CCR1_OFFSET)          /*!< TIM capture/compare register 1,      Address offset: 0x34 */
#define _TIM8_CCR2          (TIM8 + TIM_CCR2_OFFSET)          /*!< TIM capture/compare register 2,      Address offset: 0x38 */
#define _TIM8_CCR3          (TIM8 + TIM_CCR3_OFFSET)          /*!< TIM capture/compare register 3,      Address offset: 0x3C */
#define _TIM8_CCR4          (TIM8 + TIM_CCR4_OFFSET)          /*!< TIM capture/compare register 4,      Address offset: 0x40 */
#define _TIM8_BDTR          (TIM8 + TIM_BDTR_OFFSET)          /*!< TIM break and dead-time register,    Address offset: 0x44 */
#define _TIM8_DCR           (TIM8 + TIM_DCR_OFFSET)           /*!< TIM DMA control register,            Address offset: 0x48 */
#define _TIM8_DMAR          (TIM8 + TIM_DMAR_OFFSET)          /*!< TIM DMA address for full transfer,   Address offset: 0x4C */
#define _TIM8_OR            (TIM8 + TIM_OR_OFFSET)            /*!< TIM option register,                 Address offset: 0x50 */
#define _TIM8_CCMR3         (TIM8 + TIM_CCMR3_OFFSET)         /*!< TIM capture/compare mode register 3, Address offset: 0x54 */
#define _TIM8_CCR5          (TIM8 + TIM_CCR5_OFFSET)          /*!< TIM capture/compare register5,      Address offset: 0x58 */
#define _TIM8_CCR6          (TIM8 + TIM_CCR6_OFFSET)          /*!< TIM capture/compare register 4,      Address offset: 0x5C */

#define USART1              (USART1_BASE)
#define _USART1_CR1          (USART1 + USART_CR1_OFFSET)          /*!< USART Control register 1,                 Address offset: 0x00 */
#define _USART1_CR2          (USART1 + USART_CR2_OFFSET)          /*!< USART Control register 2,                 Address offset: 0x04 */
#define _USART1_CR3          (USART1 + USART_CR3_OFFSET)          /*!< USART Control register 3,                 Address offset: 0x08 */
#define _USART1_BRR          (USART1 + USART_BRR_OFFSET)          /*!< USART Baud rate register,                 Address offset: 0x0C */
#define _USART1_GTPR         (USART1 + USART_GTPR_OFFSET)         /*!< USART Guard time and prescaler register,  Address offset: 0x10 */
#define _USART1_RTOR         (USART1 + USART_RTOR_OFFSET)         /*!< USART Receiver Time Out register,         Address offset: 0x14 */
#define _USART1_RQR          (USART1 + USART_RQR_OFFSET)          /*!< USART Request register,                   Address offset: 0x18 */
#define _USART1_ISR          (USART1 + USART_ISR_OFFSET)          /*!< USART Interrupt and status register,      Address offset: 0x1C */
#define _USART1_ICR          (USART1 + USART_ICR_OFFSET)          /*!< USART Interrupt flag Clear register,      Address offset: 0x20 */
#define _USART1_RDR          (USART1 + USART_RDR_OFFSET)          /*!< USART Receive Data register,              Address offset: 0x24 */
#define _USART1_TDR          (USART1 + USART_TDR_OFFSET)          /*!< USART Transmit Data register,             Address offset: 0x28 */

#define SPI4                (SPI4_BASE)
#define _SPI4_CR1          (SPI4 + SPI_CR1_OFFSET)          /*!< SPI Control register 1 (not used in I2S mode),       Address offset: 0x00 */
#define _SPI4_CR2          (SPI4 + SPI_CR2_OFFSET)          /*!< SPI Control register 2,                              Address offset: 0x04 */
#define _SPI4_SR           (SPI4 + SPI_SR_OFFSET)           /*!< SPI Status register,                                 Address offset: 0x08 */
#define _SPI4_DR           (SPI4 + SPI_DR_OFFSET)           /*!< SPI data register,                                   Address offset: 0x0C */
#define _SPI4_CRCPR        (SPI4 + SPI_CRCPR_OFFSET)        /*!< SPI CRC polynomial register (not used in I2S mode),  Address offset: 0x10 */
#define _SPI4_RXCRCR       (SPI4 + SPI_RXCRCR_OFFSET)       /*!< SPI Rx CRC register (not used in I2S mode),          Address offset: 0x14 */
#define _SPI4_TXCRCR       (SPI4 + SPI_TXCRCR_OFFSET)       /*!< SPI Tx CRC register (not used in I2S mode),          Address offset: 0x18 */
#define _SPI4_I2SCFGR      (SPI4 + SPI_I2SCFGR_OFFSET)      /*!< SPI_I2S configuration register,                      Address offset: 0x1C */
#define _SPI4_I2SPR        (SPI4 + SPI_I2SPR_OFFSET)        /*!< SPI_I2S prescaler register,                          Address offset: 0x20 */

#define TIM15               (TIM15_BASE)
#define _TIM15_CR1           (TIM15 + TIM_CR1_OFFSET)           /*!< TIM control register 1,              Address offset: 0x00 */
#define _TIM15_CR2           (TIM15 + TIM_CR2_OFFSET)           /*!< TIM control register 2,              Address offset: 0x04 */
#define _TIM15_SMCR          (TIM15 + TIM_SMCR_OFFSET)          /*!< TIM slave mode control register,     Address offset: 0x08 */
#define _TIM15_DIER          (TIM15 + TIM_DIER_OFFSET)          /*!< TIM DMA/interrupt enable register,   Address offset: 0x0C */
#define _TIM15_SR            (TIM15 + TIM_SR_OFFSET)            /*!< TIM status register,                 Address offset: 0x10 */
#define _TIM15_EGR           (TIM15 + TIM_EGR_OFFSET)           /*!< TIM event generation register,       Address offset: 0x14 */
#define _TIM15_CCMR1         (TIM15 + TIM_CCMR1_OFFSET)         /*!< TIM capture/compare mode register 1, Address offset: 0x18 */
#define _TIM15_CCMR2         (TIM15 + TIM_CCMR2_OFFSET)         /*!< TIM capture/compare mode register 2, Address offset: 0x1C */
#define _TIM15_CCER          (TIM15 + TIM_CCER_OFFSET)          /*!< TIM capture/compare enable register, Address offset: 0x20 */
#define _TIM15_CNT           (TIM15 + TIM_CNT_OFFSET)           /*!< TIM counter register,                Address offset: 0x24 */
#define _TIM15_PSC           (TIM15 + TIM_PSC_OFFSET)           /*!< TIM prescaler,                       Address offset: 0x28 */
#define _TIM15_ARR           (TIM15 + TIM_ARR_OFFSET)           /*!< TIM auto-reload register,            Address offset: 0x2C */
#define _TIM15_RCR           (TIM15 + TIM_RCR_OFFSET)           /*!< TIM repetition counter register,     Address offset: 0x30 */
#define _TIM15_CCR1          (TIM15 + TIM_CCR1_OFFSET)          /*!< TIM capture/compare register 1,      Address offset: 0x34 */
#define _TIM15_CCR2          (TIM15 + TIM_CCR2_OFFSET)          /*!< TIM capture/compare register 2,      Address offset: 0x38 */
#define _TIM15_CCR3          (TIM15 + TIM_CCR3_OFFSET)          /*!< TIM capture/compare register 3,      Address offset: 0x3C */
#define _TIM15_CCR4          (TIM15 + TIM_CCR4_OFFSET)          /*!< TIM capture/compare register 4,      Address offset: 0x40 */
#define _TIM15_BDTR          (TIM15 + TIM_BDTR_OFFSET)          /*!< TIM break and dead-time register,    Address offset: 0x44 */
#define _TIM15_DCR           (TIM15 + TIM_DCR_OFFSET)           /*!< TIM DMA control register,            Address offset: 0x48 */
#define _TIM15_DMAR          (TIM15 + TIM_DMAR_OFFSET)          /*!< TIM DMA address for full transfer,   Address offset: 0x4C */
#define _TIM15_OR            (TIM15 + TIM_OR_OFFSET)            /*!< TIM option register,                 Address offset: 0x50 */
#define _TIM15_CCMR3         (TIM15 + TIM_CCMR3_OFFSET)         /*!< TIM capture/compare mode register 3, Address offset: 0x54 */
#define _TIM15_CCR5          (TIM15 + TIM_CCR5_OFFSET)          /*!< TIM capture/compare register5,      Address offset: 0x58 */
#define _TIM15_CCR6          (TIM15 + TIM_CCR6_OFFSET)          /*!< TIM capture/compare register 4,      Address offset: 0x5C */

#define TIM16               (TIM16_BASE)
#define _TIM16_CR1           (TIM16 + TIM_CR1_OFFSET)           /*!< TIM control register 1,              Address offset: 0x00 */
#define _TIM16_CR2           (TIM16 + TIM_CR2_OFFSET)           /*!< TIM control register 2,              Address offset: 0x04 */
#define _TIM16_SMCR          (TIM16 + TIM_SMCR_OFFSET)          /*!< TIM slave mode control register,     Address offset: 0x08 */
#define _TIM16_DIER          (TIM16 + TIM_DIER_OFFSET)          /*!< TIM DMA/interrupt enable register,   Address offset: 0x0C */
#define _TIM16_SR            (TIM16 + TIM_SR_OFFSET)            /*!< TIM status register,                 Address offset: 0x10 */
#define _TIM16_EGR           (TIM16 + TIM_EGR_OFFSET)           /*!< TIM event generation register,       Address offset: 0x14 */
#define _TIM16_CCMR1         (TIM16 + TIM_CCMR1_OFFSET)         /*!< TIM capture/compare mode register 1, Address offset: 0x18 */
#define _TIM16_CCMR2         (TIM16 + TIM_CCMR2_OFFSET)         /*!< TIM capture/compare mode register 2, Address offset: 0x1C */
#define _TIM16_CCER          (TIM16 + TIM_CCER_OFFSET)          /*!< TIM capture/compare enable register, Address offset: 0x20 */
#define _TIM16_CNT           (TIM16 + TIM_CNT_OFFSET)           /*!< TIM counter register,                Address offset: 0x24 */
#define _TIM16_PSC           (TIM16 + TIM_PSC_OFFSET)           /*!< TIM prescaler,                       Address offset: 0x28 */
#define _TIM16_ARR           (TIM16 + TIM_ARR_OFFSET)           /*!< TIM auto-reload register,            Address offset: 0x2C */
#define _TIM16_RCR           (TIM16 + TIM_RCR_OFFSET)           /*!< TIM repetition counter register,     Address offset: 0x30 */
#define _TIM16_CCR1          (TIM16 + TIM_CCR1_OFFSET)          /*!< TIM capture/compare register 1,      Address offset: 0x34 */
#define _TIM16_CCR2          (TIM16 + TIM_CCR2_OFFSET)          /*!< TIM capture/compare register 2,      Address offset: 0x38 */
#define _TIM16_CCR3          (TIM16 + TIM_CCR3_OFFSET)          /*!< TIM capture/compare register 3,      Address offset: 0x3C */
#define _TIM16_CCR4          (TIM16 + TIM_CCR4_OFFSET)          /*!< TIM capture/compare register 4,      Address offset: 0x40 */
#define _TIM16_BDTR          (TIM16 + TIM_BDTR_OFFSET)          /*!< TIM break and dead-time register,    Address offset: 0x44 */
#define _TIM16_DCR           (TIM16 + TIM_DCR_OFFSET)           /*!< TIM DMA control register,            Address offset: 0x48 */
#define _TIM16_DMAR          (TIM16 + TIM_DMAR_OFFSET)          /*!< TIM DMA address for full transfer,   Address offset: 0x4C */
#define _TIM16_OR            (TIM16 + TIM_OR_OFFSET)            /*!< TIM option register,                 Address offset: 0x50 */
#define _TIM16_CCMR3         (TIM16 + TIM_CCMR3_OFFSET)         /*!< TIM capture/compare mode register 3, Address offset: 0x54 */
#define _TIM16_CCR5          (TIM16 + TIM_CCR5_OFFSET)          /*!< TIM capture/compare register5,      Address offset: 0x58 */
#define _TIM16_CCR6          (TIM16 + TIM_CCR6_OFFSET)          /*!< TIM capture/compare register 4,      Address offset: 0x5C */

