the-nw1-group/acb-modules/acb-common/include/stm/stm32f30x.inc
#define TIM17               (TIM17_BASE)
#define _TIM17_CR1           (TIM17 + TIM_CR1_OFFSET)           /*!< TIM control register 1,              Address offset: 0x00 */
#define _TIM17_CR2           (TIM17 + TIM_CR2_OFFSET)           /*!< TIM control register 2,              Address offset: 0x04 */
#define _TIM17_SMCR          (TIM17 + TIM_SMCR_OFFSET)          /*!< TIM slave mode control register,     Address offset: 0x08 */
#define _TIM17_DIER          (TIM17 + TIM_DIER_OFFSET)          /*!< TIM DMA/interrupt enable register,   Address offset: 0x0C */
#define _TIM17_SR            (TIM17 + TIM_SR_OFFSET)            /*!< TIM status register,                 Address offset: 0x10 */
#define _TIM17_EGR           (TIM17 + TIM_EGR_OFFSET)           /*!< TIM event generation register,       Address offset: 0x14 */
#define _TIM17_CCMR1         (TIM17 + TIM_CCMR1_OFFSET)         /*!< TIM capture/compare mode register 1, Address offset: 0x18 */
#define _TIM17_CCMR2         (TIM17 + TIM_CCMR2_OFFSET)         /*!< TIM capture/compare mode register 2, Address offset: 0x1C */
#define _TIM17_CCER          (TIM17 + TIM_CCER_OFFSET)          /*!< TIM capture/compare enable register, Address offset: 0x20 */
#define _TIM17_CNT           (TIM17 + TIM_CNT_OFFSET)           /*!< TIM counter register,                Address offset: 0x24 */
#define _TIM17_PSC           (TIM17 + TIM_PSC_OFFSET)           /*!< TIM prescaler,                       Address offset: 0x28 */
#define _TIM17_ARR           (TIM17 + TIM_ARR_OFFSET)           /*!< TIM auto-reload register,            Address offset: 0x2C */
#define _TIM17_RCR           (TIM17 + TIM_RCR_OFFSET)           /*!< TIM repetition counter register,     Address offset: 0x30 */
#define _TIM17_CCR1          (TIM17 + TIM_CCR1_OFFSET)          /*!< TIM capture/compare register 1,      Address offset: 0x34 */
#define _TIM17_CCR2          (TIM17 + TIM_CCR2_OFFSET)          /*!< TIM capture/compare register 2,      Address offset: 0x38 */
#define _TIM17_CCR3          (TIM17 + TIM_CCR3_OFFSET)          /*!< TIM capture/compare register 3,      Address offset: 0x3C */
#define _TIM17_CCR4          (TIM17 + TIM_CCR4_OFFSET)          /*!< TIM capture/compare register 4,      Address offset: 0x40 */
#define _TIM17_BDTR          (TIM17 + TIM_BDTR_OFFSET)          /*!< TIM break and dead-time register,    Address offset: 0x44 */
#define _TIM17_DCR           (TIM17 + TIM_DCR_OFFSET)           /*!< TIM DMA control register,            Address offset: 0x48 */
#define _TIM17_DMAR          (TIM17 + TIM_DMAR_OFFSET)          /*!< TIM DMA address for full transfer,   Address offset: 0x4C */
#define _TIM17_OR            (TIM17 + TIM_OR_OFFSET)            /*!< TIM option register,                 Address offset: 0x50 */
#define _TIM17_CCMR3         (TIM17 + TIM_CCMR3_OFFSET)         /*!< TIM capture/compare mode register 3, Address offset: 0x54 */
#define _TIM17_CCR5          (TIM17 + TIM_CCR5_OFFSET)          /*!< TIM capture/compare register5,      Address offset: 0x58 */
#define _TIM17_CCR6          (TIM17 + TIM_CCR6_OFFSET)          /*!< TIM capture/compare register 4,      Address offset: 0x5C */

#define TIM20               (TIM20_BASE)
#define _TIM20_CR1           (TIM20 + TIM_CR1_OFFSET)           /*!< TIM control register 1,              Address offset: 0x00 */
#define _TIM20_CR2           (TIM20 + TIM_CR2_OFFSET)           /*!< TIM control register 2,              Address offset: 0x04 */
#define _TIM20_SMCR          (TIM20 + TIM_SMCR_OFFSET)          /*!< TIM slave mode control register,     Address offset: 0x08 */
#define _TIM20_DIER          (TIM20 + TIM_DIER_OFFSET)          /*!< TIM DMA/interrupt enable register,   Address offset: 0x0C */
#define _TIM20_SR            (TIM20 + TIM_SR_OFFSET)            /*!< TIM status register,                 Address offset: 0x10 */
#define _TIM20_EGR           (TIM20 + TIM_EGR_OFFSET)           /*!< TIM event generation register,       Address offset: 0x14 */
#define _TIM20_CCMR1         (TIM20 + TIM_CCMR1_OFFSET)         /*!< TIM capture/compare mode register 1, Address offset: 0x18 */
#define _TIM20_CCMR2         (TIM20 + TIM_CCMR2_OFFSET)         /*!< TIM capture/compare mode register 2, Address offset: 0x1C */
#define _TIM20_CCER          (TIM20 + TIM_CCER_OFFSET)          /*!< TIM capture/compare enable register, Address offset: 0x20 */
#define _TIM20_CNT           (TIM20 + TIM_CNT_OFFSET)           /*!< TIM counter register,                Address offset: 0x24 */
#define _TIM20_PSC           (TIM20 + TIM_PSC_OFFSET)           /*!< TIM prescaler,                       Address offset: 0x28 */
#define _TIM20_ARR           (TIM20 + TIM_ARR_OFFSET)           /*!< TIM auto-reload register,            Address offset: 0x2C */
#define _TIM20_RCR           (TIM20 + TIM_RCR_OFFSET)           /*!< TIM repetition counter register,     Address offset: 0x30 */
#define _TIM20_CCR1          (TIM20 + TIM_CCR1_OFFSET)          /*!< TIM capture/compare register 1,      Address offset: 0x34 */
#define _TIM20_CCR2          (TIM20 + TIM_CCR2_OFFSET)          /*!< TIM capture/compare register 2,      Address offset: 0x38 */
#define _TIM20_CCR3          (TIM20 + TIM_CCR3_OFFSET)          /*!< TIM capture/compare register 3,      Address offset: 0x3C */
#define _TIM20_CCR4          (TIM20 + TIM_CCR4_OFFSET)          /*!< TIM capture/compare register 4,      Address offset: 0x40 */
#define _TIM20_BDTR          (TIM20 + TIM_BDTR_OFFSET)          /*!< TIM break and dead-time register,    Address offset: 0x44 */
#define _TIM20_DCR           (TIM20 + TIM_DCR_OFFSET)           /*!< TIM DMA control register,            Address offset: 0x48 */
#define _TIM20_DMAR          (TIM20 + TIM_DMAR_OFFSET)          /*!< TIM DMA address for full transfer,   Address offset: 0x4C */
#define _TIM20_OR            (TIM20 + TIM_OR_OFFSET)            /*!< TIM option register,                 Address offset: 0x50 */
#define _TIM20_CCMR3         (TIM20 + TIM_CCMR3_OFFSET)         /*!< TIM capture/compare mode register 3, Address offset: 0x54 */
#define _TIM20_CCR5          (TIM20 + TIM_CCR5_OFFSET)          /*!< TIM capture/compare register5,      Address offset: 0x58 */
#define _TIM20_CCR6          (TIM20 + TIM_CCR6_OFFSET)          /*!< TIM capture/compare register 4,      Address offset: 0x5C */

#define HRTIM1              (HRTIM1_BASE)
#define _HRTIM1_HRTIM_MASTER    (HRTIM1 + HRTIM_HRTIM_MASTER_OFFSET)    
#define _HRTIM1_HRTIM_TIMERx    (HRTIM1 + HRTIM_HRTIM_TIMERx_OFFSET)    
#define _HRTIM1_HRTIM_COMMON    (HRTIM1 + HRTIM_HRTIM_COMMON_OFFSET)    

#define HRTIM1_TIMA         (HRTIM1_TIMA_BASE)
#define HRTIM1_TIMB         (HRTIM1_TIMB_BASE)
#define HRTIM1_TIMC         (HRTIM1_TIMC_BASE)
#define HRTIM1_TIMD         (HRTIM1_TIMD_BASE)
#define HRTIM1_TIME         (HRTIM1_TIME_BASE)
#define HRTIM1_COMMON       (HRTIM1_COMMON_BASE)
#define _HRTIM1_COMMON_CR1         (HRTIM1_COMMON + HRTIM_Common_CR1_OFFSET)         /*!< HRTIM control register1,                                    Address offset: 0x00 */
#define _HRTIM1_COMMON_CR2         (HRTIM1_COMMON + HRTIM_Common_CR2_OFFSET)         /*!< HRTIM control register2,                                    Address offset: 0x04 */
#define _HRTIM1_COMMON_ISR         (HRTIM1_COMMON + HRTIM_Common_ISR_OFFSET)         /*!< HRTIM interrupt status register,                            Address offset: 0x08 */
#define _HRTIM1_COMMON_ICR         (HRTIM1_COMMON + HRTIM_Common_ICR_OFFSET)         /*!< HRTIM interrupt clear register,                             Address offset: 0x0C */
#define _HRTIM1_COMMON_IER         (HRTIM1_COMMON + HRTIM_Common_IER_OFFSET)         /*!< HRTIM interrupt enable register,                            Address offset: 0x10 */
#define _HRTIM1_COMMON_OENR        (HRTIM1_COMMON + HRTIM_Common_OENR_OFFSET)        /*!< HRTIM Output enable register,                               Address offset: 0x14 */
#define _HRTIM1_COMMON_DISR        (HRTIM1_COMMON + HRTIM_Common_DISR_OFFSET)        /*!< HRTIM Output disable register,                              Address offset: 0x18 */
#define _HRTIM1_COMMON_ODSR        (HRTIM1_COMMON + HRTIM_Common_ODSR_OFFSET)        /*!< HRTIM Output disable status register,                       Address offset: 0x1C */
#define _HRTIM1_COMMON_BMCR        (HRTIM1_COMMON + HRTIM_Common_BMCR_OFFSET)        /*!< HRTIM Burst mode control register,                          Address offset: 0x20 */
#define _HRTIM1_COMMON_BMTRGR      (HRTIM1_COMMON + HRTIM_Common_BMTRGR_OFFSET)      /*!< HRTIM Busrt mode trigger register,                          Address offset: 0x24 */
#define _HRTIM1_COMMON_BMCMPR      (HRTIM1_COMMON + HRTIM_Common_BMCMPR_OFFSET)      /*!< HRTIM Burst mode compare register,                          Address offset: 0x28 */
#define _HRTIM1_COMMON_BMPER       (HRTIM1_COMMON + HRTIM_Common_BMPER_OFFSET)       /*!< HRTIM Burst mode period register,                           Address offset: 0x2C */
#define _HRTIM1_COMMON_EECR1       (HRTIM1_COMMON + HRTIM_Common_EECR1_OFFSET)       /*!< HRTIM Timer external event control register1,               Address offset: 0x30 */
#define _HRTIM1_COMMON_EECR2       (HRTIM1_COMMON + HRTIM_Common_EECR2_OFFSET)       /*!< HRTIM Timer external event control register2,               Address offset: 0x34 */
#define _HRTIM1_COMMON_EECR3       (HRTIM1_COMMON + HRTIM_Common_EECR3_OFFSET)       /*!< HRTIM Timer external event control register3,               Address offset: 0x38 */
#define _HRTIM1_COMMON_ADC1R       (HRTIM1_COMMON + HRTIM_Common_ADC1R_OFFSET)       /*!< HRTIM ADC Trigger 1 register,                               Address offset: 0x3C */
#define _HRTIM1_COMMON_ADC2R       (HRTIM1_COMMON + HRTIM_Common_ADC2R_OFFSET)       /*!< HRTIM ADC Trigger 2 register,                               Address offset: 0x40 */
#define _HRTIM1_COMMON_ADC3R       (HRTIM1_COMMON + HRTIM_Common_ADC3R_OFFSET)       /*!< HRTIM ADC Trigger 3 register,                               Address offset: 0x44 */
#define _HRTIM1_COMMON_ADC4R       (HRTIM1_COMMON + HRTIM_Common_ADC4R_OFFSET)       /*!< HRTIM ADC Trigger 4 register,                               Address offset: 0x48 */
#define _HRTIM1_COMMON_DLLCR       (HRTIM1_COMMON + HRTIM_Common_DLLCR_OFFSET)       /*!< HRTIM DLL control register,                                 Address offset: 0x4C */
#define _HRTIM1_COMMON_FLTINxR1    (HRTIM1_COMMON + HRTIM_Common_FLTINxR1_OFFSET)    /*!< HRTIM Fault input register1,                                Address offset: 0x50 */
#define _HRTIM1_COMMON_FLTINxR2    (HRTIM1_COMMON + HRTIM_Common_FLTINxR2_OFFSET)    /*!< HRTIM Fault input register2,                                Address offset: 0x54 */
#define _HRTIM1_COMMON_BDMUPDR     (HRTIM1_COMMON + HRTIM_Common_BDMUPDR_OFFSET)     /*!< HRTIM Burst DMA Master Timer update register,               Address offset: 0x58 */
#define _HRTIM1_COMMON_BDTAUPR     (HRTIM1_COMMON + HRTIM_Common_BDTAUPR_OFFSET)     /*!< HRTIM Burst DMA Timerx update register,                     Address offset: 0x5C */
#define _HRTIM1_COMMON_BDTBUPR     (HRTIM1_COMMON + HRTIM_Common_BDTBUPR_OFFSET)     /*!< HRTIM Burst DMA Timerx update register,                     Address offset: 0x60 */
#define _HRTIM1_COMMON_BDTCUPR     (HRTIM1_COMMON + HRTIM_Common_BDTCUPR_OFFSET)     /*!< HRTIM Burst DMA Timerx update register,                     Address offset: 0x64 */
#define _HRTIM1_COMMON_BDTDUPR     (HRTIM1_COMMON + HRTIM_Common_BDTDUPR_OFFSET)     /*!< HRTIM Burst DMA Timerx update register,                     Address offset: 0x68 */
#define _HRTIM1_COMMON_BDTEUPR     (HRTIM1_COMMON + HRTIM_Common_BDTEUPR_OFFSET)     /*!< HRTIM Burst DMA Timerx update register,                     Address offset: 0x6C */
#define _HRTIM1_COMMON_BDMADR      (HRTIM1_COMMON + HRTIM_Common_BDMADR_OFFSET)      /*!< HRTIM Burst DMA Master Data register,                       Address offset: 0x70 */

#define DBGMCU              (DBGMCU_BASE)
#define _DBGMCU_IDCODE    (DBGMCU + DBGMCU_IDCODE_OFFSET)    /*!< MCU device ID code,               Address offset: 0x00 */
#define _DBGMCU_CR        (DBGMCU + DBGMCU_CR_OFFSET)        /*!< Debug MCU configuration register, Address offset: 0x04 */
#define _DBGMCU_APB1FZ    (DBGMCU + DBGMCU_APB1FZ_OFFSET)    /*!< Debug MCU APB1 freeze register,   Address offset: 0x08 */
#define _DBGMCU_APB2FZ    (DBGMCU + DBGMCU_APB2FZ_OFFSET)    /*!< Debug MCU APB2 freeze register,   Address offset: 0x0C */

#define DMA1                (DMA1_BASE)
#define _DMA1_ISR     (DMA1 + DMA_ISR_OFFSET)     /*!< DMA interrupt status register,      Address offset: 0x00 */
#define _DMA1_IFCR    (DMA1 + DMA_IFCR_OFFSET)    /*!< DMA interrupt clear flag register,  Address offset: 0x04 */

#define DMA1_Channel1       (DMA1_Channel1_BASE)
#define _DMA1_Channel1_CCR      (DMA1_Channel1 + DMA_Channel_CCR_OFFSET)      /*!< DMA channel x configuration register                                           */
#define _DMA1_Channel1_CNDTR    (DMA1_Channel1 + DMA_Channel_CNDTR_OFFSET)    /*!< DMA channel x number of data register                                          */
#define _DMA1_Channel1_CPAR     (DMA1_Channel1 + DMA_Channel_CPAR_OFFSET)     /*!< DMA channel x peripheral address register                                      */
#define _DMA1_Channel1_CMAR     (DMA1_Channel1 + DMA_Channel_CMAR_OFFSET)     /*!< DMA channel x memory address register                                          */

#define DMA1_Channel2       (DMA1_Channel2_BASE)
#define _DMA1_Channel2_CCR      (DMA1_Channel2 + DMA_Channel_CCR_OFFSET)      /*!< DMA channel x configuration register                                           */
#define _DMA1_Channel2_CNDTR    (DMA1_Channel2 + DMA_Channel_CNDTR_OFFSET)    /*!< DMA channel x number of data register                                          */
#define _DMA1_Channel2_CPAR     (DMA1_Channel2 + DMA_Channel_CPAR_OFFSET)     /*!< DMA channel x peripheral address register                                      */
#define _DMA1_Channel2_CMAR     (DMA1_Channel2 + DMA_Channel_CMAR_OFFSET)     /*!< DMA channel x memory address register                                          */

