the-nw1-group/acb-modules/acb-common/include/stm/stm32f30x.inc
#define DMA1_Channel3       (DMA1_Channel3_BASE)
#define _DMA1_Channel3_CCR      (DMA1_Channel3 + DMA_Channel_CCR_OFFSET)      /*!< DMA channel x configuration register                                           */
#define _DMA1_Channel3_CNDTR    (DMA1_Channel3 + DMA_Channel_CNDTR_OFFSET)    /*!< DMA channel x number of data register                                          */
#define _DMA1_Channel3_CPAR     (DMA1_Channel3 + DMA_Channel_CPAR_OFFSET)     /*!< DMA channel x peripheral address register                                      */
#define _DMA1_Channel3_CMAR     (DMA1_Channel3 + DMA_Channel_CMAR_OFFSET)     /*!< DMA channel x memory address register                                          */

#define DMA1_Channel4       (DMA1_Channel4_BASE)
#define _DMA1_Channel4_CCR      (DMA1_Channel4 + DMA_Channel_CCR_OFFSET)      /*!< DMA channel x configuration register                                           */
#define _DMA1_Channel4_CNDTR    (DMA1_Channel4 + DMA_Channel_CNDTR_OFFSET)    /*!< DMA channel x number of data register                                          */
#define _DMA1_Channel4_CPAR     (DMA1_Channel4 + DMA_Channel_CPAR_OFFSET)     /*!< DMA channel x peripheral address register                                      */
#define _DMA1_Channel4_CMAR     (DMA1_Channel4 + DMA_Channel_CMAR_OFFSET)     /*!< DMA channel x memory address register                                          */

#define DMA1_Channel5       (DMA1_Channel5_BASE)
#define _DMA1_Channel5_CCR      (DMA1_Channel5 + DMA_Channel_CCR_OFFSET)      /*!< DMA channel x configuration register                                           */
#define _DMA1_Channel5_CNDTR    (DMA1_Channel5 + DMA_Channel_CNDTR_OFFSET)    /*!< DMA channel x number of data register                                          */
#define _DMA1_Channel5_CPAR     (DMA1_Channel5 + DMA_Channel_CPAR_OFFSET)     /*!< DMA channel x peripheral address register                                      */
#define _DMA1_Channel5_CMAR     (DMA1_Channel5 + DMA_Channel_CMAR_OFFSET)     /*!< DMA channel x memory address register                                          */

#define DMA1_Channel6       (DMA1_Channel6_BASE)
#define _DMA1_Channel6_CCR      (DMA1_Channel6 + DMA_Channel_CCR_OFFSET)      /*!< DMA channel x configuration register                                           */
#define _DMA1_Channel6_CNDTR    (DMA1_Channel6 + DMA_Channel_CNDTR_OFFSET)    /*!< DMA channel x number of data register                                          */
#define _DMA1_Channel6_CPAR     (DMA1_Channel6 + DMA_Channel_CPAR_OFFSET)     /*!< DMA channel x peripheral address register                                      */
#define _DMA1_Channel6_CMAR     (DMA1_Channel6 + DMA_Channel_CMAR_OFFSET)     /*!< DMA channel x memory address register                                          */

#define DMA1_Channel7       (DMA1_Channel7_BASE)
#define _DMA1_Channel7_CCR      (DMA1_Channel7 + DMA_Channel_CCR_OFFSET)      /*!< DMA channel x configuration register                                           */
#define _DMA1_Channel7_CNDTR    (DMA1_Channel7 + DMA_Channel_CNDTR_OFFSET)    /*!< DMA channel x number of data register                                          */
#define _DMA1_Channel7_CPAR     (DMA1_Channel7 + DMA_Channel_CPAR_OFFSET)     /*!< DMA channel x peripheral address register                                      */
#define _DMA1_Channel7_CMAR     (DMA1_Channel7 + DMA_Channel_CMAR_OFFSET)     /*!< DMA channel x memory address register                                          */

#define DMA2                (DMA2_BASE)
#define _DMA2_ISR     (DMA2 + DMA_ISR_OFFSET)     /*!< DMA interrupt status register,      Address offset: 0x00 */
#define _DMA2_IFCR    (DMA2 + DMA_IFCR_OFFSET)    /*!< DMA interrupt clear flag register,  Address offset: 0x04 */

#define DMA2_Channel1       (DMA2_Channel1_BASE)
#define _DMA2_Channel1_CCR      (DMA2_Channel1 + DMA_Channel_CCR_OFFSET)      /*!< DMA channel x configuration register                                           */
#define _DMA2_Channel1_CNDTR    (DMA2_Channel1 + DMA_Channel_CNDTR_OFFSET)    /*!< DMA channel x number of data register                                          */
#define _DMA2_Channel1_CPAR     (DMA2_Channel1 + DMA_Channel_CPAR_OFFSET)     /*!< DMA channel x peripheral address register                                      */
#define _DMA2_Channel1_CMAR     (DMA2_Channel1 + DMA_Channel_CMAR_OFFSET)     /*!< DMA channel x memory address register                                          */

#define DMA2_Channel2       (DMA2_Channel2_BASE)
#define _DMA2_Channel2_CCR      (DMA2_Channel2 + DMA_Channel_CCR_OFFSET)      /*!< DMA channel x configuration register                                           */
#define _DMA2_Channel2_CNDTR    (DMA2_Channel2 + DMA_Channel_CNDTR_OFFSET)    /*!< DMA channel x number of data register                                          */
#define _DMA2_Channel2_CPAR     (DMA2_Channel2 + DMA_Channel_CPAR_OFFSET)     /*!< DMA channel x peripheral address register                                      */
#define _DMA2_Channel2_CMAR     (DMA2_Channel2 + DMA_Channel_CMAR_OFFSET)     /*!< DMA channel x memory address register                                          */

#define DMA2_Channel3       (DMA2_Channel3_BASE)
#define _DMA2_Channel3_CCR      (DMA2_Channel3 + DMA_Channel_CCR_OFFSET)      /*!< DMA channel x configuration register                                           */
#define _DMA2_Channel3_CNDTR    (DMA2_Channel3 + DMA_Channel_CNDTR_OFFSET)    /*!< DMA channel x number of data register                                          */
#define _DMA2_Channel3_CPAR     (DMA2_Channel3 + DMA_Channel_CPAR_OFFSET)     /*!< DMA channel x peripheral address register                                      */
#define _DMA2_Channel3_CMAR     (DMA2_Channel3 + DMA_Channel_CMAR_OFFSET)     /*!< DMA channel x memory address register                                          */

#define DMA2_Channel4       (DMA2_Channel4_BASE)
#define _DMA2_Channel4_CCR      (DMA2_Channel4 + DMA_Channel_CCR_OFFSET)      /*!< DMA channel x configuration register                                           */
#define _DMA2_Channel4_CNDTR    (DMA2_Channel4 + DMA_Channel_CNDTR_OFFSET)    /*!< DMA channel x number of data register                                          */
#define _DMA2_Channel4_CPAR     (DMA2_Channel4 + DMA_Channel_CPAR_OFFSET)     /*!< DMA channel x peripheral address register                                      */
#define _DMA2_Channel4_CMAR     (DMA2_Channel4 + DMA_Channel_CMAR_OFFSET)     /*!< DMA channel x memory address register                                          */

#define DMA2_Channel5       (DMA2_Channel5_BASE)
#define _DMA2_Channel5_CCR      (DMA2_Channel5 + DMA_Channel_CCR_OFFSET)      /*!< DMA channel x configuration register                                           */
#define _DMA2_Channel5_CNDTR    (DMA2_Channel5 + DMA_Channel_CNDTR_OFFSET)    /*!< DMA channel x number of data register                                          */
#define _DMA2_Channel5_CPAR     (DMA2_Channel5 + DMA_Channel_CPAR_OFFSET)     /*!< DMA channel x peripheral address register                                      */
#define _DMA2_Channel5_CMAR     (DMA2_Channel5 + DMA_Channel_CMAR_OFFSET)     /*!< DMA channel x memory address register                                          */

#define RCC                 (RCC_BASE)
#define _RCC_CR          (RCC + RCC_CR_OFFSET)          /*!< RCC clock control register,                                  Address offset: 0x00 */
#define _RCC_CFGR        (RCC + RCC_CFGR_OFFSET)        /*!< RCC clock configuration register,                            Address offset: 0x04 */
#define _RCC_CIR         (RCC + RCC_CIR_OFFSET)         /*!< RCC clock interrupt register,                                Address offset: 0x08 */
#define _RCC_APB2RSTR    (RCC + RCC_APB2RSTR_OFFSET)    /*!< RCC APB2 peripheral reset register,                          Address offset: 0x0C */
#define _RCC_APB1RSTR    (RCC + RCC_APB1RSTR_OFFSET)    /*!< RCC APB1 peripheral reset register,                          Address offset: 0x10 */
#define _RCC_AHBENR      (RCC + RCC_AHBENR_OFFSET)      /*!< RCC AHB peripheral clock register,                           Address offset: 0x14 */
#define _RCC_APB2ENR     (RCC + RCC_APB2ENR_OFFSET)     /*!< RCC APB2 peripheral clock enable register,                   Address offset: 0x18 */
#define _RCC_APB1ENR     (RCC + RCC_APB1ENR_OFFSET)     /*!< RCC APB1 peripheral clock enable register,                   Address offset: 0x1C */
#define _RCC_BDCR        (RCC + RCC_BDCR_OFFSET)        /*!< RCC Backup domain control register,                          Address offset: 0x20 */
#define _RCC_CSR         (RCC + RCC_CSR_OFFSET)         /*!< RCC clock control & status register,                         Address offset: 0x24 */
#define _RCC_AHBRSTR     (RCC + RCC_AHBRSTR_OFFSET)     /*!< RCC AHB peripheral reset register,                           Address offset: 0x28 */
#define _RCC_CFGR2       (RCC + RCC_CFGR2_OFFSET)       /*!< RCC clock configuration register 2,                          Address offset: 0x2C */
#define _RCC_CFGR3       (RCC + RCC_CFGR3_OFFSET)       /*!< RCC clock configuration register 3,                          Address offset: 0x30 */

#define FLASH               (FLASH_R_BASE)
#define _FLASH_ACR         (FLASH + FLASH_ACR_OFFSET)         /*!< FLASH access control register,              Address offset: 0x00 */
#define _FLASH_KEYR        (FLASH + FLASH_KEYR_OFFSET)        /*!< FLASH key register,                         Address offset: 0x04 */
#define _FLASH_OPTKEYR     (FLASH + FLASH_OPTKEYR_OFFSET)     /*!< FLASH option key register,                  Address offset: 0x08 */
#define _FLASH_SR          (FLASH + FLASH_SR_OFFSET)          /*!< FLASH status register,                      Address offset: 0x0C */
#define _FLASH_CR          (FLASH + FLASH_CR_OFFSET)          /*!< FLASH control register,                     Address offset: 0x10 */
#define _FLASH_AR          (FLASH + FLASH_AR_OFFSET)          /*!< FLASH address register,                     Address offset: 0x14 */
#define _FLASH_OBR         (FLASH + FLASH_OBR_OFFSET)         /*!< FLASH Option byte register,                 Address offset: 0x1C */
#define _FLASH_WRPR        (FLASH + FLASH_WRPR_OFFSET)        /*!< FLASH Write register,                       Address offset: 0x20 */

#define OB                  (OB_BASE)
#define _OB_RDP          (OB + OB_RDP_OFFSET)          /*!<FLASH option byte Read protection,             Address offset: 0x00 */
#define _OB_USER         (OB + OB_USER_OFFSET)         /*!<FLASH option byte user options,                Address offset: 0x02 */
#define _OB_WRP0         (OB + OB_WRP0_OFFSET)         /*!<FLASH option byte write protection 0,          Address offset: 0x08 */
#define _OB_WRP1         (OB + OB_WRP1_OFFSET)         /*!<FLASH option byte write protection 1,          Address offset: 0x0C */
#define _OB_WRP2         (OB + OB_WRP2_OFFSET)         /*!<FLASH option byte write protection 2,          Address offset: 0x10 */
#define _OB_WRP3         (OB + OB_WRP3_OFFSET)         /*!<FLASH option byte write protection 3,          Address offset: 0x12 */

#define CRC                 (CRC_BASE)
#define _CRC_DR           (CRC + CRC_DR_OFFSET)           /*!< CRC Data register,                           Address offset: 0x00 */
#define _CRC_IDR          (CRC + CRC_IDR_OFFSET)          /*!< CRC Independent data register,               Address offset: 0x04 */
#define _CRC_CR           (CRC + CRC_CR_OFFSET)           /*!< CRC Control register,                        Address offset: 0x08 */
#define _CRC_INIT         (CRC + CRC_INIT_OFFSET)         /*!< Initial CRC value register,                  Address offset: 0x10 */
#define _CRC_POL          (CRC + CRC_POL_OFFSET)          /*!< CRC polynomial register,                     Address offset: 0x14 */

#define TSC                 (TSC_BASE)
#define _TSC_CR           (TSC + TSC_CR_OFFSET)           /*!< TSC control register,                                     Address offset: 0x00 */
#define _TSC_IER          (TSC + TSC_IER_OFFSET)          /*!< TSC interrupt enable register,                            Address offset: 0x04 */
#define _TSC_ICR          (TSC + TSC_ICR_OFFSET)          /*!< TSC interrupt clear register,                             Address offset: 0x08 */
#define _TSC_ISR          (TSC + TSC_ISR_OFFSET)          /*!< TSC interrupt status register,                            Address offset: 0x0C */
#define _TSC_IOHCR        (TSC + TSC_IOHCR_OFFSET)        /*!< TSC I/O hysteresis control register,                      Address offset: 0x10 */
#define _TSC_IOASCR       (TSC + TSC_IOASCR_OFFSET)       /*!< TSC I/O analog switch control register,                   Address offset: 0x18 */
#define _TSC_IOSCR        (TSC + TSC_IOSCR_OFFSET)        /*!< TSC I/O sampling control register,                        Address offset: 0x20 */
#define _TSC_IOCCR        (TSC + TSC_IOCCR_OFFSET)        /*!< TSC I/O channel control register,                         Address offset: 0x28 */
#define _TSC_IOGCSR       (TSC + TSC_IOGCSR_OFFSET)       /*!< TSC I/O group control status register,                    Address offset: 0x30 */
#define _TSC_IOGXCR       (TSC + TSC_IOGXCR_OFFSET)       /*!< TSC I/O group x counter register,                         Address offset: 0x34-50 */

