the-nw1-group/acb-modules/acb-common/include/stm/stm32f30x.inc
#define GPIOA               (GPIOA_BASE)
#define _GPIOA_MODER        (GPIOA + GPIO_MODER_OFFSET)        /*!< GPIO port mode register,                                  Address offset: 0x00 */
#define _GPIOA_OTYPER       (GPIOA + GPIO_OTYPER_OFFSET)       /*!< GPIO port output type register,                           Address offset: 0x04 */
#define _GPIOA_OSPEEDR      (GPIOA + GPIO_OSPEEDR_OFFSET)      /*!< GPIO port output speed register,                          Address offset: 0x08 */
#define _GPIOA_PUPDR        (GPIOA + GPIO_PUPDR_OFFSET)        /*!< GPIO port pull-up/pull-down register,                     Address offset: 0x0C */
#define _GPIOA_IDR          (GPIOA + GPIO_IDR_OFFSET)          /*!< GPIO port input data register,                            Address offset: 0x10 */
#define _GPIOA_ODR          (GPIOA + GPIO_ODR_OFFSET)          /*!< GPIO port output data register,                           Address offset: 0x14 */
#define _GPIOA_BSRR         (GPIOA + GPIO_BSRR_OFFSET)         /*!< GPIO port bit set/reset registerBSRR,                     Address offset: 0x18 */
#define _GPIOA_LCKR         (GPIOA + GPIO_LCKR_OFFSET)         /*!< GPIO port configuration lock register,                    Address offset: 0x1C */
#define _GPIOA_AFR          (GPIOA + GPIO_AFR_OFFSET)          /*!< GPIO alternate function low register,                Address offset: 0x20-0x24 */
#define _GPIOA_BRR          (GPIOA + GPIO_BRR_OFFSET)          /*!< GPIO bit reset register,                                  Address offset: 0x28 */

#define GPIOB               (GPIOB_BASE)
#define _GPIOB_MODER        (GPIOB + GPIO_MODER_OFFSET)        /*!< GPIO port mode register,                                  Address offset: 0x00 */
#define _GPIOB_OTYPER       (GPIOB + GPIO_OTYPER_OFFSET)       /*!< GPIO port output type register,                           Address offset: 0x04 */
#define _GPIOB_OSPEEDR      (GPIOB + GPIO_OSPEEDR_OFFSET)      /*!< GPIO port output speed register,                          Address offset: 0x08 */
#define _GPIOB_PUPDR        (GPIOB + GPIO_PUPDR_OFFSET)        /*!< GPIO port pull-up/pull-down register,                     Address offset: 0x0C */
#define _GPIOB_IDR          (GPIOB + GPIO_IDR_OFFSET)          /*!< GPIO port input data register,                            Address offset: 0x10 */
#define _GPIOB_ODR          (GPIOB + GPIO_ODR_OFFSET)          /*!< GPIO port output data register,                           Address offset: 0x14 */
#define _GPIOB_BSRR         (GPIOB + GPIO_BSRR_OFFSET)         /*!< GPIO port bit set/reset registerBSRR,                     Address offset: 0x18 */
#define _GPIOB_LCKR         (GPIOB + GPIO_LCKR_OFFSET)         /*!< GPIO port configuration lock register,                    Address offset: 0x1C */
#define _GPIOB_AFR          (GPIOB + GPIO_AFR_OFFSET)          /*!< GPIO alternate function low register,                Address offset: 0x20-0x24 */
#define _GPIOB_BRR          (GPIOB + GPIO_BRR_OFFSET)          /*!< GPIO bit reset register,                                  Address offset: 0x28 */

#define GPIOC               (GPIOC_BASE)
#define _GPIOC_MODER        (GPIOC + GPIO_MODER_OFFSET)        /*!< GPIO port mode register,                                  Address offset: 0x00 */
#define _GPIOC_OTYPER       (GPIOC + GPIO_OTYPER_OFFSET)       /*!< GPIO port output type register,                           Address offset: 0x04 */
#define _GPIOC_OSPEEDR      (GPIOC + GPIO_OSPEEDR_OFFSET)      /*!< GPIO port output speed register,                          Address offset: 0x08 */
#define _GPIOC_PUPDR        (GPIOC + GPIO_PUPDR_OFFSET)        /*!< GPIO port pull-up/pull-down register,                     Address offset: 0x0C */
#define _GPIOC_IDR          (GPIOC + GPIO_IDR_OFFSET)          /*!< GPIO port input data register,                            Address offset: 0x10 */
#define _GPIOC_ODR          (GPIOC + GPIO_ODR_OFFSET)          /*!< GPIO port output data register,                           Address offset: 0x14 */
#define _GPIOC_BSRR         (GPIOC + GPIO_BSRR_OFFSET)         /*!< GPIO port bit set/reset registerBSRR,                     Address offset: 0x18 */
#define _GPIOC_LCKR         (GPIOC + GPIO_LCKR_OFFSET)         /*!< GPIO port configuration lock register,                    Address offset: 0x1C */
#define _GPIOC_AFR          (GPIOC + GPIO_AFR_OFFSET)          /*!< GPIO alternate function low register,                Address offset: 0x20-0x24 */
#define _GPIOC_BRR          (GPIOC + GPIO_BRR_OFFSET)          /*!< GPIO bit reset register,                                  Address offset: 0x28 */

#define GPIOD               (GPIOD_BASE)
#define _GPIOD_MODER        (GPIOD + GPIO_MODER_OFFSET)        /*!< GPIO port mode register,                                  Address offset: 0x00 */
#define _GPIOD_OTYPER       (GPIOD + GPIO_OTYPER_OFFSET)       /*!< GPIO port output type register,                           Address offset: 0x04 */
#define _GPIOD_OSPEEDR      (GPIOD + GPIO_OSPEEDR_OFFSET)      /*!< GPIO port output speed register,                          Address offset: 0x08 */
#define _GPIOD_PUPDR        (GPIOD + GPIO_PUPDR_OFFSET)        /*!< GPIO port pull-up/pull-down register,                     Address offset: 0x0C */
#define _GPIOD_IDR          (GPIOD + GPIO_IDR_OFFSET)          /*!< GPIO port input data register,                            Address offset: 0x10 */
#define _GPIOD_ODR          (GPIOD + GPIO_ODR_OFFSET)          /*!< GPIO port output data register,                           Address offset: 0x14 */
#define _GPIOD_BSRR         (GPIOD + GPIO_BSRR_OFFSET)         /*!< GPIO port bit set/reset registerBSRR,                     Address offset: 0x18 */
#define _GPIOD_LCKR         (GPIOD + GPIO_LCKR_OFFSET)         /*!< GPIO port configuration lock register,                    Address offset: 0x1C */
#define _GPIOD_AFR          (GPIOD + GPIO_AFR_OFFSET)          /*!< GPIO alternate function low register,                Address offset: 0x20-0x24 */
#define _GPIOD_BRR          (GPIOD + GPIO_BRR_OFFSET)          /*!< GPIO bit reset register,                                  Address offset: 0x28 */

#define GPIOE               (GPIOE_BASE)
#define _GPIOE_MODER        (GPIOE + GPIO_MODER_OFFSET)        /*!< GPIO port mode register,                                  Address offset: 0x00 */
#define _GPIOE_OTYPER       (GPIOE + GPIO_OTYPER_OFFSET)       /*!< GPIO port output type register,                           Address offset: 0x04 */
#define _GPIOE_OSPEEDR      (GPIOE + GPIO_OSPEEDR_OFFSET)      /*!< GPIO port output speed register,                          Address offset: 0x08 */
#define _GPIOE_PUPDR        (GPIOE + GPIO_PUPDR_OFFSET)        /*!< GPIO port pull-up/pull-down register,                     Address offset: 0x0C */
#define _GPIOE_IDR          (GPIOE + GPIO_IDR_OFFSET)          /*!< GPIO port input data register,                            Address offset: 0x10 */
#define _GPIOE_ODR          (GPIOE + GPIO_ODR_OFFSET)          /*!< GPIO port output data register,                           Address offset: 0x14 */
#define _GPIOE_BSRR         (GPIOE + GPIO_BSRR_OFFSET)         /*!< GPIO port bit set/reset registerBSRR,                     Address offset: 0x18 */
#define _GPIOE_LCKR         (GPIOE + GPIO_LCKR_OFFSET)         /*!< GPIO port configuration lock register,                    Address offset: 0x1C */
#define _GPIOE_AFR          (GPIOE + GPIO_AFR_OFFSET)          /*!< GPIO alternate function low register,                Address offset: 0x20-0x24 */
#define _GPIOE_BRR          (GPIOE + GPIO_BRR_OFFSET)          /*!< GPIO bit reset register,                                  Address offset: 0x28 */

#define GPIOF               (GPIOF_BASE)
#define _GPIOF_MODER        (GPIOF + GPIO_MODER_OFFSET)        /*!< GPIO port mode register,                                  Address offset: 0x00 */
#define _GPIOF_OTYPER       (GPIOF + GPIO_OTYPER_OFFSET)       /*!< GPIO port output type register,                           Address offset: 0x04 */
#define _GPIOF_OSPEEDR      (GPIOF + GPIO_OSPEEDR_OFFSET)      /*!< GPIO port output speed register,                          Address offset: 0x08 */
#define _GPIOF_PUPDR        (GPIOF + GPIO_PUPDR_OFFSET)        /*!< GPIO port pull-up/pull-down register,                     Address offset: 0x0C */
#define _GPIOF_IDR          (GPIOF + GPIO_IDR_OFFSET)          /*!< GPIO port input data register,                            Address offset: 0x10 */
#define _GPIOF_ODR          (GPIOF + GPIO_ODR_OFFSET)          /*!< GPIO port output data register,                           Address offset: 0x14 */
#define _GPIOF_BSRR         (GPIOF + GPIO_BSRR_OFFSET)         /*!< GPIO port bit set/reset registerBSRR,                     Address offset: 0x18 */
#define _GPIOF_LCKR         (GPIOF + GPIO_LCKR_OFFSET)         /*!< GPIO port configuration lock register,                    Address offset: 0x1C */
#define _GPIOF_AFR          (GPIOF + GPIO_AFR_OFFSET)          /*!< GPIO alternate function low register,                Address offset: 0x20-0x24 */
#define _GPIOF_BRR          (GPIOF + GPIO_BRR_OFFSET)          /*!< GPIO bit reset register,                                  Address offset: 0x28 */

