the-nw1-group/acb-modules/acb-common/include/stm/stm32f30x.inc
#define GPIOG               (GPIOG_BASE)
#define _GPIOG_MODER        (GPIOG + GPIO_MODER_OFFSET)        /*!< GPIO port mode register,                                  Address offset: 0x00 */
#define _GPIOG_OTYPER       (GPIOG + GPIO_OTYPER_OFFSET)       /*!< GPIO port output type register,                           Address offset: 0x04 */
#define _GPIOG_OSPEEDR      (GPIOG + GPIO_OSPEEDR_OFFSET)      /*!< GPIO port output speed register,                          Address offset: 0x08 */
#define _GPIOG_PUPDR        (GPIOG + GPIO_PUPDR_OFFSET)        /*!< GPIO port pull-up/pull-down register,                     Address offset: 0x0C */
#define _GPIOG_IDR          (GPIOG + GPIO_IDR_OFFSET)          /*!< GPIO port input data register,                            Address offset: 0x10 */
#define _GPIOG_ODR          (GPIOG + GPIO_ODR_OFFSET)          /*!< GPIO port output data register,                           Address offset: 0x14 */
#define _GPIOG_BSRR         (GPIOG + GPIO_BSRR_OFFSET)         /*!< GPIO port bit set/reset registerBSRR,                     Address offset: 0x18 */
#define _GPIOG_LCKR         (GPIOG + GPIO_LCKR_OFFSET)         /*!< GPIO port configuration lock register,                    Address offset: 0x1C */
#define _GPIOG_AFR          (GPIOG + GPIO_AFR_OFFSET)          /*!< GPIO alternate function low register,                Address offset: 0x20-0x24 */
#define _GPIOG_BRR          (GPIOG + GPIO_BRR_OFFSET)          /*!< GPIO bit reset register,                                  Address offset: 0x28 */

#define GPIOH               (GPIOH_BASE)
#define _GPIOH_MODER        (GPIOH + GPIO_MODER_OFFSET)        /*!< GPIO port mode register,                                  Address offset: 0x00 */
#define _GPIOH_OTYPER       (GPIOH + GPIO_OTYPER_OFFSET)       /*!< GPIO port output type register,                           Address offset: 0x04 */
#define _GPIOH_OSPEEDR      (GPIOH + GPIO_OSPEEDR_OFFSET)      /*!< GPIO port output speed register,                          Address offset: 0x08 */
#define _GPIOH_PUPDR        (GPIOH + GPIO_PUPDR_OFFSET)        /*!< GPIO port pull-up/pull-down register,                     Address offset: 0x0C */
#define _GPIOH_IDR          (GPIOH + GPIO_IDR_OFFSET)          /*!< GPIO port input data register,                            Address offset: 0x10 */
#define _GPIOH_ODR          (GPIOH + GPIO_ODR_OFFSET)          /*!< GPIO port output data register,                           Address offset: 0x14 */
#define _GPIOH_BSRR         (GPIOH + GPIO_BSRR_OFFSET)         /*!< GPIO port bit set/reset registerBSRR,                     Address offset: 0x18 */
#define _GPIOH_LCKR         (GPIOH + GPIO_LCKR_OFFSET)         /*!< GPIO port configuration lock register,                    Address offset: 0x1C */
#define _GPIOH_AFR          (GPIOH + GPIO_AFR_OFFSET)          /*!< GPIO alternate function low register,                Address offset: 0x20-0x24 */
#define _GPIOH_BRR          (GPIOH + GPIO_BRR_OFFSET)          /*!< GPIO bit reset register,                                  Address offset: 0x28 */

#define ADC1                (ADC1_BASE)
#define _ADC1_ISR          (ADC1 + ADC_ISR_OFFSET)          /*!< ADC Interrupt and Status Register,                 Address offset: 0x00 */
#define _ADC1_IER          (ADC1 + ADC_IER_OFFSET)          /*!< ADC Interrupt Enable Register,                     Address offset: 0x04 */
#define _ADC1_CR           (ADC1 + ADC_CR_OFFSET)           /*!< ADC control register,                              Address offset: 0x08 */
#define _ADC1_CFGR         (ADC1 + ADC_CFGR_OFFSET)         /*!< ADC Configuration register,                        Address offset: 0x0C */
#define _ADC1_SMPR1        (ADC1 + ADC_SMPR1_OFFSET)        /*!< ADC sample time register 1,                        Address offset: 0x14 */
#define _ADC1_SMPR2        (ADC1 + ADC_SMPR2_OFFSET)        /*!< ADC sample time register 2,                        Address offset: 0x18 */
#define _ADC1_TR1          (ADC1 + ADC_TR1_OFFSET)          /*!< ADC watchdog threshold register 1,                 Address offset: 0x20 */
#define _ADC1_TR2          (ADC1 + ADC_TR2_OFFSET)          /*!< ADC watchdog threshold register 2,                 Address offset: 0x24 */
#define _ADC1_TR3          (ADC1 + ADC_TR3_OFFSET)          /*!< ADC watchdog threshold register 3,                 Address offset: 0x28 */
#define _ADC1_SQR1         (ADC1 + ADC_SQR1_OFFSET)         /*!< ADC regular sequence register 1,                   Address offset: 0x30 */
#define _ADC1_SQR2         (ADC1 + ADC_SQR2_OFFSET)         /*!< ADC regular sequence register 2,                   Address offset: 0x34 */
#define _ADC1_SQR3         (ADC1 + ADC_SQR3_OFFSET)         /*!< ADC regular sequence register 3,                   Address offset: 0x38 */
#define _ADC1_SQR4         (ADC1 + ADC_SQR4_OFFSET)         /*!< ADC regular sequence register 4,                   Address offset: 0x3C */
#define _ADC1_DR           (ADC1 + ADC_DR_OFFSET)           /*!< ADC regular data register,                         Address offset: 0x40 */
#define _ADC1_JSQR         (ADC1 + ADC_JSQR_OFFSET)         /*!< ADC injected sequence register,                    Address offset: 0x4C */
#define _ADC1_OFR1         (ADC1 + ADC_OFR1_OFFSET)         /*!< ADC offset register 1,                             Address offset: 0x60 */
#define _ADC1_OFR2         (ADC1 + ADC_OFR2_OFFSET)         /*!< ADC offset register 2,                             Address offset: 0x64 */
#define _ADC1_OFR3         (ADC1 + ADC_OFR3_OFFSET)         /*!< ADC offset register 3,                             Address offset: 0x68 */
#define _ADC1_OFR4         (ADC1 + ADC_OFR4_OFFSET)         /*!< ADC offset register 4,                             Address offset: 0x6C */
#define _ADC1_JDR1         (ADC1 + ADC_JDR1_OFFSET)         /*!< ADC injected data register 1,                      Address offset: 0x80 */
#define _ADC1_JDR2         (ADC1 + ADC_JDR2_OFFSET)         /*!< ADC injected data register 2,                      Address offset: 0x84 */
#define _ADC1_JDR3         (ADC1 + ADC_JDR3_OFFSET)         /*!< ADC injected data register 3,                      Address offset: 0x88 */
#define _ADC1_JDR4         (ADC1 + ADC_JDR4_OFFSET)         /*!< ADC injected data register 4,                      Address offset: 0x8C */
#define _ADC1_AWD2CR       (ADC1 + ADC_AWD2CR_OFFSET)       /*!< ADC  Analog Watchdog 2 Configuration Register,     Address offset: 0xA0 */
#define _ADC1_AWD3CR       (ADC1 + ADC_AWD3CR_OFFSET)       /*!< ADC  Analog Watchdog 3 Configuration Register,     Address offset: 0xA4 */
#define _ADC1_DIFSEL       (ADC1 + ADC_DIFSEL_OFFSET)       /*!< ADC  Differential Mode Selection Register,         Address offset: 0xB0 */
#define _ADC1_CALFACT      (ADC1 + ADC_CALFACT_OFFSET)      /*!< ADC  Calibration Factors,                          Address offset: 0xB4 */

#define ADC2                (ADC2_BASE)
#define _ADC2_ISR          (ADC2 + ADC_ISR_OFFSET)          /*!< ADC Interrupt and Status Register,                 Address offset: 0x00 */
#define _ADC2_IER          (ADC2 + ADC_IER_OFFSET)          /*!< ADC Interrupt Enable Register,                     Address offset: 0x04 */
#define _ADC2_CR           (ADC2 + ADC_CR_OFFSET)           /*!< ADC control register,                              Address offset: 0x08 */
#define _ADC2_CFGR         (ADC2 + ADC_CFGR_OFFSET)         /*!< ADC Configuration register,                        Address offset: 0x0C */
#define _ADC2_SMPR1        (ADC2 + ADC_SMPR1_OFFSET)        /*!< ADC sample time register 1,                        Address offset: 0x14 */
#define _ADC2_SMPR2        (ADC2 + ADC_SMPR2_OFFSET)        /*!< ADC sample time register 2,                        Address offset: 0x18 */
#define _ADC2_TR1          (ADC2 + ADC_TR1_OFFSET)          /*!< ADC watchdog threshold register 1,                 Address offset: 0x20 */
#define _ADC2_TR2          (ADC2 + ADC_TR2_OFFSET)          /*!< ADC watchdog threshold register 2,                 Address offset: 0x24 */
#define _ADC2_TR3          (ADC2 + ADC_TR3_OFFSET)          /*!< ADC watchdog threshold register 3,                 Address offset: 0x28 */
#define _ADC2_SQR1         (ADC2 + ADC_SQR1_OFFSET)         /*!< ADC regular sequence register 1,                   Address offset: 0x30 */
#define _ADC2_SQR2         (ADC2 + ADC_SQR2_OFFSET)         /*!< ADC regular sequence register 2,                   Address offset: 0x34 */
#define _ADC2_SQR3         (ADC2 + ADC_SQR3_OFFSET)         /*!< ADC regular sequence register 3,                   Address offset: 0x38 */
#define _ADC2_SQR4         (ADC2 + ADC_SQR4_OFFSET)         /*!< ADC regular sequence register 4,                   Address offset: 0x3C */
#define _ADC2_DR           (ADC2 + ADC_DR_OFFSET)           /*!< ADC regular data register,                         Address offset: 0x40 */
#define _ADC2_JSQR         (ADC2 + ADC_JSQR_OFFSET)         /*!< ADC injected sequence register,                    Address offset: 0x4C */
#define _ADC2_OFR1         (ADC2 + ADC_OFR1_OFFSET)         /*!< ADC offset register 1,                             Address offset: 0x60 */
#define _ADC2_OFR2         (ADC2 + ADC_OFR2_OFFSET)         /*!< ADC offset register 2,                             Address offset: 0x64 */
#define _ADC2_OFR3         (ADC2 + ADC_OFR3_OFFSET)         /*!< ADC offset register 3,                             Address offset: 0x68 */
#define _ADC2_OFR4         (ADC2 + ADC_OFR4_OFFSET)         /*!< ADC offset register 4,                             Address offset: 0x6C */
#define _ADC2_JDR1         (ADC2 + ADC_JDR1_OFFSET)         /*!< ADC injected data register 1,                      Address offset: 0x80 */
#define _ADC2_JDR2         (ADC2 + ADC_JDR2_OFFSET)         /*!< ADC injected data register 2,                      Address offset: 0x84 */
#define _ADC2_JDR3         (ADC2 + ADC_JDR3_OFFSET)         /*!< ADC injected data register 3,                      Address offset: 0x88 */
#define _ADC2_JDR4         (ADC2 + ADC_JDR4_OFFSET)         /*!< ADC injected data register 4,                      Address offset: 0x8C */
#define _ADC2_AWD2CR       (ADC2 + ADC_AWD2CR_OFFSET)       /*!< ADC  Analog Watchdog 2 Configuration Register,     Address offset: 0xA0 */
#define _ADC2_AWD3CR       (ADC2 + ADC_AWD3CR_OFFSET)       /*!< ADC  Analog Watchdog 3 Configuration Register,     Address offset: 0xA4 */
#define _ADC2_DIFSEL       (ADC2 + ADC_DIFSEL_OFFSET)       /*!< ADC  Differential Mode Selection Register,         Address offset: 0xB0 */
#define _ADC2_CALFACT      (ADC2 + ADC_CALFACT_OFFSET)      /*!< ADC  Calibration Factors,                          Address offset: 0xB4 */

