the-nw1-group/acb-modules/acb-common/include/stm/stm32f30x.inc
#define ADC3                (ADC3_BASE)
#define _ADC3_ISR          (ADC3 + ADC_ISR_OFFSET)          /*!< ADC Interrupt and Status Register,                 Address offset: 0x00 */
#define _ADC3_IER          (ADC3 + ADC_IER_OFFSET)          /*!< ADC Interrupt Enable Register,                     Address offset: 0x04 */
#define _ADC3_CR           (ADC3 + ADC_CR_OFFSET)           /*!< ADC control register,                              Address offset: 0x08 */
#define _ADC3_CFGR         (ADC3 + ADC_CFGR_OFFSET)         /*!< ADC Configuration register,                        Address offset: 0x0C */
#define _ADC3_SMPR1        (ADC3 + ADC_SMPR1_OFFSET)        /*!< ADC sample time register 1,                        Address offset: 0x14 */
#define _ADC3_SMPR2        (ADC3 + ADC_SMPR2_OFFSET)        /*!< ADC sample time register 2,                        Address offset: 0x18 */
#define _ADC3_TR1          (ADC3 + ADC_TR1_OFFSET)          /*!< ADC watchdog threshold register 1,                 Address offset: 0x20 */
#define _ADC3_TR2          (ADC3 + ADC_TR2_OFFSET)          /*!< ADC watchdog threshold register 2,                 Address offset: 0x24 */
#define _ADC3_TR3          (ADC3 + ADC_TR3_OFFSET)          /*!< ADC watchdog threshold register 3,                 Address offset: 0x28 */
#define _ADC3_SQR1         (ADC3 + ADC_SQR1_OFFSET)         /*!< ADC regular sequence register 1,                   Address offset: 0x30 */
#define _ADC3_SQR2         (ADC3 + ADC_SQR2_OFFSET)         /*!< ADC regular sequence register 2,                   Address offset: 0x34 */
#define _ADC3_SQR3         (ADC3 + ADC_SQR3_OFFSET)         /*!< ADC regular sequence register 3,                   Address offset: 0x38 */
#define _ADC3_SQR4         (ADC3 + ADC_SQR4_OFFSET)         /*!< ADC regular sequence register 4,                   Address offset: 0x3C */
#define _ADC3_DR           (ADC3 + ADC_DR_OFFSET)           /*!< ADC regular data register,                         Address offset: 0x40 */
#define _ADC3_JSQR         (ADC3 + ADC_JSQR_OFFSET)         /*!< ADC injected sequence register,                    Address offset: 0x4C */
#define _ADC3_OFR1         (ADC3 + ADC_OFR1_OFFSET)         /*!< ADC offset register 1,                             Address offset: 0x60 */
#define _ADC3_OFR2         (ADC3 + ADC_OFR2_OFFSET)         /*!< ADC offset register 2,                             Address offset: 0x64 */
#define _ADC3_OFR3         (ADC3 + ADC_OFR3_OFFSET)         /*!< ADC offset register 3,                             Address offset: 0x68 */
#define _ADC3_OFR4         (ADC3 + ADC_OFR4_OFFSET)         /*!< ADC offset register 4,                             Address offset: 0x6C */
#define _ADC3_JDR1         (ADC3 + ADC_JDR1_OFFSET)         /*!< ADC injected data register 1,                      Address offset: 0x80 */
#define _ADC3_JDR2         (ADC3 + ADC_JDR2_OFFSET)         /*!< ADC injected data register 2,                      Address offset: 0x84 */
#define _ADC3_JDR3         (ADC3 + ADC_JDR3_OFFSET)         /*!< ADC injected data register 3,                      Address offset: 0x88 */
#define _ADC3_JDR4         (ADC3 + ADC_JDR4_OFFSET)         /*!< ADC injected data register 4,                      Address offset: 0x8C */
#define _ADC3_AWD2CR       (ADC3 + ADC_AWD2CR_OFFSET)       /*!< ADC  Analog Watchdog 2 Configuration Register,     Address offset: 0xA0 */
#define _ADC3_AWD3CR       (ADC3 + ADC_AWD3CR_OFFSET)       /*!< ADC  Analog Watchdog 3 Configuration Register,     Address offset: 0xA4 */
#define _ADC3_DIFSEL       (ADC3 + ADC_DIFSEL_OFFSET)       /*!< ADC  Differential Mode Selection Register,         Address offset: 0xB0 */
#define _ADC3_CALFACT      (ADC3 + ADC_CALFACT_OFFSET)      /*!< ADC  Calibration Factors,                          Address offset: 0xB4 */

#define ADC4                (ADC4_BASE)
#define _ADC4_ISR          (ADC4 + ADC_ISR_OFFSET)          /*!< ADC Interrupt and Status Register,                 Address offset: 0x00 */
#define _ADC4_IER          (ADC4 + ADC_IER_OFFSET)          /*!< ADC Interrupt Enable Register,                     Address offset: 0x04 */
#define _ADC4_CR           (ADC4 + ADC_CR_OFFSET)           /*!< ADC control register,                              Address offset: 0x08 */
#define _ADC4_CFGR         (ADC4 + ADC_CFGR_OFFSET)         /*!< ADC Configuration register,                        Address offset: 0x0C */
#define _ADC4_SMPR1        (ADC4 + ADC_SMPR1_OFFSET)        /*!< ADC sample time register 1,                        Address offset: 0x14 */
#define _ADC4_SMPR2        (ADC4 + ADC_SMPR2_OFFSET)        /*!< ADC sample time register 2,                        Address offset: 0x18 */
#define _ADC4_TR1          (ADC4 + ADC_TR1_OFFSET)          /*!< ADC watchdog threshold register 1,                 Address offset: 0x20 */
#define _ADC4_TR2          (ADC4 + ADC_TR2_OFFSET)          /*!< ADC watchdog threshold register 2,                 Address offset: 0x24 */
#define _ADC4_TR3          (ADC4 + ADC_TR3_OFFSET)          /*!< ADC watchdog threshold register 3,                 Address offset: 0x28 */
#define _ADC4_SQR1         (ADC4 + ADC_SQR1_OFFSET)         /*!< ADC regular sequence register 1,                   Address offset: 0x30 */
#define _ADC4_SQR2         (ADC4 + ADC_SQR2_OFFSET)         /*!< ADC regular sequence register 2,                   Address offset: 0x34 */
#define _ADC4_SQR3         (ADC4 + ADC_SQR3_OFFSET)         /*!< ADC regular sequence register 3,                   Address offset: 0x38 */
#define _ADC4_SQR4         (ADC4 + ADC_SQR4_OFFSET)         /*!< ADC regular sequence register 4,                   Address offset: 0x3C */
#define _ADC4_DR           (ADC4 + ADC_DR_OFFSET)           /*!< ADC regular data register,                         Address offset: 0x40 */
#define _ADC4_JSQR         (ADC4 + ADC_JSQR_OFFSET)         /*!< ADC injected sequence register,                    Address offset: 0x4C */
#define _ADC4_OFR1         (ADC4 + ADC_OFR1_OFFSET)         /*!< ADC offset register 1,                             Address offset: 0x60 */
#define _ADC4_OFR2         (ADC4 + ADC_OFR2_OFFSET)         /*!< ADC offset register 2,                             Address offset: 0x64 */
#define _ADC4_OFR3         (ADC4 + ADC_OFR3_OFFSET)         /*!< ADC offset register 3,                             Address offset: 0x68 */
#define _ADC4_OFR4         (ADC4 + ADC_OFR4_OFFSET)         /*!< ADC offset register 4,                             Address offset: 0x6C */
#define _ADC4_JDR1         (ADC4 + ADC_JDR1_OFFSET)         /*!< ADC injected data register 1,                      Address offset: 0x80 */
#define _ADC4_JDR2         (ADC4 + ADC_JDR2_OFFSET)         /*!< ADC injected data register 2,                      Address offset: 0x84 */
#define _ADC4_JDR3         (ADC4 + ADC_JDR3_OFFSET)         /*!< ADC injected data register 3,                      Address offset: 0x88 */
#define _ADC4_JDR4         (ADC4 + ADC_JDR4_OFFSET)         /*!< ADC injected data register 4,                      Address offset: 0x8C */
#define _ADC4_AWD2CR       (ADC4 + ADC_AWD2CR_OFFSET)       /*!< ADC  Analog Watchdog 2 Configuration Register,     Address offset: 0xA0 */
#define _ADC4_AWD3CR       (ADC4 + ADC_AWD3CR_OFFSET)       /*!< ADC  Analog Watchdog 3 Configuration Register,     Address offset: 0xA4 */
#define _ADC4_DIFSEL       (ADC4 + ADC_DIFSEL_OFFSET)       /*!< ADC  Differential Mode Selection Register,         Address offset: 0xB0 */
#define _ADC4_CALFACT      (ADC4 + ADC_CALFACT_OFFSET)      /*!< ADC  Calibration Factors,                          Address offset: 0xB4 */

#define ADC1_2              (ADC1_2_BASE)
#define _ADC1_2_CSR         (ADC1_2 + ADC_Common_CSR_OFFSET)         /*!< ADC Common status register,                  Address offset: ADC1/3 base address + 0x300 */
#define _ADC1_2_CCR         (ADC1_2 + ADC_Common_CCR_OFFSET)         /*!< ADC common control register,                 Address offset: ADC1/3 base address + 0x308 */
#define _ADC1_2_CDR         (ADC1_2 + ADC_Common_CDR_OFFSET)         /*!< ADC common regular data register for dual */

