the-nw1-group/acb-modules/acb-common/include/stm/stm32f30x.inc
#define ADC3_4              (ADC3_4_BASE)
#define _ADC3_4_CSR         (ADC3_4 + ADC_Common_CSR_OFFSET)         /*!< ADC Common status register,                  Address offset: ADC1/3 base address + 0x300 */
#define _ADC3_4_CCR         (ADC3_4 + ADC_Common_CCR_OFFSET)         /*!< ADC common control register,                 Address offset: ADC1/3 base address + 0x308 */
#define _ADC3_4_CDR         (ADC3_4 + ADC_Common_CDR_OFFSET)         /*!< ADC common regular data register for dual */

#define FMC_Bank1           (FMC_Bank1_R_BASE)
#define _FMC_Bank1_BTCR    (FMC_Bank1 + FMC_Bank1_BTCR_OFFSET)    /*!< NOR/PSRAM chip-select control register(BCR) and chip-select timing register(BTR), Address offset: 0x00-1C */

#define FMC_Bank1E          (FMC_Bank1E_R_BASE)
#define _FMC_Bank1E_BWTR    (FMC_Bank1E + FMC_Bank1E_BWTR_OFFSET)    /*!< NOR/PSRAM write timing registers, Address offset: 0x104-0x11C */

#define FMC_Bank2           (FMC_Bank2_R_BASE)
#define _FMC_Bank2_PCR2         (FMC_Bank2 + FMC_Bank2_PCR2_OFFSET)         /*!< NAND Flash control register 2,                       Address offset: 0x60 */
#define _FMC_Bank2_SR2          (FMC_Bank2 + FMC_Bank2_SR2_OFFSET)          /*!< NAND Flash FIFO status and interrupt register 2,     Address offset: 0x64 */
#define _FMC_Bank2_PMEM2        (FMC_Bank2 + FMC_Bank2_PMEM2_OFFSET)        /*!< NAND Flash Common memory space timing register 2,    Address offset: 0x68 */
#define _FMC_Bank2_PATT2        (FMC_Bank2 + FMC_Bank2_PATT2_OFFSET)        /*!< NAND Flash Attribute memory space timing register 2, Address offset: 0x6C */
#define _FMC_Bank2_ECCR2        (FMC_Bank2 + FMC_Bank2_ECCR2_OFFSET)        /*!< NAND Flash ECC result registers 2,                   Address offset: 0x74 */

#define FMC_Bank3           (FMC_Bank3_R_BASE)
#define _FMC_Bank3_PCR3         (FMC_Bank3 + FMC_Bank3_PCR3_OFFSET)         /*!< NAND Flash control register 3,                       Address offset: 0x80 */
#define _FMC_Bank3_SR3          (FMC_Bank3 + FMC_Bank3_SR3_OFFSET)          /*!< NAND Flash FIFO status and interrupt register 3,     Address offset: 0x84 */
#define _FMC_Bank3_PMEM3        (FMC_Bank3 + FMC_Bank3_PMEM3_OFFSET)        /*!< NAND Flash Common memory space timing register 3,    Address offset: 0x88 */
#define _FMC_Bank3_PATT3        (FMC_Bank3 + FMC_Bank3_PATT3_OFFSET)        /*!< NAND Flash Attribute memory space timing register 3, Address offset: 0x8C */
#define _FMC_Bank3_ECCR3        (FMC_Bank3 + FMC_Bank3_ECCR3_OFFSET)        /*!< NAND Flash ECC result registers 3,                   Address offset: 0x94 */

#define FMC_Bank4           (FMC_Bank4_R_BASE)
#define _FMC_Bank4_PCR4     (FMC_Bank4 + FMC_Bank4_PCR4_OFFSET)     /*!< PC Card  control register 4,                       Address offset: 0xA0 */
#define _FMC_Bank4_SR4      (FMC_Bank4 + FMC_Bank4_SR4_OFFSET)      /*!< PC Card  FIFO status and interrupt register 4,     Address offset: 0xA4 */
#define _FMC_Bank4_PMEM4    (FMC_Bank4 + FMC_Bank4_PMEM4_OFFSET)    /*!< PC Card  Common memory space timing register 4,    Address offset: 0xA8 */
#define _FMC_Bank4_PATT4    (FMC_Bank4 + FMC_Bank4_PATT4_OFFSET)    /*!< PC Card  Attribute memory space timing register 4, Address offset: 0xAC */
#define _FMC_Bank4_PIO4     (FMC_Bank4 + FMC_Bank4_PIO4_OFFSET)     /*!< PC Card  I/O space timing register 4,              Address offset: 0xB0 */

/**
  * @}
  */

/** @addtogroup Exported_constants
  * @{
  */

  /** @addtogroup Peripheral_Registers_Bits_Definition
  * @{
  */

#define HRTIM_MCR_CK_PSC     (0x00000007)   /*!< Prescaler mask */
#define HRTIM_MCR_CK_PSC_0   (0x00000001)   /*!< Prescaler bit 0 */ 
#define HRTIM_MCR_CK_PSC_1   (0x00000002)   /*!< Prescaler bit 1 */ 
#define HRTIM_MCR_CK_PSC_2   (0x00000004)   /*!< Prescaler bit 2 */ 

#define HRTIM_MCR_CONT       (0x00000008)   /*!< Continuous mode */
#define HRTIM_MCR_RETRIG     (0x00000010)   /*!< Rettrigreable mode */
#define HRTIM_MCR_HALF       (0x00000020)   /*!< Half mode */

#define HRTIM_MCR_SYNC_IN    (0x00000300)   /*!< Synchronization input master */
#define HRTIM_MCR_SYNC_IN_0  (0x00000100)   /*!< Synchronization input bit 0 */
#define HRTIM_MCR_SYNC_IN_1  (0x00000200)   /*!< Synchronization input bit 1 */
#define HRTIM_MCR_SYNCRSTM   (0x00000400)   /*!< Synchronization reset master */
#define HRTIM_MCR_SYNCSTRTM  (0x00000800)   /*!< Synchronization start master */
#define HRTIM_MCR_SYNC_OUT   (0x00003000)   /*!< Synchronization output master */
#define HRTIM_MCR_SYNC_OUT_0 (0x00001000)   /*!< Synchronization output bit 0 */
#define HRTIM_MCR_SYNC_OUT_1 (0x00002000)   /*!< Synchronization output bit 1 */
#define HRTIM_MCR_SYNC_SRC   (0x0000C000)   /*!< Synchronization source */
#define HRTIM_MCR_SYNC_SRC_0 (0x00004000)   /*!< Synchronization source bit 0 */
#define HRTIM_MCR_SYNC_SRC_1 (0x00008000)   /*!< Synchronization source bit 1 */

#define HRTIM_MCR_MCEN       (0x00010000)   /*!< Master counter enable */
#define HRTIM_MCR_TACEN      (0x00020000)   /*!< Timer A counter enable */
#define HRTIM_MCR_TBCEN      (0x00040000)   /*!< Timer B counter enable */
#define HRTIM_MCR_TCCEN      (0x00080000)   /*!< Timer C counter enable */
#define HRTIM_MCR_TDCEN      (0x00100000)   /*!< Timer D counter enable */
#define HRTIM_MCR_TECEN      (0x00200000)   /*!< Timer E counter enable */

#define HRTIM_MCR_DACSYNC    (0x06000000)   /*!< DAC synchronization mask */
#define HRTIM_MCR_DACSYNC_0  (0x02000000)   /*!< DAC synchronization bit 0 */
#define HRTIM_MCR_DACSYNC_1  (0x04000000)   /*!< DAC synchronization bit 1 */

#define HRTIM_MCR_PREEN      (0x08000000)   /*!< Master preload enable */
#define HRTIM_MCR_MREPU      (0x20000000)   /*!< Master repetition update */

#define HRTIM_MCR_BRSTDMA    (0xC0000000)   /*!< Burst DMA update */
#define HRTIM_MCR_BRSTDMA_0  (0x40000000)   /*!< Burst DMA update bit 0*/
#define HRTIM_MCR_BRSTDMA_1  (0x80000000)   /*!< Burst DMA update bit 1 */

#define HRTIM_MISR_MCMP1    (0x00000001)  /*!< Master compare 1 interrupt flag */
#define HRTIM_MISR_MCMP2    (0x00000002)  /*!< Master compare 2 interrupt flag */
#define HRTIM_MISR_MCMP3    (0x00000004)  /*!< Master compare 3 interrupt flag */
#define HRTIM_MISR_MCMP4    (0x00000008)  /*!< Master compare 4 interrupt flag */
#define HRTIM_MISR_MREP     (0x00000010)  /*!< Master Repetition interrupt flag */
#define HRTIM_MISR_SYNC     (0x00000020)  /*!< Synchronization input interrupt flag */
#define HRTIM_MISR_MUPD     (0x00000040)  /*!< Master update interrupt flag */

#define HRTIM_MICR_MCMP1    (0x00000001)  /*!< Master compare 1 interrupt flag clear */
#define HRTIM_MICR_MCMP2    (0x00000002)  /*!< Master compare 2 interrupt flag clear */
#define HRTIM_MICR_MCMP3    (0x00000004)  /*!< Master compare 3 interrupt flag clear */
#define HRTIM_MICR_MCMP4    (0x00000008)  /*!< Master compare 4 interrupt flag clear */
#define HRTIM_MICR_MREP     (0x00000010)  /*!< Master Repetition interrupt flag clear */
#define HRTIM_MICR_SYNC     (0x00000020)  /*!< Synchronization input interrupt flag clear */
#define HRTIM_MICR_MUPD     (0x00000040)  /*!< Master update interrupt flag clear */

#define HRTIM_MDIER_MCMP1IE    (0x00000001)  /*!< Master compare 1 interrupt enable */
#define HRTIM_MDIER_MCMP2IE    (0x00000002)  /*!< Master compare 2 interrupt enable */
#define HRTIM_MDIER_MCMP3IE    (0x00000004)  /*!< Master compare 3 interrupt enable */
#define HRTIM_MDIER_MCMP4IE    (0x00000008)  /*!< Master compare 4 interrupt enable */
#define HRTIM_MDIER_MREPIE     (0x00000010)  /*!< Master Repetition interrupt enable */
#define HRTIM_MDIER_SYNCIE     (0x00000020)  /*!< Synchronization input interrupt enable */
#define HRTIM_MDIER_MUPDIE     (0x00000040)  /*!< Master update interrupt enable */

#define HRTIM_MDIER_MCMP1DE    (0x00010000)  /*!< Master compare 1 DMA enable */
#define HRTIM_MDIER_MCMP2DE    (0x00020000)  /*!< Master compare 2 DMA enable */
#define HRTIM_MDIER_MCMP3DE    (0x00040000)  /*!< Master compare 3 DMA enable */
#define HRTIM_MDIER_MCMP4DE    (0x00080000)  /*!< Master compare 4 DMA enable */
#define HRTIM_MDIER_MREPDE     (0x00100000)  /*!< Master Repetition DMA enable */
#define HRTIM_MDIER_SYNCDE     (0x00200000)  /*!< Synchronization input DMA enable */
#define HRTIM_MDIER_MUPDDE     (0x00400000)  /*!< Master update DMA enable */

