the-nw1-group/acb-modules/acb-common/include/stm/stm32f30x.inc
#define  HRTIM_MCNTR_MCNTR     (0xFFFFFFFF)       /*!<Counter Value */

#define  HRTIM_MPER_MPER      (0xFFFFFFFF)        /*!< Period Value */

#define  HRTIM_MREP_MREP     (0xFFFFFFFF)        /*!<Repetition Value */

#define  HRTIM_MCMP1R_MCMP1R     (0xFFFFFFFF)     /*!<Compare Value */

#define  HRTIM_MCMP1R_MCMP2R     (0xFFFFFFFF)     /*!<Compare Value */

#define  HRTIM_MCMP1R_MCMP3R     (0xFFFFFFFF)     /*!<Compare Value */

#define  HRTIM_MCMP1R_MCMP4R     (0xFFFFFFFF)     /*!<Compare Value */

#define HRTIM_TIMCR_CK_PSC      (0x00000007) /*!< Slave prescaler mask*/
#define HRTIM_TIMCR_CK_PSC_0    (0x00000001) /*!< prescaler bit 0 */
#define HRTIM_TIMCR_CK_PSC_1    (0x00000002) /*!< prescaler bit 1 */
#define HRTIM_TIMCR_CK_PSC_2    (0x00000004) /*!< prescaler bit 2 */

#define HRTIM_TIMCR_CONT        (0x00000008) /*!< Slave continuous mode */
#define HRTIM_TIMCR_RETRIG      (0x00000010) /*!< Slave Retrigreable mode */
#define HRTIM_TIMCR_HALF        (0x00000020) /*!< Slave Half mode */
#define HRTIM_TIMCR_PSHPLL      (0x00000040) /*!< Slave push-pull mode */

#define HRTIM_TIMCR_SYNCRST     (0x00000400) /*!< Slave synchronization resets */
#define HRTIM_TIMCR_SYNCSTRT    (0x00000800) /*!< Slave synchronization starts */

#define HRTIM_TIMCR_DELCMP2     (0x00003000) /*!< Slave delayed comparator 2 mode mask */
#define HRTIM_TIMCR_DELCMP2_0   (0x00001000) /*!< Slave delayed comparator 2 bit 0 */
#define HRTIM_TIMCR_DELCMP2_1   (0x00002000) /*!< Slave delayed comparator 2 bit 1 */
#define HRTIM_TIMCR_DELCMP4     (0x0000C000) /*!< Slave delayed comparator 4 mode mask */
#define HRTIM_TIMCR_DELCMP4_0   (0x00004000) /*!< Slave delayed comparator 4 bit 0 */
#define HRTIM_TIMCR_DELCMP4_1   (0x00008000) /*!< Slave delayed comparator 4 bit 1 */

#define HRTIM_TIMCR_TREPU       (0x00020000) /*!< Slave repetition update */
#define HRTIM_TIMCR_TRSTU       (0x00040000) /*!< Slave reset update */
#define HRTIM_TIMCR_TAU         (0x00080000) /*!< Slave Timer A update reserved for TIM A */
#define HRTIM_TIMCR_TBU         (0x00100000) /*!< Slave Timer B update reserved for TIM B */
#define HRTIM_TIMCR_TCU         (0x00200000) /*!< Slave Timer C update reserved for TIM C */
#define HRTIM_TIMCR_TDU         (0x00400000) /*!< Slave Timer D update reserved for TIM D */
#define HRTIM_TIMCR_TEU         (0x00800000) /*!< Slave Timer E update reserved for TIM E */
#define HRTIM_TIMCR_MSTU        (0x01000000) /*!< Master Update */

#define HRTIM_TIMCR_DACSYNC    (0x06000000)   /*!< DAC synchronization mask */
#define HRTIM_TIMCR_DACSYNC_0  (0x02000000)   /*!< DAC synchronization bit 0 */
#define HRTIM_TIMCR_DACSYNC_1  (0x04000000)   /*!< DAC synchronization bit 1 */
#define HRTIM_TIMCR_PREEN      (0x08000000)   /*!< Slave preload enable */

#define HRTIM_TIMCR_UPDGAT     (0xF0000000)   /*!< Slave update gating mask */
#define HRTIM_TIMCR_UPDGAT_0   (0x10000000)   /*!< Update gating bit 0 */
#define HRTIM_TIMCR_UPDGAT_1   (0x20000000)   /*!< Update gating bit 1 */
#define HRTIM_TIMCR_UPDGAT_2   (0x40000000)   /*!< Update gating bit 2 */
#define HRTIM_TIMCR_UPDGAT_3   (0x80000000)   /*!< Update gating bit 3 */

#define HRTIM_TIMISR_CMP1       (0x00000001)   /*!< Slave compare 1 interrupt flag */
#define HRTIM_TIMISR_CMP2       (0x00000002)   /*!< Slave compare 2 interrupt flag */
#define HRTIM_TIMISR_CMP3       (0x00000004)   /*!< Slave compare 3 interrupt flag */
#define HRTIM_TIMISR_CMP4       (0x00000008)   /*!< Slave compare 4 interrupt flag */
#define HRTIM_TIMISR_REP        (0x00000010)   /*!< Slave repetition interrupt flag */
#define HRTIM_TIMISR_UPD        (0x00000040)   /*!< Slave update interrupt flag */
#define HRTIM_TIMISR_CPT1       (0x00000080)   /*!< Slave capture 1 interrupt flag */
#define HRTIM_TIMISR_CPT2       (0x00000100)   /*!< Slave capture 2 interrupt flag */
#define HRTIM_TIMISR_SET1       (0x00000200)   /*!< Slave output 1 set interrupt flag */
#define HRTIM_TIMISR_RST1       (0x00000400)   /*!< Slave output 1 reset interrupt flag */
#define HRTIM_TIMISR_SET2       (0x00000800)   /*!< Slave output 2 set interrupt flag */
#define HRTIM_TIMISR_RST2       (0x00001000)   /*!< Slave output 2 reset interrupt flag */
#define HRTIM_TIMISR_RST        (0x00002000)   /*!< Slave reset interrupt flag */
#define HRTIM_TIMISR_DLYPRT     (0x00004000)   /*!< Slave output 1 delay protection interrupt flag */
#define HRTIM_TIMISR_CPPSTAT    (0x00010000)   /*!< Slave current push-pull flag */
#define HRTIM_TIMISR_IPPSTAT    (0x00020000)   /*!< Slave idle push-pull flag */
#define HRTIM_TIMISR_O1STAT     (0x00040000)   /*!< Slave output 1 state flag */
#define HRTIM_TIMISR_O2STAT     (0x00080000)   /*!< Slave output 2 state flag */
#define HRTIM_TIMISR_O1CPY      (0x00100000)   /*!< Slave output 1 copy flag */
#define HRTIM_TIMISR_O2CPY      (0x00200000)   /*!< Slave output 2 copy flag */

#define HRTIM_TIMICR_CMP1C       (0x00000001)   /*!< Slave compare 1 clear flag */
#define HRTIM_TIMICR_CMP2C       (0x00000002)   /*!< Slave compare 2 clear flag */
#define HRTIM_TIMICR_CMP3C       (0x00000004)   /*!< Slave compare 3 clear flag */
#define HRTIM_TIMICR_CMP4C       (0x00000008)   /*!< Slave compare 4 clear flag */
#define HRTIM_TIMICR_REPC        (0x00000010)   /*!< Slave repetition clear flag */
#define HRTIM_TIMICR_UPDC        (0x00000040)   /*!< Slave update clear flag */
#define HRTIM_TIMICR_CPT1C       (0x00000080)   /*!< Slave capture 1 clear flag */
#define HRTIM_TIMICR_CPT2C       (0x00000100)   /*!< Slave capture 2 clear flag */
#define HRTIM_TIMICR_SET1C       (0x00000200)   /*!< Slave output 1 set clear flag */
#define HRTIM_TIMICR_RST1C       (0x00000400)   /*!< Slave output 1 reset clear flag */
#define HRTIM_TIMICR_SET2C       (0x00000800)   /*!< Slave output 2 set clear flag */
#define HRTIM_TIMICR_RST2C       (0x00001000)   /*!< Slave output 2 reset clear flag */
#define HRTIM_TIMICR_RSTC        (0x00002000)   /*!< Slave reset clear flag */
#define HRTIM_TIMICR_DLYPRT1C    (0x00004000)   /*!< Slave output 1 delay protection clear flag */
#define HRTIM_TIMICR_DLYPRT2C    (0x00008000)   /*!< Slave output 2 delay protection clear flag */

#define HRTIM_TIMDIER_CMP1IE       (0x00000001)   /*!< Slave compare 1 interrupt enable */
#define HRTIM_TIMDIER_CMP2IE       (0x00000002)   /*!< Slave compare 2 interrupt enable */
#define HRTIM_TIMDIER_CMP3IE       (0x00000004)   /*!< Slave compare 3 interrupt enable */
#define HRTIM_TIMDIER_CMP4IE       (0x00000008)   /*!< Slave compare 4 interrupt enable */
#define HRTIM_TIMDIER_REPIE        (0x00000010)   /*!< Slave repetition interrupt enable */
#define HRTIM_TIMDIER_UPDIE        (0x00000040)   /*!< Slave update interrupt enable */
#define HRTIM_TIMDIER_CPT1IE       (0x00000080)   /*!< Slave capture 1 interrupt enable */
#define HRTIM_TIMDIER_CPT2IE       (0x00000100)   /*!< Slave capture 2 interrupt enable */
#define HRTIM_TIMDIER_SET1IE       (0x00000200)   /*!< Slave output 1 set interrupt enable */
#define HRTIM_TIMDIER_RST1IE       (0x00000400)   /*!< Slave output 1 reset interrupt enable */
#define HRTIM_TIMDIER_SET2IE       (0x00000800)   /*!< Slave output 2 set interrupt enable */
#define HRTIM_TIMDIER_RST2IE       (0x00001000)   /*!< Slave output 2 reset interrupt enable */
#define HRTIM_TIMDIER_RSTIE        (0x00002000)   /*!< Slave reset interrupt enable */
#define HRTIM_TIMDIER_DLYPRTIE     (0x00004000)   /*!< Slave delay protection interrupt enable */

#define HRTIM_TIMDIER_CMP1DE       (0x00010000)   /*!< Slave compare 1 request enable */
#define HRTIM_TIMDIER_CMP2DE       (0x00020000)   /*!< Slave compare 2 request enable */
#define HRTIM_TIMDIER_CMP3DE       (0x00040000)   /*!< Slave compare 3 request enable */
#define HRTIM_TIMDIER_CMP4DE       (0x00080000)   /*!< Slave compare 4 request enable */
#define HRTIM_TIMDIER_REPDE        (0x00100000)   /*!< Slave repetition request enable */
#define HRTIM_TIMDIER_UPDDE        (0x00400000)   /*!< Slave update request enable */
#define HRTIM_TIMDIER_CPT1DE       (0x00800000)   /*!< Slave capture 1 request enable */
#define HRTIM_TIMDIER_CPT2DE       (0x01000000)   /*!< Slave capture 2 request enable */
#define HRTIM_TIMDIER_SET1DE       (0x02000000)   /*!< Slave output 1 set request enable */
#define HRTIM_TIMDIER_RST1DE       (0x04000000)   /*!< Slave output 1 reset request enable */
#define HRTIM_TIMDIER_SET2DE       (0x08000000)   /*!< Slave output 2 set request enable */
#define HRTIM_TIMDIER_RST2DE       (0x10000000)   /*!< Slave output 2 reset request enable */
#define HRTIM_TIMDIER_RSTDE        (0x20000000)   /*!< Slave reset request enable */
#define HRTIM_TIMDIER_DLYPRTDE     (0x40000000)   /*!< Slave delay protection request enable */

#define  HRTIM_CNTR_CNTR      (0xFFFFFFFF)       /*!< Counter Value */

#define  HRTIM_PER_PER       (0xFFFFFFFF)        /*!< Period Value */

#define  HRTIM_REP_REP      (0xFFFFFFFF)        /*!< Repetition Value */

