the-nw1-group/acb-modules/acb-common/include/stm/stm32f30x.inc
#define  HRTIM_CMP1R_CMP1R     (0xFFFFFFFF)     /*!< Compare Value */

#define  HRTIM_CMP1CR_CMP1CR     (0xFFFFFFFF)     /*!< Compare Value */

#define  HRTIM_CMP2R_CMP2R     (0xFFFFFFFF)     /*!< Compare Value */

#define  HRTIM_CMP3R_CMP3R     (0xFFFFFFFF)     /*!< Compare Value */

#define  HRTIM_CMP4R_CMP4R     (0xFFFFFFFF)     /*!< Compare Value */

#define  HRTIM_CPT1R_CPT1R     (0xFFFFFFFF)     /*!< Capture Value */

#define  HRTIM_CPT2R_CPT2R     (0xFFFFFFFF)     /*!< Capture Value */

#define HRTIM_DTR_DTR           (0x000001FF)    /*!< Dead time rising value */
#define HRTIM_DTR_DTR_0         (0x00000001)    /*!< Dead time rising bit 0 */
#define HRTIM_DTR_DTR_1         (0x00000002)    /*!< Dead time rising bit 1 */
#define HRTIM_DTR_DTR_2         (0x00000004)    /*!< Dead time rising bit 2 */
#define HRTIM_DTR_DTR_3         (0x00000008)    /*!< Dead time rising bit 3 */
#define HRTIM_DTR_DTR_4         (0x00000010)    /*!< Dead time rising bit 4 */
#define HRTIM_DTR_DTR_5         (0x00000020)    /*!< Dead time rising bit 5 */
#define HRTIM_DTR_DTR_6         (0x00000040)    /*!< Dead time rising bit 6 */
#define HRTIM_DTR_DTR_7         (0x00000080)    /*!< Dead time rising bit 7 */
#define HRTIM_DTR_DTR_8         (0x00000100)    /*!< Dead time rising bit 8 */
#define HRTIM_DTR_SDTR          (0x00000200)    /*!< Sign dead time rising value */
#define HRTIM_DTR_DTPRSC        (0x00001C00)    /*!< Dead time prescaler */
#define HRTIM_DTR_DTPRSC_0      (0x00000400)    /*!< Dead time prescaler bit 0 */
#define HRTIM_DTR_DTPRSC_1      (0x00000800)    /*!< Dead time prescaler bit 1 */
#define HRTIM_DTR_DTPRSC_2      (0x00001000)    /*!< Dead time prescaler bit 2 */
#define HRTIM_DTR_DTRSLK        (0x00004000)    /*!< Dead time rising sign lock */
#define HRTIM_DTR_DTRLK         (0x00008000)    /*!< Dead time rising lock */
#define HRTIM_DTR_DTF           (0x01FF0000)    /*!< Dead time falling value */
#define HRTIM_DTR_DTF_0         (0x00010000)    /*!< Dead time falling bit 0 */
#define HRTIM_DTR_DTF_1         (0x00020000)    /*!< Dead time falling bit 1 */
#define HRTIM_DTR_DTF_2         (0x00040000)    /*!< Dead time falling bit 2 */
#define HRTIM_DTR_DTF_3         (0x00080000)    /*!< Dead time falling bit 3 */
#define HRTIM_DTR_DTF_4         (0x00100000)    /*!< Dead time falling bit 4 */
#define HRTIM_DTR_DTF_5         (0x00200000)    /*!< Dead time falling bit 5 */
#define HRTIM_DTR_DTF_6         (0x00400000)    /*!< Dead time falling bit 6 */
#define HRTIM_DTR_DTF_7         (0x00800000)    /*!< Dead time falling bit 7 */
#define HRTIM_DTR_DTF_8         (0x01000000)    /*!< Dead time falling bit 8 */
#define HRTIM_DTR_SDTF          (0x02000000)    /*!< Sign dead time falling value */
#define HRTIM_DTR_DTFSLK        (0x40000000)    /*!< Dead time falling sign lock */
#define HRTIM_DTR_DTFLK         (0x80000000)    /*!< Dead time falling lock */

#define HRTIM_SET1R_SST         (0x00000001)    /*!< software set trigger */
#define HRTIM_SET1R_RESYNC      (0x00000002)    /*!< Timer A resynchronization */
#define HRTIM_SET1R_PER         (0x00000004)    /*!< Timer A period */
#define HRTIM_SET1R_CMP1        (0x00000008)    /*!< Timer A compare 1 */
#define HRTIM_SET1R_CMP2        (0x00000010)    /*!< Timer A compare 2 */
#define HRTIM_SET1R_CMP3        (0x00000020)    /*!< Timer A compare 3 */
#define HRTIM_SET1R_CMP4        (0x00000040)    /*!< Timer A compare 4 */

#define HRTIM_SET1R_MSTPER      (0x00000080)    /*!< Master period */
#define HRTIM_SET1R_MSTCMP1     (0x00000100)    /*!< Master compare 1 */
#define HRTIM_SET1R_MSTCMP2     (0x00000200)    /*!< Master compare 2 */
#define HRTIM_SET1R_MSTCMP3     (0x00000400)    /*!< Master compare 3 */
#define HRTIM_SET1R_MSTCMP4     (0x00000800)    /*!< Master compare 4 */

#define HRTIM_SET1R_TIMEVNT1   (0x00001000)    /*!< Timer event 1 */
#define HRTIM_SET1R_TIMEVNT2   (0x00002000)    /*!< Timer event 2 */
#define HRTIM_SET1R_TIMEVNT3   (0x00004000)    /*!< Timer event 3 */
#define HRTIM_SET1R_TIMEVNT4   (0x00008000)    /*!< Timer event 4 */
#define HRTIM_SET1R_TIMEVNT5   (0x00010000)    /*!< Timer event 5 */
#define HRTIM_SET1R_TIMEVNT6   (0x00020000)    /*!< Timer event 6 */
#define HRTIM_SET1R_TIMEVNT7   (0x00040000)    /*!< Timer event 7 */
#define HRTIM_SET1R_TIMEVNT8   (0x00080000)    /*!< Timer event 8 */
#define HRTIM_SET1R_TIMEVNT9   (0x00100000)    /*!< Timer event 9 */

#define HRTIM_SET1R_EXTVNT1   (0x00200000)    /*!< External event 1 */
#define HRTIM_SET1R_EXTVNT2   (0x00400000)    /*!< External event 2 */
#define HRTIM_SET1R_EXTVNT3   (0x00800000)    /*!< External event 3 */
#define HRTIM_SET1R_EXTVNT4   (0x01000000)    /*!< External event 4 */
#define HRTIM_SET1R_EXTVNT5   (0x02000000)    /*!< External event 5 */
#define HRTIM_SET1R_EXTVNT6   (0x04000000)    /*!< External event 6 */
#define HRTIM_SET1R_EXTVNT7   (0x08000000)    /*!< External event 7 */
#define HRTIM_SET1R_EXTVNT8   (0x10000000)    /*!< External event 8 */
#define HRTIM_SET1R_EXTVNT9   (0x20000000)    /*!< External event 9 */
#define HRTIM_SET1R_EXTVNT10  (0x40000000)    /*!< External event 10 */

#define HRTIM_SET1R_UPDATE    (0x80000000)    /*!< Register update (transfer preload to active) */

#define HRTIM_RST1R_SRT         (0x00000001)    /*!< software reset trigger */
#define HRTIM_RST1R_RESYNC      (0x00000002)    /*!< Timer A resynchronization */
#define HRTIM_RST1R_PER         (0x00000004)    /*!< Timer A period */
#define HRTIM_RST1R_CMP1        (0x00000008)    /*!< Timer A compare 1 */
#define HRTIM_RST1R_CMP2        (0x00000010)    /*!< Timer A compare 2 */
#define HRTIM_RST1R_CMP3        (0x00000020)    /*!< Timer A compare 3 */
#define HRTIM_RST1R_CMP4        (0x00000040)    /*!< Timer A compare 4 */

#define HRTIM_RST1R_MSTPER      (0x00000080)    /*!< Master period */
#define HRTIM_RST1R_MSTCMP1     (0x00000100)    /*!< Master compare 1 */
#define HRTIM_RST1R_MSTCMP2     (0x00000200)    /*!< Master compare 2 */
#define HRTIM_RST1R_MSTCMP3     (0x00000400)    /*!< Master compare 3 */
#define HRTIM_RST1R_MSTCMP4     (0x00000800)    /*!< Master compare 4 */

#define HRTIM_RST1R_TIMEVNT1   (0x00001000)    /*!< Timer event 1 */
#define HRTIM_RST1R_TIMEVNT2   (0x00002000)    /*!< Timer event 2 */
#define HRTIM_RST1R_TIMEVNT3   (0x00004000)    /*!< Timer event 3 */
#define HRTIM_RST1R_TIMEVNT4   (0x00008000)    /*!< Timer event 4 */
#define HRTIM_RST1R_TIMEVNT5   (0x00010000)    /*!< Timer event 5 */
#define HRTIM_RST1R_TIMEVNT6   (0x00020000)    /*!< Timer event 6 */
#define HRTIM_RST1R_TIMEVNT7   (0x00040000)    /*!< Timer event 7 */
#define HRTIM_RST1R_TIMEVNT8   (0x00080000)    /*!< Timer event 8 */
#define HRTIM_RST1R_TIMEVNT9   (0x00100000)    /*!< Timer event 9 */

#define HRTIM_RST1R_EXTVNT1   (0x00200000)    /*!< External event 1 */
#define HRTIM_RST1R_EXTVNT2   (0x00400000)    /*!< External event 2 */
#define HRTIM_RST1R_EXTVNT3   (0x00800000)    /*!< External event 3 */
#define HRTIM_RST1R_EXTVNT4   (0x01000000)    /*!< External event 4 */
#define HRTIM_RST1R_EXTVNT5   (0x02000000)    /*!< External event 5 */
#define HRTIM_RST1R_EXTVNT6   (0x04000000)    /*!< External event 6 */
#define HRTIM_RST1R_EXTVNT7   (0x08000000)    /*!< External event 7 */
#define HRTIM_RST1R_EXTVNT8   (0x10000000)    /*!< External event 8 */
#define HRTIM_RST1R_EXTVNT9   (0x20000000)    /*!< External event 9 */
#define HRTIM_RST1R_EXTVNT10  (0x40000000)    /*!< External event 10 */

#define HRTIM_RST1R_UPDATE    (0x80000000)    /*!< Register update (transfer preload to active) */


#define HRTIM_SET2R_SST         (0x00000001)    /*!< software set trigger */
#define HRTIM_SET2R_RESYNC      (0x00000002)    /*!< Timer A resynchronization */
#define HRTIM_SET2R_PER         (0x00000004)    /*!< Timer A period */
#define HRTIM_SET2R_CMP1        (0x00000008)    /*!< Timer A compare 1 */
#define HRTIM_SET2R_CMP2        (0x00000010)    /*!< Timer A compare 2 */
#define HRTIM_SET2R_CMP3        (0x00000020)    /*!< Timer A compare 3 */
#define HRTIM_SET2R_CMP4        (0x00000040)    /*!< Timer A compare 4 */

#define HRTIM_SET2R_MSTPER      (0x00000080)    /*!< Master period */
#define HRTIM_SET2R_MSTCMP1     (0x00000100)    /*!< Master compare 1 */
#define HRTIM_SET2R_MSTCMP2     (0x00000200)    /*!< Master compare 2 */
#define HRTIM_SET2R_MSTCMP3     (0x00000400)    /*!< Master compare 3 */
#define HRTIM_SET2R_MSTCMP4     (0x00000800)    /*!< Master compare 4 */

#define HRTIM_SET2R_TIMEVNT1   (0x00001000)    /*!< Timer event 1 */
#define HRTIM_SET2R_TIMEVNT2   (0x00002000)    /*!< Timer event 2 */
#define HRTIM_SET2R_TIMEVNT3   (0x00004000)    /*!< Timer event 3 */
#define HRTIM_SET2R_TIMEVNT4   (0x00008000)    /*!< Timer event 4 */
#define HRTIM_SET2R_TIMEVNT5   (0x00010000)    /*!< Timer event 5 */
#define HRTIM_SET2R_TIMEVNT6   (0x00020000)    /*!< Timer event 6 */
#define HRTIM_SET2R_TIMEVNT7   (0x00040000)    /*!< Timer event 7 */
#define HRTIM_SET2R_TIMEVNT8   (0x00080000)    /*!< Timer event 8 */
#define HRTIM_SET2R_TIMEVNT9   (0x00100000)    /*!< Timer event 9 */

