the-nw1-group/acb-modules/acb-common/include/stm/stm32f30x.inc
#define HRTIM_SET2R_EXTVNT1   (0x00200000)    /*!< External event 1 */
#define HRTIM_SET2R_EXTVNT2   (0x00400000)    /*!< External event 2 */
#define HRTIM_SET2R_EXTVNT3   (0x00800000)    /*!< External event 3 */
#define HRTIM_SET2R_EXTVNT4   (0x01000000)    /*!< External event 4 */
#define HRTIM_SET2R_EXTVNT5   (0x02000000)    /*!< External event 5 */
#define HRTIM_SET2R_EXTVNT6   (0x04000000)    /*!< External event 6 */
#define HRTIM_SET2R_EXTVNT7   (0x08000000)    /*!< External event 7 */
#define HRTIM_SET2R_EXTVNT8   (0x10000000)    /*!< External event 8 */
#define HRTIM_SET2R_EXTVNT9   (0x20000000)    /*!< External event 9 */
#define HRTIM_SET2R_EXTVNT10  (0x40000000)    /*!< External event 10 */

#define HRTIM_SET2R_UPDATE    (0x80000000)    /*!< Register update (transfer preload to active) */

#define HRTIM_RST2R_SRT         (0x00000001)    /*!< software reset trigger */
#define HRTIM_RST2R_RESYNC      (0x00000002)    /*!< Timer A resynchronization */
#define HRTIM_RST2R_PER         (0x00000004)    /*!< Timer A period */
#define HRTIM_RST2R_CMP1        (0x00000008)    /*!< Timer A compare 1 */
#define HRTIM_RST2R_CMP2        (0x00000010)    /*!< Timer A compare 2 */
#define HRTIM_RST2R_CMP3        (0x00000020)    /*!< Timer A compare 3 */
#define HRTIM_RST2R_CMP4        (0x00000040)    /*!< Timer A compare 4 */

#define HRTIM_RST2R_MSTPER      (0x00000080)    /*!< Master period */
#define HRTIM_RST2R_MSTCMP1     (0x00000100)    /*!< Master compare 1 */
#define HRTIM_RST2R_MSTCMP2     (0x00000200)    /*!< Master compare 2 */
#define HRTIM_RST2R_MSTCMP3     (0x00000400)    /*!< Master compare 3 */
#define HRTIM_RST2R_MSTCMP4     (0x00000800)    /*!< Master compare 4 */

#define HRTIM_RST2R_TIMEVNT1   (0x00001000)    /*!< Timer event 1 */
#define HRTIM_RST2R_TIMEVNT2   (0x00002000)    /*!< Timer event 2 */
#define HRTIM_RST2R_TIMEVNT3   (0x00004000)    /*!< Timer event 3 */
#define HRTIM_RST2R_TIMEVNT4   (0x00008000)    /*!< Timer event 4 */
#define HRTIM_RST2R_TIMEVNT5   (0x00010000)    /*!< Timer event 5 */
#define HRTIM_RST2R_TIMEVNT6   (0x00020000)    /*!< Timer event 6 */
#define HRTIM_RST2R_TIMEVNT7   (0x00040000)    /*!< Timer event 7 */
#define HRTIM_RST2R_TIMEVNT8   (0x00080000)    /*!< Timer event 8 */
#define HRTIM_RST2R_TIMEVNT9   (0x00100000)    /*!< Timer event 9 */

#define HRTIM_RST2R_EXTVNT1   (0x00200000)    /*!< External event 1 */
#define HRTIM_RST2R_EXTVNT2   (0x00400000)    /*!< External event 2 */
#define HRTIM_RST2R_EXTVNT3   (0x00800000)    /*!< External event 3 */
#define HRTIM_RST2R_EXTVNT4   (0x01000000)    /*!< External event 4 */
#define HRTIM_RST2R_EXTVNT5   (0x02000000)    /*!< External event 5 */
#define HRTIM_RST2R_EXTVNT6   (0x04000000)    /*!< External event 6 */
#define HRTIM_RST2R_EXTVNT7   (0x08000000)    /*!< External event 7 */
#define HRTIM_RST2R_EXTVNT8   (0x10000000)    /*!< External event 8 */
#define HRTIM_RST2R_EXTVNT9   (0x20000000)    /*!< External event 9 */
#define HRTIM_RST2R_EXTVNT10  (0x40000000)    /*!< External event 10 */

#define HRTIM_RST2R_UPDATE    (0x80000000)    /*!< Register update (transfer preload to active) */

#define HRTIM_EEFR1_EE1LTCH    (0x00000001)    /*!< External Event 1 latch */
#define HRTIM_EEFR1_EE1FLTR    (0x0000001E)    /*!< External Event 1 filter mask */
#define HRTIM_EEFR1_EE1FLTR_0  (0x00000002)    /*!< External Event 1 bit 0  */
#define HRTIM_EEFR1_EE1FLTR_1  (0x00000004)    /*!< External Event 1 bit 1*/
#define HRTIM_EEFR1_EE1FLTR_2  (0x00000008)    /*!< External Event 1 bit 2 */
#define HRTIM_EEFR1_EE1FLTR_3  (0x00000010)    /*!< External Event 1 bit 3 */

#define HRTIM_EEFR1_EE2LTCH    (0x00000040)    /*!< External Event 2 latch */
#define HRTIM_EEFR1_EE2FLTR    (0x00000780)    /*!< External Event 2 filter mask */
#define HRTIM_EEFR1_EE2FLTR_0  (0x00000080)    /*!< External Event 2 bit 0  */
#define HRTIM_EEFR1_EE2FLTR_1  (0x00000100)    /*!< External Event 2 bit 1*/
#define HRTIM_EEFR1_EE2FLTR_2  (0x00000200)    /*!< External Event 2 bit 2 */
#define HRTIM_EEFR1_EE2FLTR_3  (0x00000400)    /*!< External Event 2 bit 3 */

#define HRTIM_EEFR1_EE3LTCH    (0x00001000)    /*!< External Event 3 latch */
#define HRTIM_EEFR1_EE3FLTR    (0x0001E000)    /*!< External Event 3 filter mask */
#define HRTIM_EEFR1_EE3FLTR_0  (0x00002000)    /*!< External Event 3 bit 0  */
#define HRTIM_EEFR1_EE3FLTR_1  (0x00004000)    /*!< External Event 3 bit 1*/
#define HRTIM_EEFR1_EE3FLTR_2  (0x00008000)    /*!< External Event 3 bit 2 */
#define HRTIM_EEFR1_EE3FLTR_3  (0x00010000)    /*!< External Event 3 bit 3 */

#define HRTIM_EEFR1_EE4LTCH    (0x00040000)    /*!< External Event 4 latch */
#define HRTIM_EEFR1_EE4FLTR    (0x00780000)    /*!< External Event 4 filter mask */
#define HRTIM_EEFR1_EE4FLTR_0  (0x00080000)    /*!< External Event 4 bit 0  */
#define HRTIM_EEFR1_EE4FLTR_1  (0x00100000)    /*!< External Event 4 bit 1*/
#define HRTIM_EEFR1_EE4FLTR_2  (0x00200000)    /*!< External Event 4 bit 2 */
#define HRTIM_EEFR1_EE4FLTR_3  (0x00400000)    /*!< External Event 4 bit 3 */

#define HRTIM_EEFR1_EE5LTCH    (0x01000000)   /*!< External Event 5 latch */
#define HRTIM_EEFR1_EE5FLTR    (0x1E000000)    /*!< External Event 5 filter mask */
#define HRTIM_EEFR1_EE5FLTR_0  (0x02000000)    /*!< External Event 5 bit 0  */
#define HRTIM_EEFR1_EE5FLTR_1  (0x04000000)    /*!< External Event 5 bit 1*/
#define HRTIM_EEFR1_EE5FLTR_2  (0x08000000)    /*!< External Event 5 bit 2 */
#define HRTIM_EEFR1_EE5FLTR_3  (0x10000000)    /*!< External Event 5 bit 3 */

#define HRTIM_EEFR2_EE6LTCH    (0x00000001)    /*!< External Event 6 latch */
#define HRTIM_EEFR2_EE6FLTR    (0x0000001E)    /*!< External Event 6 filter mask */
#define HRTIM_EEFR2_EE6FLTR_0  (0x00000002)    /*!< External Event 6 bit 0  */
#define HRTIM_EEFR2_EE6FLTR_1  (0x00000004)    /*!< External Event 6 bit 1*/
#define HRTIM_EEFR2_EE6FLTR_2  (0x00000008)    /*!< External Event 6 bit 2 */
#define HRTIM_EEFR2_EE6FLTR_3  (0x00000010)    /*!< External Event 6 bit 3 */

#define HRTIM_EEFR2_EE7LTCH    (0x00000040)    /*!< External Event 7 latch */
#define HRTIM_EEFR2_EE7FLTR    (0x00000780)    /*!< External Event 7 filter mask */
#define HRTIM_EEFR2_EE7FLTR_0  (0x00000080)    /*!< External Event 7 bit 0  */
#define HRTIM_EEFR2_EE7FLTR_1  (0x00000100)    /*!< External Event 7 bit 1*/
#define HRTIM_EEFR2_EE7FLTR_2  (0x00000200)    /*!< External Event 7 bit 2 */
#define HRTIM_EEFR2_EE7FLTR_3  (0x00000400)    /*!< External Event 7 bit 3 */

#define HRTIM_EEFR2_EE8LTCH    (0x00001000)    /*!< External Event 8 latch */
#define HRTIM_EEFR2_EE8FLTR    (0x0001E000)    /*!< External Event 8 filter mask */
#define HRTIM_EEFR2_EE8FLTR_0  (0x00002000)    /*!< External Event 8 bit 0  */
#define HRTIM_EEFR2_EE8FLTR_1  (0x00004000)    /*!< External Event 8 bit 1*/
#define HRTIM_EEFR2_EE8FLTR_2  (0x00008000)    /*!< External Event 8 bit 2 */
#define HRTIM_EEFR2_EE8FLTR_3  (0x00010000)    /*!< External Event 8 bit 3 */

#define HRTIM_EEFR2_EE9LTCH    (0x00040000)    /*!< External Event 9 latch */
#define HRTIM_EEFR2_EE9FLTR    (0x00780000)    /*!< External Event 9 filter mask */
#define HRTIM_EEFR2_EE9FLTR_0  (0x00080000)    /*!< External Event 9 bit 0  */
#define HRTIM_EEFR2_EE9FLTR_1  (0x00100000)    /*!< External Event 9 bit 1*/
#define HRTIM_EEFR2_EE9FLTR_2  (0x00200000)    /*!< External Event 9 bit 2 */
#define HRTIM_EEFR2_EE9FLTR_3  (0x00400000)    /*!< External Event 9 bit 3 */

#define HRTIM_EEFR2_EE10LTCH    (0x01000000)   /*!< External Event 10 latch */
#define HRTIM_EEFR2_EE10FLTR    (0x1E000000)    /*!< External Event 10 filter mask */
#define HRTIM_EEFR2_EE10FLTR_0  (0x02000000)    /*!< External Event 10 bit 0  */
#define HRTIM_EEFR2_EE10FLTR_1  (0x04000000)    /*!< External Event 10 bit 1*/
#define HRTIM_EEFR2_EE10FLTR_2  (0x08000000)    /*!< External Event 10 bit 2 */
#define HRTIM_EEFR2_EE10FLTR_3  (0x10000000)    /*!< External Event 10 bit 3 */

#define HRTIM_RSTR_UPDATE     (0x00000002)   /*!< Timer update */
#define HRTIM_RSTR_CMP2       (0x00000004)   /*!< Timer compare2 */
#define HRTIM_RSTR_CMP4       (0x00000008)   /*!< Timer compare4 */

#define HRTIM_RSTR_MSTPER     (0x00000010)   /*!< Master period */
#define HRTIM_RSTR_MSTCMP1    (0x00000020)   /*!< Master compare1 */
#define HRTIM_RSTR_MSTCMP2    (0x00000040)   /*!< Master compare2 */
#define HRTIM_RSTR_MSTCMP3    (0x00000080)   /*!< Master compare3 */
#define HRTIM_RSTR_MSTCMP4    (0x00000100)   /*!< Master compare4 */

#define HRTIM_RSTR_EXTEVNT1   (0x00000200)   /*!< External event 1 */
#define HRTIM_RSTR_EXTEVNT2   (0x00000400)   /*!< External event 2 */
#define HRTIM_RSTR_EXTEVNT3   (0x00000800)   /*!< External event 3 */
#define HRTIM_RSTR_EXTEVNT4   (0x00001000)   /*!< External event 4 */
#define HRTIM_RSTR_EXTEVNT5   (0x00002000)   /*!< External event 5 */
#define HRTIM_RSTR_EXTEVNT6   (0x00004000)   /*!< External event 6 */
#define HRTIM_RSTR_EXTEVNT7   (0x00008000)   /*!< External event 7 */
#define HRTIM_RSTR_EXTEVNT8   (0x00010000)   /*!< External event 8 */
#define HRTIM_RSTR_EXTEVNT9   (0x00020000)   /*!< External event 9 */
#define HRTIM_RSTR_EXTEVNT10  (0x00040000)   /*!< External event 10 */

