the-nw1-group/acb-modules/acb-common/include/stm/stm32f30x.inc
#define HRTIM_RSTR_TIMBCMP1   (0x00080000)   /*!< Timer B compare 1 */
#define HRTIM_RSTR_TIMBCMP2   (0x00100000)   /*!< Timer B compare 2 */
#define HRTIM_RSTR_TIMBCMP4   (0x00200000)   /*!< Timer B compare 4 */

#define HRTIM_RSTR_TIMCCMP1   (0x00400000)   /*!< Timer C compare 1 */
#define HRTIM_RSTR_TIMCCMP2   (0x00800000)   /*!< Timer C compare 2 */
#define HRTIM_RSTR_TIMCCMP4   (0x01000000)   /*!< Timer C compare 4 */

#define HRTIM_RSTR_TIMDCMP1   (0x02000000)   /*!< Timer D compare 1 */
#define HRTIM_RSTR_TIMDCMP2   (0x04000000)   /*!< Timer D compare 2 */
#define HRTIM_RSTR_TIMDCMP4   (0x08000000)   /*!< Timer D compare 4 */

#define HRTIM_RSTR_TIMECMP1   (0x10000000)   /*!< Timer E compare 1 */
#define HRTIM_RSTR_TIMECMP2   (0x20000000)   /*!< Timer E compare 2 */
#define HRTIM_RSTR_TIMECMP4   (0x40000000)   /*!< Timer E compare 4 */

#define HRTIM_CHPR_CARFRQ    (0x0000000F)   /*!< Timer carrier frequency value */
#define HRTIM_CHPR_CARFRQ_0  (0x00000001)   /*!< Timer carrier frequency value bit 0 */
#define HRTIM_CHPR_CARFRQ_1  (0x00000002)   /*!< Timer carrier frequency value bit 1 */
#define HRTIM_CHPR_CARFRQ_2  (0x00000004)   /*!< Timer carrier frequency value bit 2 */
#define HRTIM_CHPR_CARFRQ_3  (0x00000008)   /*!< Timer carrier frequency value bit 3 */

#define HRTIM_CHPR_CARDTY    (0x00000070)   /*!< Timer chopper duty cycle value */
#define HRTIM_CHPR_CARDTY_0  (0x00000010)   /*!< Timer chopper duty cycle value bit 0 */
#define HRTIM_CHPR_CARDTY_1  (0x00000020)   /*!< Timer chopper duty cycle value bit 1 */
#define HRTIM_CHPR_CARDTY_2  (0x00000040)   /*!< Timer chopper duty cycle value bit 2 */

#define HRTIM_CHPR_STRPW     (0x00000780)   /*!< Timer start pulse width value */
#define HRTIM_CHPR_STRPW_0   (0x00000080)   /*!< Timer start pulse width value bit 0 */
#define HRTIM_CHPR_STRPW_1   (0x00000100)   /*!< Timer start pulse width value bit 1 */
#define HRTIM_CHPR_STRPW_2   (0x00000200)   /*!< Timer start pulse width value bit 2 */
#define HRTIM_CHPR_STRPW_3   (0x00000400)   /*!< Timer start pulse width value bit 3 */

#define HRTIM_CPT1CR_SWCPT       (0x00000001)   /*!< Software capture */
#define HRTIM_CPT1CR_UPDCPT      (0x00000002)   /*!< Update capture */
#define HRTIM_CPT1CR_EXEV1CPT    (0x00000004)   /*!< External event 1 capture */
#define HRTIM_CPT1CR_EXEV2CPT    (0x00000008)   /*!< External event 2 capture */
#define HRTIM_CPT1CR_EXEV3CPT    (0x00000010)   /*!< External event 3 capture */
#define HRTIM_CPT1CR_EXEV4CPT    (0x00000020)   /*!< External event 4 capture */
#define HRTIM_CPT1CR_EXEV5CPT    (0x00000040)   /*!< External event 5 capture */
#define HRTIM_CPT1CR_EXEV6CPT    (0x00000080)   /*!< External event 6 capture */
#define HRTIM_CPT1CR_EXEV7CPT    (0x00000100)   /*!< External event 7 capture */
#define HRTIM_CPT1CR_EXEV8CPT    (0x00000200)   /*!< External event 8 capture */
#define HRTIM_CPT1CR_EXEV9CPT    (0x00000400)   /*!< External event 9 capture */
#define HRTIM_CPT1CR_EXEV10CPT   (0x00000800)   /*!< External event 10 capture */

#define HRTIM_CPT1CR_TA1SET      (0x00001000)   /*!< Timer A output 1 set */
#define HRTIM_CPT1CR_TA1RST      (0x00002000)   /*!< Timer A output 1 reset */
#define HRTIM_CPT1CR_TA1CMP1     (0x00004000)   /*!< Timer A compare 1 */
#define HRTIM_CPT1CR_TA1CMP2     (0x00008000)   /*!< Timer A compare 2 */

#define HRTIM_CPT1CR_TB1SET      (0x00010000)   /*!< Timer B output 1 set */
#define HRTIM_CPT1CR_TB1RST      (0x00020000)   /*!< Timer B output 1 reset */
#define HRTIM_CPT1CR_TB1CMP1     (0x00040000)   /*!< Timer B compare 1 */
#define HRTIM_CPT1CR_TB1CMP2     (0x00080000)   /*!< Timer B compare 2 */

#define HRTIM_CPT1CR_TC1SET      (0x00100000)   /*!< Timer C output 1 set */
#define HRTIM_CPT1CR_TC1RST      (0x00200000)   /*!< Timer C output 1 reset */
#define HRTIM_CPT1CR_TC1CMP1     (0x00400000)   /*!< Timer C compare 1 */
#define HRTIM_CPT1CR_TC1CMP2     (0x00800000)   /*!< Timer C compare 2 */

#define HRTIM_CPT1CR_TD1SET      (0x01000000)   /*!< Timer D output 1 set */
#define HRTIM_CPT1CR_TD1RST      (0x02000000)   /*!< Timer D output 1 reset */
#define HRTIM_CPT1CR_TD1CMP1     (0x04000000)   /*!< Timer D compare 1 */
#define HRTIM_CPT1CR_TD1CMP2     (0x08000000)   /*!< Timer D compare 2 */

#define HRTIM_CPT1CR_TE1SET      (0x10000000)   /*!< Timer E output 1 set */
#define HRTIM_CPT1CR_TE1RST      (0x20000000)   /*!< Timer E output 1 reset */
#define HRTIM_CPT1CR_TE1CMP1     (0x40000000)   /*!< Timer E compare 1 */
#define HRTIM_CPT1CR_TE1CMP2     (0x80000000)   /*!< Timer E compare 2 */

#define HRTIM_CPT2CR_SWCPT       (0x00000001)   /*!< Software capture */
#define HRTIM_CPT2CR_UPDCPT      (0x00000002)   /*!< Update capture */
#define HRTIM_CPT2CR_EXEV1CPT    (0x00000004)   /*!< External event 1 capture */
#define HRTIM_CPT2CR_EXEV2CPT    (0x00000008)   /*!< External event 2 capture */
#define HRTIM_CPT2CR_EXEV3CPT    (0x00000010)   /*!< External event 3 capture */
#define HRTIM_CPT2CR_EXEV4CPT    (0x00000020)   /*!< External event 4 capture */
#define HRTIM_CPT2CR_EXEV5CPT    (0x00000040)   /*!< External event 5 capture */
#define HRTIM_CPT2CR_EXEV6CPT    (0x00000080)   /*!< External event 6 capture */
#define HRTIM_CPT2CR_EXEV7CPT    (0x00000100)   /*!< External event 7 capture */
#define HRTIM_CPT2CR_EXEV8CPT    (0x00000200)   /*!< External event 8 capture */
#define HRTIM_CPT2CR_EXEV9CPT    (0x00000400)   /*!< External event 9 capture */
#define HRTIM_CPT2CR_EXEV10CPT   (0x00000800)   /*!< External event 10 capture */

#define HRTIM_CPT2CR_TA1SET      (0x00001000)   /*!< Timer A output 1 set */
#define HRTIM_CPT2CR_TA1RST      (0x00002000)   /*!< Timer A output 1 reset */
#define HRTIM_CPT2CR_TA1CMP1     (0x00004000)   /*!< Timer A compare 1 */
#define HRTIM_CPT2CR_TA1CMP2     (0x00008000)   /*!< Timer A compare 2 */

#define HRTIM_CPT2CR_TB1SET      (0x00010000)   /*!< Timer B output 1 set */
#define HRTIM_CPT2CR_TB1RST      (0x00020000)   /*!< Timer B output 1 reset */
#define HRTIM_CPT2CR_TB1CMP1     (0x00040000)   /*!< Timer B compare 1 */
#define HRTIM_CPT2CR_TB1CMP2     (0x00080000)   /*!< Timer B compare 2 */

#define HRTIM_CPT2CR_TC1SET      (0x00100000)   /*!< Timer C output 1 set */
#define HRTIM_CPT2CR_TC1RST      (0x00200000)   /*!< Timer C output 1 reset */
#define HRTIM_CPT2CR_TC1CMP1     (0x00400000)   /*!< Timer C compare 1 */
#define HRTIM_CPT2CR_TC1CMP2     (0x00800000)   /*!< Timer C compare 2 */

#define HRTIM_CPT2CR_TD1SET      (0x01000000)   /*!< Timer D output 1 set */
#define HRTIM_CPT2CR_TD1RST      (0x02000000)   /*!< Timer D output 1 reset */
#define HRTIM_CPT2CR_TD1CMP1     (0x04000000)   /*!< Timer D compare 1 */
#define HRTIM_CPT2CR_TD1CMP2     (0x08000000)   /*!< Timer D compare 2 */

