the-nw1-group/acb-modules/acb-common/include/stm/stm32f30x.inc
#define HRTIM_CPT2CR_TE1SET      (0x10000000)   /*!< Timer E output 1 set */
#define HRTIM_CPT2CR_TE1RST      (0x20000000)   /*!< Timer E output 1 reset */
#define HRTIM_CPT2CR_TE1CMP1     (0x40000000)   /*!< Timer E compare 1 */
#define HRTIM_CPT2CR_TE1CMP2     (0x80000000)   /*!< Timer E compare 2 */

#define HRTIM_OUTR_POL1       (0x00000002)    /*!< Slave output 1 polarity */
#define HRTIM_OUTR_IDLM1      (0x00000004)   /*!< Slave output 1 idle mode */
#define HRTIM_OUTR_IDLES1     (0x00000008)   /*!< Slave output 1 idle state */
#define HRTIM_OUTR_FAULT1     (0x00000030)   /*!< Slave output 1 fault state */
#define HRTIM_OUTR_FAULT1_0   (0x00000010)   /*!< Slave output 1 fault state bit 0 */
#define HRTIM_OUTR_FAULT1_1   (0x00000020)   /*!< Slave output 1 fault state bit 1 */
#define HRTIM_OUTR_CHP1       (0x00000040)   /*!< Slave output 1 chopper enable */
#define HRTIM_OUTR_DIDL1      (0x00000080)   /*!< Slave output 1 dead time idle */

#define HRTIM_OUTR_DTEN      (0x00000100)   /*!< Slave output deadtime enable */
#define HRTIM_OUTR_DLYPRTEN  (0x00000200)   /*!< Slave output delay protection enable */
#define HRTIM_OUTR_DLYPRT    (0x00001C00)   /*!< Slave output delay protection */
#define HRTIM_OUTR_DLYPRT_0  (0x00000400)   /*!< Slave output delay protection bit 0 */
#define HRTIM_OUTR_DLYPRT_1  (0x00000800)   /*!< Slave output delay protection bit 1 */
#define HRTIM_OUTR_DLYPRT_2  (0x00001000)   /*!< Slave output delay protection bit 2 */

#define HRTIM_OUTR_POL2      (0x00020000)   /*!< Slave output 2 polarity */
#define HRTIM_OUTR_IDLM2     (0x00040000)   /*!< Slave output 2 idle mode */
#define HRTIM_OUTR_IDLES2    (0x00080000)   /*!< Slave output 2 idle state */
#define HRTIM_OUTR_FAULT2    (0x00300000)   /*!< Slave output 2 fault state */
#define HRTIM_OUTR_FAULT2_0  (0x00100000)   /*!< Slave output 2 fault state bit 0 */
#define HRTIM_OUTR_FAULT2_1  (0x00200000)   /*!< Slave output 2 fault state bit 1 */
#define HRTIM_OUTR_CHP2      (0x00400000)   /*!< Slave output 2 chopper enable */
#define HRTIM_OUTR_DIDL2     (0x00800000)   /*!< Slave output 2 dead time idle */

#define HRTIM_FLTR_FLT1EN     (0x00000001)   /*!< Fault 1 enable */
#define HRTIM_FLTR_FLT2EN     (0x00000002)   /*!< Fault 2 enable */
#define HRTIM_FLTR_FLT3EN     (0x00000004)   /*!< Fault 3 enable */
#define HRTIM_FLTR_FLT4EN     (0x00000008)   /*!< Fault 4 enable */
#define HRTIM_FLTR_FLT5EN     (0x00000010)   /*!< Fault 5 enable */
#define HRTIM_FLTR_FLTCLK     (0x80000000)   /*!< Fault sources lock */

#define HRTIM_CR1_MUDIS       (0x00000001)   /*!< Master update disable*/
#define HRTIM_CR1_TAUDIS      (0x00000002)   /*!< Timer A update disable*/
#define HRTIM_CR1_TBUDIS      (0x00000004)   /*!< Timer B update disable*/
#define HRTIM_CR1_TCUDIS      (0x00000008)   /*!< Timer C update disable*/
#define HRTIM_CR1_TDUDIS      (0x00000010)   /*!< Timer D update disable*/
#define HRTIM_CR1_TEUDIS      (0x00000020)   /*!< Timer E update disable*/
#define HRTIM_CR1_ADC1USRC    (0x00070000)   /*!< ADC Trigger 1 update source */
#define HRTIM_CR1_ADC1USRC_0  (0x00010000)   /*!< ADC Trigger 1 update source bit 0 */
#define HRTIM_CR1_ADC1USRC_1  (0x00020000)   /*!< ADC Trigger 1 update source bit 1 */
#define HRTIM_CR1_ADC1USRC_2  (0x00040000)   /*!< ADC Trigger 1 update source bit 2 */
#define HRTIM_CR1_ADC2USRC    (0x00380000)   /*!< ADC Trigger 2 update source */
#define HRTIM_CR1_ADC2USRC_0  (0x00080000)   /*!< ADC Trigger 2 update source bit 0 */
#define HRTIM_CR1_ADC2USRC_1  (0x00100000)   /*!< ADC Trigger 2 update source bit 1 */
#define HRTIM_CR1_ADC2USRC_2  (0x00200000)   /*!< ADC Trigger 2 update source bit 2 */
#define HRTIM_CR1_ADC3USRC    (0x01C00000)   /*!< ADC Trigger 3 update source */
#define HRTIM_CR1_ADC3USRC_0  (0x00400000)   /*!< ADC Trigger 3 update source bit 0 */
#define HRTIM_CR1_ADC3USRC_1  (0x00800000)   /*!< ADC Trigger 3 update source bit 1 */
#define HRTIM_CR1_ADC3USRC_2  (0x01000000)   /*!< ADC Trigger 3 update source bit 2 */
#define HRTIM_CR1_ADC4USRC    (0x0E000000)   /*!< ADC Trigger 4 update source */
#define HRTIM_CR1_ADC4USRC_0  (0x02000000)   /*!< ADC Trigger 4 update source bit 0 */
#define HRTIM_CR1_ADC4USRC_1  (0x04000000)   /*!< ADC Trigger 4 update source bit 1 */
#define HRTIM_CR1_ADC4USRC_2  (0x0800000)   /*!< ADC Trigger 4 update source bit 2 */

#define HRTIM_CR2_MSWU   (0x00000001)        /*!< Master software update */
#define HRTIM_CR2_TASWU  (0x00000002)        /*!< Timer A software update */
#define HRTIM_CR2_TBSWU  (0x00000004)        /*!< Timer B software update */
#define HRTIM_CR2_TCSWU  (0x00000008)        /*!< Timer C software update */
#define HRTIM_CR2_TDSWU  (0x00000010)        /*!< Timer D software update */
#define HRTIM_CR2_TESWU  (0x00000020)        /*!< Timer E software update */
#define HRTIM_CR2_MRST   (0x00000100)        /*!< Master count software reset */
#define HRTIM_CR2_TARST  (0x00000200)        /*!< Timer A count software reset */
#define HRTIM_CR2_TBRST  (0x00000400)        /*!< Timer B count software reset */
#define HRTIM_CR2_TCRST  (0x00000800)        /*!< Timer C count software reset */
#define HRTIM_CR2_TDRST  (0x00001000)        /*!< Timer D count software reset */
#define HRTIM_CR2_TERST  (0x00002000)        /*!< Timer E count software reset */

#define HRTIM_ISR_FLT1    (0x00000001)   /*!< Fault 1 interrupt flag */
#define HRTIM_ISR_FLT2    (0x00000002)   /*!< Fault 2 interrupt flag */
#define HRTIM_ISR_FLT3    (0x00000004)   /*!< Fault 3 interrupt flag */
#define HRTIM_ISR_FLT4    (0x00000008)   /*!< Fault 4 interrupt flag */
#define HRTIM_ISR_FLT5    (0x00000010)   /*!< Fault 5 interrupt flag */
#define HRTIM_ISR_SYSFLT  (0x00000020)   /*!< System Fault interrupt flag */
#define HRTIM_ISR_DLLRDY  (0x00010000)   /*!< DLL ready interrupt flag */
#define HRTIM_ISR_BMPER   (0x00020000)   /*!<  Burst mode period interrupt flag */

#define HRTIM_ICR_FLT1C    (0x00000001)   /*!< Fault 1 interrupt flag clear */
#define HRTIM_ICR_FLT2C    (0x00000002)   /*!< Fault 2 interrupt flag clear */
#define HRTIM_ICR_FLT3C    (0x00000004)   /*!< Fault 3 interrupt flag clear */
#define HRTIM_ICR_FLT4C    (0x00000008)   /*!< Fault 4 interrupt flag clear */
#define HRTIM_ICR_FLT5C    (0x00000010)   /*!< Fault 5 interrupt flag clear */
#define HRTIM_ICR_SYSFLTC  (0x00000020)   /*!< System Fault interrupt flag clear */
#define HRTIM_ICR_DLLRDYC  (0x00010000)   /*!< DLL ready interrupt flag clear */
#define HRTIM_ICR_BMPERC   (0x00020000)   /*!<  Burst mode period interrupt flag clear */

#define HRTIM_IER_FLT1    (0x00000001)   /*!< Fault 1 interrupt enable */
#define HRTIM_IER_FLT2    (0x00000002)   /*!< Fault 2 interrupt enable */
#define HRTIM_IER_FLT3    (0x00000004)   /*!< Fault 3 interrupt enable */
#define HRTIM_IER_FLT4    (0x00000008)   /*!< Fault 4 interrupt enable */
#define HRTIM_IER_FLT5    (0x00000010)   /*!< Fault 5 interrupt enable */
#define HRTIM_IER_SYSFLT  (0x00000020)   /*!< System Fault interrupt enable */
#define HRTIM_IER_DLLRDY  (0x00010000)   /*!< DLL ready interrupt enable */
#define HRTIM_IER_BMPER   (0x00020000)   /*!<  Burst mode period interrupt enable */

#define HRTIM_OENR_TA1OEN    (0x00000001)   /*!< Timer A Output 1 enable */
#define HRTIM_OENR_TA2OEN    (0x00000002)   /*!< Timer A Output 2 enable */
#define HRTIM_OENR_TB1OEN    (0x00000004)   /*!< Timer B Output 1 enable */
#define HRTIM_OENR_TB2OEN    (0x00000008)   /*!< Timer B Output 2 enable */
#define HRTIM_OENR_TC1OEN    (0x00000010)   /*!< Timer C Output 1 enable */
#define HRTIM_OENR_TC2OEN    (0x00000020)   /*!< Timer C Output 2 enable */
#define HRTIM_OENR_TD1OEN    (0x00000040)   /*!< Timer D Output 1 enable */
#define HRTIM_OENR_TD2OEN    (0x00000080)   /*!< Timer D Output 2 enable */
#define HRTIM_OENR_TE1OEN    (0x00000100)   /*!< Timer E Output 1 enable */
#define HRTIM_OENR_TE2OEN    (0x00000200)   /*!< Timer E Output 2 enable */

#define HRTIM_ODISR_TA1ODIS    (0x00000001)   /*!< Timer A Output 1 disable */
#define HRTIM_ODISR_TA2ODIS    (0x00000002)   /*!< Timer A Output 2 disable */
#define HRTIM_ODISR_TB1ODIS    (0x00000004)   /*!< Timer B Output 1 disable */
#define HRTIM_ODISR_TB2ODIS    (0x00000008)   /*!< Timer B Output 2 disable */
#define HRTIM_ODISR_TC1ODIS    (0x00000010)   /*!< Timer C Output 1 disable */
#define HRTIM_ODISR_TC2ODIS    (0x00000020)   /*!< Timer C Output 2 disable */
#define HRTIM_ODISR_TD1ODIS    (0x00000040)   /*!< Timer D Output 1 disable */
#define HRTIM_ODISR_TD2ODIS    (0x00000080)   /*!< Timer D Output 2 disable */
#define HRTIM_ODISR_TE1ODIS    (0x00000100)   /*!< Timer E Output 1 disable */
#define HRTIM_ODISR_TE2ODIS    (0x00000200)   /*!< Timer E Output 2 disable */

#define HRTIM_ODSR_TA1ODS    (0x00000001)   /*!< Timer A Output 1 disable status */
#define HRTIM_ODSR_TA2ODS    (0x00000002)   /*!< Timer A Output 2 disable status */
#define HRTIM_ODSR_TB1ODS    (0x00000004)   /*!< Timer B Output 1 disable status */
#define HRTIM_ODSR_TB2ODS    (0x00000008)   /*!< Timer B Output 2 disable status */
#define HRTIM_ODSR_TC1ODS    (0x00000010)   /*!< Timer C Output 1 disable status */
#define HRTIM_ODSR_TC2ODS    (0x00000020)   /*!< Timer C Output 2 disable status */
#define HRTIM_ODSR_TD1ODS    (0x00000040)   /*!< Timer D Output 1 disable status */
#define HRTIM_ODSR_TD2ODS    (0x00000080)   /*!< Timer D Output 2 disable status */
#define HRTIM_ODSR_TE1ODS    (0x00000100)   /*!< Timer E Output 1 disable status */
#define HRTIM_ODSR_TE2ODS    (0x00000200)   /*!< Timer E Output 2 disable status */

#define HRTIM_BMCR_BME       (0x00000001)    /*!< Burst mode enable */
#define HRTIM_BMCR_BMOM      (0x00000002)    /*!< Burst mode operating mode */
#define HRTIM_BMCR_BMCLK     (0x0000003C)    /*!< Burst mode clock source */
#define HRTIM_BMCR_BMCLK_0   (0x00000004)    /*!< Burst mode clock source bit 0 */
#define HRTIM_BMCR_BMCLK_1   (0x00000008)    /*!< Burst mode clock source bit 1 */
#define HRTIM_BMCR_BMCLK_2   (0x00000010)    /*!< Burst mode clock source bit 2 */
#define HRTIM_BMCR_BMCLK_3   (0x00000020)    /*!< Burst mode clock source bit 3 */
#define HRTIM_BMCR_BMPSC     (0x000003C0)    /*!< Burst mode prescaler */
#define HRTIM_BMCR_BMPSC_0   (0x00000040)    /*!< Burst mode prescaler bit 0 */
#define HRTIM_BMCR_BMPSC_1   (0x00000080)    /*!< Burst mode prescaler bit 1 */
#define HRTIM_BMCR_BMPSC_2   (0x00000100)    /*!< Burst mode prescaler bit 2 */
#define HRTIM_BMCR_BMPSC_3   (0x00000200)    /*!< Burst mode prescaler bit 3 */
#define HRTIM_BMCR_BMPREN    (0x00000400)    /*!< Burst mode Preload bit */
#define HRTIM_BMCR_MTBM      (0x00010000)    /*!< Master Timer Burst mode */
#define HRTIM_BMCR_TABM      (0x00020000)    /*!< Timer A Burst mode */
#define HRTIM_BMCR_TBBM      (0x00040000)    /*!< Timer B Burst mode */
#define HRTIM_BMCR_TCBM      (0x00080000)    /*!< Timer C Burst mode */
#define HRTIM_BMCR_TDBM      (0x00100000)    /*!< Timer D Burst mode */
#define HRTIM_BMCR_TEBM      (0x00200000)    /*!< Timer E Burst mode */
#define HRTIM_BMCR_BMSTAT    (0x80000000)    /*!< Burst mode status */

#define HRTIM_BMTRGR_SW       (0x00000001)    /*!< Software start */
#define HRTIM_BMTRGR_MSTRST   (0x00000002)    /*!<  Master reset */
#define HRTIM_BMTRGR_MSTREP   (0x00000004)    /*!<  Master repetition */
#define HRTIM_BMTRGR_MSTCMP1  (0x00000008)    /*!<  Master compare 1 */
#define HRTIM_BMTRGR_MSTCMP2  (0x00000010)    /*!< Master compare 2  */
#define HRTIM_BMTRGR_MSTCMP3  (0x00000020)    /*!< Master compare 3 */
#define HRTIM_BMTRGR_MSTCMP4  (0x00000040)    /*!< Master compare 4 */
#define HRTIM_BMTRGR_TARST    (0x00000080)    /*!< Timer A reset  */
#define HRTIM_BMTRGR_TAREP    (0x00000100)    /*!< Timer A repetition  */
#define HRTIM_BMTRGR_TACMP1   (0x00000200)    /*!< Timer A compare 1  */
#define HRTIM_BMTRGR_TACMP2   (0x00000400)    /*!< Timer A compare 2  */
#define HRTIM_BMTRGR_TBRST    (0x00000800)    /*!< Timer B reset  */
#define HRTIM_BMTRGR_TBREP    (0x00001000)    /*!< Timer B repetition  */
#define HRTIM_BMTRGR_TBCMP1   (0x00002000)    /*!< Timer B compare 1 */
#define HRTIM_BMTRGR_TBCMP2   (0x00004000)    /*!< Timer B compare 2 */
#define HRTIM_BMTRGR_TCRST    (0x00008000)    /*!< Timer C reset  */
#define HRTIM_BMTRGR_TCREP    (0x00010000)    /*!< Timer C repetition */
#define HRTIM_BMTRGR_TCCMP1   (0x00020000)    /*!< Timer C compare 1 */
#define HRTIM_BMTRGR_TCCMP2   (0x00040000)    /*!< Timer C compare 2 */
#define HRTIM_BMTRGR_TDRST    (0x00080000)    /*!< Timer D reset  */
#define HRTIM_BMTRGR_TDREP    (0x00100000)    /*!< Timer D repetition  */
#define HRTIM_BMTRGR_TDCMP1   (0x00200000)    /*!< Timer D compare 1 */
#define HRTIM_BMTRGR_TDCMP2   (0x00400000)    /*!< Timer D compare 2 */
#define HRTIM_BMTRGR_TERST    (0x00800000)    /*!< Timer E reset  */
#define HRTIM_BMTRGR_TEREP    (0x01000000)    /*!< Timer E repetition  */
#define HRTIM_BMTRGR_TECMP1   (0x02000000)    /*!< Timer E compare 1 */
#define HRTIM_BMTRGR_TECMP2   (0x04000000)    /*!< Timer E compare 2 */
#define HRTIM_BMTRGR_TAEEV7   (0x08000000)    /*!< Timer A period following External Event7  */
#define HRTIM_BMTRGR_TDEEV8   (0x10000000)    /*!< Timer D period following External Event8  */
#define HRTIM_BMTRGR_EEV7     (0x20000000)    /*!< External Event 7 */
#define HRTIM_BMTRGR_EEV8     (0x40000000)    /*!< External Event 8 */
#define HRTIM_BMTRGR_OCHPEV   (0x80000000)    /*!< on-chip Event */

#define  HRTIM_BMCMPR_BMCMPR     (0x0000FFFF)     /*!<!<Burst Compare Value */

#define  HRTIM_BMPER_BMPER     (0x0000FFFF)     /*!<!<Burst period Value */

#define HRTIM_EECR1_EE1SRC    (0x00000003)    /*!< External event 1 source */
#define HRTIM_EECR1_EE1SRC_0  (0x00000001)    /*!< External event 1 source bit 0 */
#define HRTIM_EECR1_EE1SRC_1  (0x00000002)    /*!< External event 1 source bit 1 */
#define HRTIM_EECR1_EE1POL    (0x00000004)    /*!< External event 1 Polarity */
#define HRTIM_EECR1_EE1SNS    (0x00000018)    /*!< External event 1 sensitivity */
#define HRTIM_EECR1_EE1SNS_0  (0x00000008)    /*!< External event 1 sensitivity bit 0 */
#define HRTIM_EECR1_EE1SNS_1  (0x00000010)    /*!< External event 1 sensitivity bit 1 */
#define HRTIM_EECR1_EE1FAST   (0x00000020)    /*!< External event 1 Fast mode */

#define HRTIM_EECR1_EE2SRC    (0x000000C0)    /*!< External event 2 source */
#define HRTIM_EECR1_EE2SRC_0  (0x00000040)    /*!< External event 2 source bit 0 */
#define HRTIM_EECR1_EE2SRC_1  (0x00000080)    /*!< External event 2 source bit 1 */
#define HRTIM_EECR1_EE2POL    (0x00000100)    /*!< External event 2 Polarity */
#define HRTIM_EECR1_EE2SNS    (0x00000600)    /*!< External event 2 sensitivity */
#define HRTIM_EECR1_EE2SNS_0  (0x00000200)    /*!< External event 2 sensitivity bit 0 */
#define HRTIM_EECR1_EE2SNS_1  (0x00000400)    /*!< External event 2 sensitivity bit 1 */
#define HRTIM_EECR1_EE2FAST   (0x00000800)    /*!< External event 2 Fast mode */

