the-nw1-group/acb-modules/acb-common/include/stm/stm32f30x.inc
#define HRTIM_EECR1_EE3SRC    (0x00003000)    /*!< External event 3 source */
#define HRTIM_EECR1_EE3SRC_0  (0x00001000)    /*!< External event 3 source bit 0 */
#define HRTIM_EECR1_EE3SRC_1  (0x00002000)    /*!< External event 3 source bit 1 */
#define HRTIM_EECR1_EE3POL    (0x00004000)    /*!< External event 3 Polarity */
#define HRTIM_EECR1_EE3SNS    (0x00018000)    /*!< External event 3 sensitivity */
#define HRTIM_EECR1_EE3SNS_0  (0x00008000)    /*!< External event 3 sensitivity bit 0 */
#define HRTIM_EECR1_EE3SNS_1  (0x00010000)    /*!< External event 3 sensitivity bit 1 */
#define HRTIM_EECR1_EE3FAST   (0x00020000)    /*!< External event 3 Fast mode */

#define HRTIM_EECR1_EE4SRC    (0x000C0000)    /*!< External event 4 source */
#define HRTIM_EECR1_EE4SRC_0  (0x00040000)    /*!< External event 4 source bit 0 */
#define HRTIM_EECR1_EE4SRC_1  (0x00080000)    /*!< External event 4 source bit 1 */
#define HRTIM_EECR1_EE4POL    (0x00100000)    /*!< External event 4 Polarity */
#define HRTIM_EECR1_EE4SNS    (0x00600000)    /*!< External event 4 sensitivity */
#define HRTIM_EECR1_EE4SNS_0  (0x00200000)    /*!< External event 4 sensitivity bit 0 */
#define HRTIM_EECR1_EE4SNS_1  (0x00400000)    /*!< External event 4 sensitivity bit 1 */
#define HRTIM_EECR1_EE4FAST   (0x00800000)    /*!< External event 4 Fast mode */

#define HRTIM_EECR1_EE5SRC    (0x03000000)    /*!< External event 5 source */
#define HRTIM_EECR1_EE5SRC_0  (0x01000000)    /*!< External event 5 source bit 0 */
#define HRTIM_EECR1_EE5SRC_1  (0x02000000)    /*!< External event 5 source bit 1 */
#define HRTIM_EECR1_EE5POL    (0x04000000)    /*!< External event 5 Polarity */
#define HRTIM_EECR1_EE5SNS    (0x18000000)    /*!< External event 5 sensitivity */
#define HRTIM_EECR1_EE5SNS_0  (0x08000000)    /*!< External event 5 sensitivity bit 0 */
#define HRTIM_EECR1_EE5SNS_1  (0x10000000)    /*!< External event 5 sensitivity bit 1 */
#define HRTIM_EECR1_EE5FAST   (0x20000000)    /*!< External event 5 Fast mode */

#define HRTIM_EECR2_EE6SRC    (0x00000003)    /*!< External event 6 source */
#define HRTIM_EECR2_EE6SRC_0  (0x00000001)    /*!< External event 6 source bit 0 */
#define HRTIM_EECR2_EE6SRC_1  (0x00000002)    /*!< External event 6 source bit 1 */
#define HRTIM_EECR2_EE6POL    (0x00000004)    /*!< External event 6 Polarity */
#define HRTIM_EECR2_EE6SNS    (0x00000018)    /*!< External event 6 sensitivity */
#define HRTIM_EECR2_EE6SNS_0  (0x00000008)    /*!< External event 6 sensitivity bit 0 */
#define HRTIM_EECR2_EE6SNS_1  (0x00000010)    /*!< External event 6 sensitivity bit 1 */

#define HRTIM_EECR2_EE7SRC    (0x000000C0)    /*!< External event 7 source */
#define HRTIM_EECR2_EE7SRC_0  (0x00000040)    /*!< External event 7 source bit 0 */
#define HRTIM_EECR2_EE7SRC_1  (0x00000080)    /*!< External event 7 source bit 1 */
#define HRTIM_EECR2_EE7POL    (0x00000100)    /*!< External event 7 Polarity */
#define HRTIM_EECR2_EE7SNS    (0x00000600)    /*!< External event 7 sensitivity */
#define HRTIM_EECR2_EE7SNS_0  (0x00000200)    /*!< External event 7 sensitivity bit 0 */
#define HRTIM_EECR2_EE7SNS_1  (0x00000400)    /*!< External event 7 sensitivity bit 1 */

#define HRTIM_EECR2_EE8SRC    (0x00003000)    /*!< External event 8 source */
#define HRTIM_EECR2_EE8SRC_0  (0x00001000)    /*!< External event 8 source bit 0 */
#define HRTIM_EECR2_EE8SRC_1  (0x00002000)    /*!< External event 8 source bit 1 */
#define HRTIM_EECR2_EE8POL    (0x00004000)    /*!< External event 8 Polarity */
#define HRTIM_EECR2_EE8SNS    (0x00018000)    /*!< External event 8 sensitivity */
#define HRTIM_EECR2_EE8SNS_0  (0x00008000)    /*!< External event 8 sensitivity bit 0 */
#define HRTIM_EECR2_EE8SNS_1  (0x00010000)    /*!< External event 8 sensitivity bit 1 */

#define HRTIM_EECR2_EE9SRC    (0x000C0000)    /*!< External event 9 source */
#define HRTIM_EECR2_EE9SRC_0  (0x00040000)    /*!< External event 9 source bit 0 */
#define HRTIM_EECR2_EE9SRC_1  (0x00080000)    /*!< External event 9 source bit 1 */
#define HRTIM_EECR2_EE9POL    (0x00100000)    /*!< External event 9 Polarity */
#define HRTIM_EECR2_EE9SNS    (0x00600000)    /*!< External event 9 sensitivity */
#define HRTIM_EECR2_EE9SNS_0  (0x00200000)    /*!< External event 9 sensitivity bit 0 */
#define HRTIM_EECR2_EE9SNS_1  (0x00400000)    /*!< External event 9 sensitivity bit 1 */

#define HRTIM_EECR2_EE10SRC    (0x03000000)    /*!< External event 10 source */
#define HRTIM_EECR2_EE10SRC_0  (0x01000000)    /*!< External event 10 source bit 0 */
#define HRTIM_EECR2_EE10SRC_1  (0x02000000)    /*!< External event 10 source bit 1 */
#define HRTIM_EECR2_EE10POL    (0x04000000)    /*!< External event 10 Polarity */
#define HRTIM_EECR2_EE10SNS    (0x18000000)    /*!< External event 10 sensitivity */
#define HRTIM_EECR2_EE10SNS_0  (0x08000000)    /*!< External event 10 sensitivity bit 0 */
#define HRTIM_EECR2_EE10SNS_1  (0x10000000)    /*!< External event 10 sensitivity bit 1 */

#define HRTIM_EECR3_EE6F    (0x0000000F)    /*!< External event 6 filter */
#define HRTIM_EECR3_EE6F_0  (0x00000001)    /*!< External event 6 filter bit 0 */
#define HRTIM_EECR3_EE6F_1  (0x00000002)    /*!< External event 6 filter bit 1  */
#define HRTIM_EECR3_EE6F_2  (0x00000004)    /*!< External event 6 filter bit 2   */
#define HRTIM_EECR3_EE6F_3  (0x00000008)    /*!< External event 6 filter bit 3   */
#define HRTIM_EECR3_EE7F    (0x000003C0)    /*!< External event 7 filter */
#define HRTIM_EECR3_EE7F_0  (0x00000040)    /*!< External event 7 filter bit 0  */
#define HRTIM_EECR3_EE7F_1  (0x00000080)    /*!< External event 7 filter bit 1  */
#define HRTIM_EECR3_EE7F_2  (0x00000100)    /*!< External event 7 filter bit 2  */
#define HRTIM_EECR3_EE7F_3  (0x00000200)    /*!< External event 7 filter bit 3  */
#define HRTIM_EECR3_EE8F    (0x0000F000)    /*!< External event 8 filter */
#define HRTIM_EECR3_EE8F_0  (0x00001000)    /*!< External event 8 filter bit 0 */
#define HRTIM_EECR3_EE8F_1  (0x00002000)    /*!< External event 8 filter bit 1 */
#define HRTIM_EECR3_EE8F_2  (0x00004000)    /*!< External event 8 filter bit 2 */
#define HRTIM_EECR3_EE8F_3  (0x00008000)    /*!< External event 8 filter bit 3 */
#define HRTIM_EECR3_EE9F    (0x003C0000)    /*!< External event 9 filter */
#define HRTIM_EECR3_EE9F_0  (0x00040000)    /*!< External event 9 filter bit 0 */
#define HRTIM_EECR3_EE9F_1  (0x00080000)    /*!< External event 9 filter bit 1 */
#define HRTIM_EECR3_EE9F_2  (0x00100000)    /*!< External event 9 filter bit 2 */
#define HRTIM_EECR3_EE9F_3  (0x00200000)    /*!< External event 9 filter bit 3 */
#define HRTIM_EECR3_EE10F   (0x0F000000)    /*!< External event 10 filter */
#define HRTIM_EECR3_EE10F_0 (0x01000000)    /*!< External event 10 filter bit 0 */
#define HRTIM_EECR3_EE10F_1 (0x02000000)    /*!< External event 10 filter bit 1 */
#define HRTIM_EECR3_EE10F_2 (0x04000000)    /*!< External event 10 filter bit 2 */
#define HRTIM_EECR3_EE10F_3 (0x08000000)    /*!< External event 10 filter bit 3 */
#define HRTIM_EECR3_EEVSD   (0xC0000000)    /*!< External event sampling clock division */
#define HRTIM_EECR3_EEVSD_0 (0x40000000)    /*!< External event sampling clock division bit 0 */
#define HRTIM_EECR3_EEVSD_1 (0x80000000)    /*!< External event sampling clock division bit 1 */

