the-nw1-group/acb-modules/acb-common/include/stm/stm32f30x.inc
#define HRTIM_FLTINR1_FLT4E      (0x01000000)    /*!< Fault 4 enable */ 
#define HRTIM_FLTINR1_FLT4P      (0x02000000)    /*!< Fault 4 polarity */
#define HRTIM_FLTINR1_FLT4SRC    (0x04000000)    /*!< Fault 4 source */
#define HRTIM_FLTINR1_FLT4F      (0x78000000)    /*!< Fault 4 filter */
#define HRTIM_FLTINR1_FLT4F_0    (0x08000000)    /*!< Fault 4 filter bit 0 */
#define HRTIM_FLTINR1_FLT4F_1    (0x10000000)    /*!< Fault 4 filter bit 1 */
#define HRTIM_FLTINR1_FLT4F_2    (0x20000000)    /*!< Fault 4 filter bit 2 */
#define HRTIM_FLTINR1_FLT4F_3    (0x40000000)    /*!< Fault 4 filter bit 3 */
#define HRTIM_FLTINR1_FLT4LCK    (0x80000000)    /*!< Fault 4 lock */

#define HRTIM_FLTINR2_FLT5E      (0x00000001)    /*!< Fault 5 enable */ 
#define HRTIM_FLTINR2_FLT5P      (0x00000002)    /*!< Fault 5 polarity */
#define HRTIM_FLTINR2_FLT5SRC    (0x00000004)    /*!< Fault 5 source */
#define HRTIM_FLTINR2_FLT5F      (0x00000078)    /*!< Fault 5 filter */
#define HRTIM_FLTINR2_FLT5F_0    (0x00000008)    /*!< Fault 5 filter bit 0 */
#define HRTIM_FLTINR2_FLT5F_1    (0x00000010)    /*!< Fault 5 filter bit 1 */
#define HRTIM_FLTINR2_FLT5F_2    (0x00000020)    /*!< Fault 5 filter bit 2 */
#define HRTIM_FLTINR2_FLT5F_3    (0x00000040)    /*!< Fault 5 filter bit 3 */
#define HRTIM_FLTINR2_FLT5LCK    (0x00000080)    /*!< Fault 5 lock */
#define HRTIM_FLTINR2_FLTSD      (0x03000000)    /*!< Fault sampling clock division */
#define HRTIM_FLTINR2_FLTSD_0    (0x01000000)    /*!< Fault sampling clock division bit 0 */
#define HRTIM_FLTINR2_FLTSD_1    (0x02000000)    /*!< Fault sampling clock division bit 1 */

#define HRTIM_BDMUPR_MCR      (0x00000001)    /*!< MCR register update enable */ 
#define HRTIM_BDMUPR_MICR     (0x00000002)    /*!< MICR register update enable */ 
#define HRTIM_BDMUPR_MDIER    (0x00000004)    /*!< MDIER register update enable */ 
#define HRTIM_BDMUPR_MCNT     (0x00000008)    /*!< MCNT register update enable */ 
#define HRTIM_BDMUPR_MPER     (0x00000010)    /*!< MPER register update enable */ 
#define HRTIM_BDMUPR_MREP     (0x00000020)    /*!< MREP register update enable */ 
#define HRTIM_BDMUPR_MCMP1    (0x00000040)    /*!< MCMP1 register update enable */ 
#define HRTIM_BDMUPR_MCMP2    (0x00000080)    /*!< MCMP2 register update enable */ 
#define HRTIM_BDMUPR_MCMP3    (0x00000100)    /*!< MCMP3 register update enable */ 
#define HRTIM_BDMUPR_MCMP4    (0x00000200)    /*!< MPCMP4 register update enable */ 

#define HRTIM_BDTUPR_TIMCR      (0x00000001)    /*!<  TIMCR register update enable */ 
#define HRTIM_BDTUPR_TIMICR     (0x00000002)    /*!<  TIMICR register update enable */ 
#define HRTIM_BDTUPR_TIMDIER    (0x00000004)    /*!<  TIMDIER register update enable */ 
#define HRTIM_BDTUPR_TIMCNT     (0x00000008)    /*!<  TIMCNT register update enable */ 
#define HRTIM_BDTUPR_TIMPER     (0x00000010)    /*!<  TIMPER register update enable */ 
#define HRTIM_BDTUPR_TIMREP     (0x00000020)    /*!<  TIMREP register update enable */ 
#define HRTIM_BDTUPR_TIMCMP1    (0x00000040)    /*!<  TIMCMP1 register update enable */ 
#define HRTIM_BDTUPR_TIMCMP2    (0x00000080)    /*!<  TIMCMP2 register update enable */ 
#define HRTIM_BDTUPR_TIMCMP3    (0x00000100)    /*!<  TIMCMP3 register update enable */ 
#define HRTIM_BDTUPR_TIMCMP4    (0x00000200)    /*!<  TIMCMP4 register update enable */ 
#define HRTIM_BDTUPR_TIMDTR     (0x00000400)    /*!<  TIMDTR register update enable */ 
#define HRTIM_BDTUPR_TIMSET1R   (0x00000800)    /*!<  TIMSET1R register update enable */ 
#define HRTIM_BDTUPR_TIMRST1R   (0x00001000)    /*!<  TIMRST1R register update enable */ 
#define HRTIM_BDTUPR_TIMSET2R   (0x00002000)    /*!<  TIMSET2R register update enable */ 
#define HRTIM_BDTUPR_TIMRST2R   (0x00004000)    /*!<  TIMRST2R register update enable */ 
#define HRTIM_BDTUPR_TIMEEFR1   (0x00008000)    /*!<  TIMEEFR1 register update enable */ 
#define HRTIM_BDTUPR_TIMEEFR2   (0x00010000)    /*!<  TIMEEFR2 register update enable */ 
#define HRTIM_BDTUPR_TIMRSTR    (0x00020000)    /*!<  TIMRSTR register update enable */ 
#define HRTIM_BDTUPR_TIMCHPR    (0x00040000)    /*!<  TIMCHPR register update enable */ 
#define HRTIM_BDTUPR_TIMOUTR    (0x00080000)    /*!<  TIMOUTR register update enable */ 
#define HRTIM_BDTUPR_TIMFLTR    (0x00100000)    /*!<  TIMFLTR register update enable */ 

#define HRTIM_BDMADR_BDMADR      (0xFFFFFFFF)    /*!<  Burst DMA Data register */ 

#define ADC_ISR_ADRD          (0x00000001) /*!< ADC Ready (ADRDY) flag  */
#define ADC_ISR_EOSMP         (0x00000002) /*!< ADC End of Sampling flag */
#define ADC_ISR_EOC           (0x00000004) /*!< ADC End of Regular Conversion flag */
#define ADC_ISR_EOS           (0x00000008) /*!< ADC End of Regular sequence of Conversions flag */
#define ADC_ISR_OVR           (0x00000010) /*!< ADC overrun flag */
#define ADC_ISR_JEOC          (0x00000020) /*!< ADC End of Injected Conversion flag */
#define ADC_ISR_JEOS          (0x00000040) /*!< ADC End of Injected sequence of Conversions flag */
#define ADC_ISR_AWD1          (0x00000080) /*!< ADC Analog watchdog 1 flag */
#define ADC_ISR_AWD2          (0x00000100) /*!< ADC Analog watchdog 2 flag */
#define ADC_ISR_AWD3          (0x00000200) /*!< ADC Analog watchdog 3 flag */
#define ADC_ISR_JQOVF         (0x00000400) /*!< ADC Injected Context Queue Overflow flag */

#define ADC_IER_RDY           (0x00000001) /*!< ADC Ready (ADRDY) interrupt source */
#define ADC_IER_EOSMP         (0x00000002) /*!< ADC End of Sampling interrupt source */
#define ADC_IER_EOC           (0x00000004) /*!< ADC End of Regular Conversion interrupt source */
#define ADC_IER_EOS           (0x00000008) /*!< ADC End of Regular sequence of Conversions interrupt source */
#define ADC_IER_OVR           (0x00000010) /*!< ADC overrun interrupt source */
#define ADC_IER_JEOC          (0x00000020) /*!< ADC End of Injected Conversion interrupt source */
#define ADC_IER_JEOS          (0x00000040) /*!< ADC End of Injected sequence of Conversions interrupt source */
#define ADC_IER_AWD1          (0x00000080) /*!< ADC Analog watchdog 1 interrupt source */
#define ADC_IER_AWD2          (0x00000100) /*!< ADC Analog watchdog 2 interrupt source */
#define ADC_IER_AWD3          (0x00000200) /*!< ADC Analog watchdog 3 interrupt source */
#define ADC_IER_JQOVF         (0x00000400) /*!< ADC Injected Context Queue Overflow interrupt source */

#define ADC_CR_ADEN          (0x00000001) /*!< ADC Enable control */
#define ADC_CR_ADDIS         (0x00000002) /*!< ADC Disable command */
#define ADC_CR_ADSTART       (0x00000004) /*!< ADC Start of Regular conversion */
#define ADC_CR_JADSTART      (0x00000008) /*!< ADC Start of injected conversion */
#define ADC_CR_ADSTP         (0x00000010) /*!< ADC Stop of Regular conversion */
#define ADC_CR_JADSTP        (0x00000020) /*!< ADC Stop of injected conversion */
#define ADC_CR_ADVREGEN      (0x30000000) /*!< ADC Voltage regulator Enable */
#define ADC_CR_ADVREGEN_0    (0x10000000) /*!< ADC ADVREGEN bit 0 */
#define ADC_CR_ADVREGEN_1    (0x20000000) /*!< ADC ADVREGEN bit 1 */
#define ADC_CR_ADCALDIF      (0x40000000) /*!< ADC Differential Mode for calibration */
#define ADC_CR_ADCAL         (0x80000000) /*!< ADC Calibration */

#define ADC_CFGR_DMAEN     (0x00000001) /*!< ADC DMA Enable */
#define ADC_CFGR_DMACFG    (0x00000002) /*!< ADC DMA configuration */

#define ADC_CFGR_RES       (0x00000018) /*!< ADC Data resolution */
#define ADC_CFGR_RES_0     (0x00000008) /*!< ADC RES bit 0 */
#define ADC_CFGR_RES_1     (0x00000010) /*!< ADC RES bit 1 */

