the-nw1-group/acb-modules/acb-common/include/stm/stm32f30x.inc
#define ADC_CFGR_ALIGN     (0x00000020) /*!< ADC Data Alignment */

#define ADC_CFGR_EXTSEL   (0x000003C0) /*!< ADC External trigger selection for regular group */
#define ADC_CFGR_EXTSEL_0 (0x00000040) /*!< ADC EXTSEL bit 0 */
#define ADC_CFGR_EXTSEL_1 (0x00000080) /*!< ADC EXTSEL bit 1 */
#define ADC_CFGR_EXTSEL_2 (0x00000100) /*!< ADC EXTSEL bit 2 */
#define ADC_CFGR_EXTSEL_3 (0x00000200) /*!< ADC EXTSEL bit 3 */

#define ADC_CFGR_EXTEN     (0x00000C00) /*!< ADC External trigger enable and polarity selection for regular channels */
#define ADC_CFGR_EXTEN_0   (0x00000400) /*!< ADC EXTEN bit 0 */
#define ADC_CFGR_EXTEN_1   (0x00000800) /*!< ADC EXTEN bit 1 */

#define ADC_CFGR_OVRMOD    (0x00001000) /*!< ADC overrun mode */
#define ADC_CFGR_CONT      (0x00002000) /*!< ADC Single/continuous conversion mode for regular conversion */
#define ADC_CFGR_AUTDLY    (0x00004000) /*!< ADC Delayed conversion mode */
#define ADC_CFGR_DISCEN    (0x00010000) /*!< ADC Discontinuous mode for regular channels */

#define ADC_CFGR_DISCNUM   (0x000E0000) /*!< ADC Discontinuous mode channel count */
#define ADC_CFGR_DISCNUM_0 (0x00020000) /*!< ADC DISCNUM bit 0 */
#define ADC_CFGR_DISCNUM_1 (0x00040000) /*!< ADC DISCNUM bit 1 */
#define ADC_CFGR_DISCNUM_2 (0x00080000) /*!< ADC DISCNUM bit 2 */

#define ADC_CFGR_JDISCEN   (0x00100000) /*!< ADC Discontinuous mode on injected channels */
#define ADC_CFGR_JQM       (0x00200000) /*!< ADC JSQR Queue mode */
#define ADC_CFGR_AWD1SGL   (0x00400000) /*!< Enable the watchdog 1 on a single channel or on all channels */
#define ADC_CFGR_AWD1EN    (0x00800000) /*!< ADC Analog watchdog 1 enable on regular Channels */
#define ADC_CFGR_JAWD1EN   (0x01000000) /*!< ADC Analog watchdog 1 enable on injected Channels */
#define ADC_CFGR_JAUTO     (0x02000000) /*!< ADC Automatic injected group conversion */

#define ADC_CFGR_AWD1CH    (0x7C000000) /*!< ADC Analog watchdog 1 Channel selection */
#define ADC_CFGR_AWD1CH_0  (0x04000000) /*!< ADC AWD1CH bit 0 */
#define ADC_CFGR_AWD1CH_1  (0x08000000) /*!< ADC AWD1CH bit 1  */
#define ADC_CFGR_AWD1CH_2  (0x10000000) /*!< ADC AWD1CH bit 2  */
#define ADC_CFGR_AWD1CH_3  (0x20000000) /*!< ADC AWD1CH bit 3  */
#define ADC_CFGR_AWD1CH_4  (0x40000000) /*!< ADC AWD1CH bit 4  */

#define ADC_SMPR1_SMP0     (0x00000007) /*!< ADC Channel 0 Sampling time selection  */
#define ADC_SMPR1_SMP0_0   (0x00000001) /*!< ADC SMP0 bit 0 */
#define ADC_SMPR1_SMP0_1   (0x00000002) /*!< ADC SMP0 bit 1 */
#define ADC_SMPR1_SMP0_2   (0x00000004) /*!< ADC SMP0 bit 2 */

#define ADC_SMPR1_SMP1     (0x00000038) /*!< ADC Channel 1 Sampling time selection  */
#define ADC_SMPR1_SMP1_0   (0x00000008) /*!< ADC SMP1 bit 0 */
#define ADC_SMPR1_SMP1_1   (0x00000010) /*!< ADC SMP1 bit 1 */
#define ADC_SMPR1_SMP1_2   (0x00000020) /*!< ADC SMP1 bit 2 */

#define ADC_SMPR1_SMP2     (0x000001C0) /*!< ADC Channel 2 Sampling time selection  */
#define ADC_SMPR1_SMP2_0   (0x00000040) /*!< ADC SMP2 bit 0 */
#define ADC_SMPR1_SMP2_1   (0x00000080) /*!< ADC SMP2 bit 1 */
#define ADC_SMPR1_SMP2_2   (0x00000100) /*!< ADC SMP2 bit 2 */

#define ADC_SMPR1_SMP3     (0x00000E00) /*!< ADC Channel 3 Sampling time selection  */
#define ADC_SMPR1_SMP3_0   (0x00000200) /*!< ADC SMP3 bit 0 */
#define ADC_SMPR1_SMP3_1   (0x00000400) /*!< ADC SMP3 bit 1 */
#define ADC_SMPR1_SMP3_2   (0x00000800) /*!< ADC SMP3 bit 2 */

#define ADC_SMPR1_SMP4     (0x00007000) /*!< ADC Channel 4 Sampling time selection  */
#define ADC_SMPR1_SMP4_0   (0x00001000) /*!< ADC SMP4 bit 0 */
#define ADC_SMPR1_SMP4_1   (0x00002000) /*!< ADC SMP4 bit 1 */
#define ADC_SMPR1_SMP4_2   (0x00004000) /*!< ADC SMP4 bit 2 */

#define ADC_SMPR1_SMP5     (0x00038000) /*!< ADC Channel 5 Sampling time selection  */
#define ADC_SMPR1_SMP5_0   (0x00008000) /*!< ADC SMP5 bit 0 */
#define ADC_SMPR1_SMP5_1   (0x00010000) /*!< ADC SMP5 bit 1 */
#define ADC_SMPR1_SMP5_2   (0x00020000) /*!< ADC SMP5 bit 2 */

#define ADC_SMPR1_SMP6     (0x001C0000) /*!< ADC Channel 6 Sampling time selection  */
#define ADC_SMPR1_SMP6_0   (0x00040000) /*!< ADC SMP6 bit 0 */
#define ADC_SMPR1_SMP6_1   (0x00080000) /*!< ADC SMP6 bit 1 */
#define ADC_SMPR1_SMP6_2   (0x00100000) /*!< ADC SMP6 bit 2 */

#define ADC_SMPR1_SMP7     (0x00E00000) /*!< ADC Channel 7 Sampling time selection  */
#define ADC_SMPR1_SMP7_0   (0x00200000) /*!< ADC SMP7 bit 0 */
#define ADC_SMPR1_SMP7_1   (0x00400000) /*!< ADC SMP7 bit 1 */
#define ADC_SMPR1_SMP7_2   (0x00800000) /*!< ADC SMP7 bit 2 */

#define ADC_SMPR1_SMP8     (0x07000000) /*!< ADC Channel 8 Sampling time selection  */
#define ADC_SMPR1_SMP8_0   (0x01000000) /*!< ADC SMP8 bit 0 */
#define ADC_SMPR1_SMP8_1   (0x02000000) /*!< ADC SMP8 bit 1 */
#define ADC_SMPR1_SMP8_2   (0x04000000) /*!< ADC SMP8 bit 2 */

#define ADC_SMPR1_SMP9     (0x38000000) /*!< ADC Channel 9 Sampling time selection  */
#define ADC_SMPR1_SMP9_0   (0x08000000) /*!< ADC SMP9 bit 0 */
#define ADC_SMPR1_SMP9_1   (0x10000000) /*!< ADC SMP9 bit 1 */
#define ADC_SMPR1_SMP9_2   (0x20000000) /*!< ADC SMP9 bit 2 */

#define ADC_SMPR2_SMP10     (0x00000007) /*!< ADC Channel 10 Sampling time selection  */
#define ADC_SMPR2_SMP10_0   (0x00000001) /*!< ADC SMP10 bit 0 */
#define ADC_SMPR2_SMP10_1   (0x00000002) /*!< ADC SMP10 bit 1 */
#define ADC_SMPR2_SMP10_2   (0x00000004) /*!< ADC SMP10 bit 2 */

#define ADC_SMPR2_SMP11     (0x00000038) /*!< ADC Channel 11 Sampling time selection  */
#define ADC_SMPR2_SMP11_0   (0x00000008) /*!< ADC SMP11 bit 0 */
#define ADC_SMPR2_SMP11_1   (0x00000010) /*!< ADC SMP11 bit 1 */
#define ADC_SMPR2_SMP11_2   (0x00000020) /*!< ADC SMP11 bit 2 */

#define ADC_SMPR2_SMP12     (0x000001C0) /*!< ADC Channel 12 Sampling time selection  */
#define ADC_SMPR2_SMP12_0   (0x00000040) /*!< ADC SMP12 bit 0 */
#define ADC_SMPR2_SMP12_1   (0x00000080) /*!< ADC SMP12 bit 1 */
#define ADC_SMPR2_SMP12_2   (0x00000100) /*!< ADC SMP12 bit 2 */

#define ADC_SMPR2_SMP13     (0x00000E00) /*!< ADC Channel 13 Sampling time selection  */
#define ADC_SMPR2_SMP13_0   (0x00000200) /*!< ADC SMP13 bit 0 */
#define ADC_SMPR2_SMP13_1   (0x00000400) /*!< ADC SMP13 bit 1 */
#define ADC_SMPR2_SMP13_2   (0x00000800) /*!< ADC SMP13 bit 2 */

#define ADC_SMPR2_SMP14     (0x00007000) /*!< ADC Channel 14 Sampling time selection  */
#define ADC_SMPR2_SMP14_0   (0x00001000) /*!< ADC SMP14 bit 0 */
#define ADC_SMPR2_SMP14_1   (0x00002000) /*!< ADC SMP14 bit 1 */
#define ADC_SMPR2_SMP14_2   (0x00004000) /*!< ADC SMP14 bit 2 */

#define ADC_SMPR2_SMP15     (0x00038000) /*!< ADC Channel 15 Sampling time selection  */
#define ADC_SMPR2_SMP15_0   (0x00008000) /*!< ADC SMP15 bit 0 */
#define ADC_SMPR2_SMP15_1   (0x00010000) /*!< ADC SMP15 bit 1 */
#define ADC_SMPR2_SMP15_2   (0x00020000) /*!< ADC SMP15 bit 2 */

#define ADC_SMPR2_SMP16     (0x001C0000) /*!< ADC Channel 16 Sampling time selection  */
#define ADC_SMPR2_SMP16_0   (0x00040000) /*!< ADC SMP16 bit 0 */
#define ADC_SMPR2_SMP16_1   (0x00080000) /*!< ADC SMP16 bit 1 */
#define ADC_SMPR2_SMP16_2   (0x00100000) /*!< ADC SMP16 bit 2 */

