the-nw1-group/acb-modules/acb-common/include/stm/stm32f30x.inc
#define ADC_SMPR2_SMP17     (0x00E00000) /*!< ADC Channel 17 Sampling time selection  */
#define ADC_SMPR2_SMP17_0   (0x00200000) /*!< ADC SMP17 bit 0 */
#define ADC_SMPR2_SMP17_1   (0x00400000) /*!< ADC SMP17 bit 1 */
#define ADC_SMPR2_SMP17_2   (0x00800000) /*!< ADC SMP17 bit 2 */

#define ADC_SMPR2_SMP18     (0x07000000) /*!< ADC Channel 18 Sampling time selection  */
#define ADC_SMPR2_SMP18_0   (0x01000000) /*!< ADC SMP18 bit 0 */
#define ADC_SMPR2_SMP18_1   (0x02000000) /*!< ADC SMP18 bit 1 */
#define ADC_SMPR2_SMP18_2   (0x04000000) /*!< ADC SMP18 bit 2 */

#define ADC_TR1_LT1         (0x00000FFF) /*!< ADC Analog watchdog 1 lower threshold */
#define ADC_TR1_LT1_0       (0x00000001) /*!< ADC LT1 bit 0 */
#define ADC_TR1_LT1_1       (0x00000002) /*!< ADC LT1 bit 1 */
#define ADC_TR1_LT1_2       (0x00000004) /*!< ADC LT1 bit 2 */
#define ADC_TR1_LT1_3       (0x00000008) /*!< ADC LT1 bit 3 */
#define ADC_TR1_LT1_4       (0x00000010) /*!< ADC LT1 bit 4 */
#define ADC_TR1_LT1_5       (0x00000020) /*!< ADC LT1 bit 5 */
#define ADC_TR1_LT1_6       (0x00000040) /*!< ADC LT1 bit 6 */
#define ADC_TR1_LT1_7       (0x00000080) /*!< ADC LT1 bit 7 */
#define ADC_TR1_LT1_8       (0x00000100) /*!< ADC LT1 bit 8 */
#define ADC_TR1_LT1_9       (0x00000200) /*!< ADC LT1 bit 9 */
#define ADC_TR1_LT1_10      (0x00000400) /*!< ADC LT1 bit 10 */
#define ADC_TR1_LT1_11      (0x00000800) /*!< ADC LT1 bit 11 */

#define ADC_TR1_HT1         (0x0FFF0000) /*!< ADC Analog watchdog 1 higher threshold */
#define ADC_TR1_HT1_0       (0x00010000) /*!< ADC HT1 bit 0 */
#define ADC_TR1_HT1_1       (0x00020000) /*!< ADC HT1 bit 1 */
#define ADC_TR1_HT1_2       (0x00040000) /*!< ADC HT1 bit 2 */
#define ADC_TR1_HT1_3       (0x00080000) /*!< ADC HT1 bit 3 */
#define ADC_TR1_HT1_4       (0x00100000) /*!< ADC HT1 bit 4 */
#define ADC_TR1_HT1_5       (0x00200000) /*!< ADC HT1 bit 5 */
#define ADC_TR1_HT1_6       (0x00400000) /*!< ADC HT1 bit 6 */
#define ADC_TR1_HT1_7       (0x00800000) /*!< ADC HT1 bit 7 */
#define ADC_TR1_HT1_8       (0x01000000) /*!< ADC HT1 bit 8 */
#define ADC_TR1_HT1_9       (0x02000000) /*!< ADC HT1 bit 9 */
#define ADC_TR1_HT1_10      (0x04000000) /*!< ADC HT1 bit 10 */
#define ADC_TR1_HT1_11      (0x08000000) /*!< ADC HT1 bit 11 */

#define ADC_TR2_LT2         (0x000000FF) /*!< ADC Analog watchdog 2 lower threshold */
#define ADC_TR2_LT2_0       (0x00000001) /*!< ADC LT2 bit 0 */
#define ADC_TR2_LT2_1       (0x00000002) /*!< ADC LT2 bit 1 */
#define ADC_TR2_LT2_2       (0x00000004) /*!< ADC LT2 bit 2 */
#define ADC_TR2_LT2_3       (0x00000008) /*!< ADC LT2 bit 3 */
#define ADC_TR2_LT2_4       (0x00000010) /*!< ADC LT2 bit 4 */
#define ADC_TR2_LT2_5       (0x00000020) /*!< ADC LT2 bit 5 */
#define ADC_TR2_LT2_6       (0x00000040) /*!< ADC LT2 bit 6 */
#define ADC_TR2_LT2_7       (0x00000080) /*!< ADC LT2 bit 7 */

#define ADC_TR2_HT2         (0x00FF0000) /*!< ADC Analog watchdog 2 higher threshold */
#define ADC_TR2_HT2_0       (0x00010000) /*!< ADC HT2 bit 0 */
#define ADC_TR2_HT2_1       (0x00020000) /*!< ADC HT2 bit 1 */
#define ADC_TR2_HT2_2       (0x00040000) /*!< ADC HT2 bit 2 */
#define ADC_TR2_HT2_3       (0x00080000) /*!< ADC HT2 bit 3 */
#define ADC_TR2_HT2_4       (0x00100000) /*!< ADC HT2 bit 4 */
#define ADC_TR2_HT2_5       (0x00200000) /*!< ADC HT2 bit 5 */
#define ADC_TR2_HT2_6       (0x00400000) /*!< ADC HT2 bit 6 */
#define ADC_TR2_HT2_7       (0x00800000) /*!< ADC HT2 bit 7 */

#define ADC_TR3_LT3         (0x000000FF) /*!< ADC Analog watchdog 3 lower threshold */
#define ADC_TR3_LT3_0       (0x00000001) /*!< ADC LT3 bit 0 */
#define ADC_TR3_LT3_1       (0x00000002) /*!< ADC LT3 bit 1 */
#define ADC_TR3_LT3_2       (0x00000004) /*!< ADC LT3 bit 2 */
#define ADC_TR3_LT3_3       (0x00000008) /*!< ADC LT3 bit 3 */
#define ADC_TR3_LT3_4       (0x00000010) /*!< ADC LT3 bit 4 */
#define ADC_TR3_LT3_5       (0x00000020) /*!< ADC LT3 bit 5 */
#define ADC_TR3_LT3_6       (0x00000040) /*!< ADC LT3 bit 6 */
#define ADC_TR3_LT3_7       (0x00000080) /*!< ADC LT3 bit 7 */

#define ADC_TR3_HT3         (0x00FF0000) /*!< ADC Analog watchdog 3 higher threshold */
#define ADC_TR3_HT3_0       (0x00010000) /*!< ADC HT3 bit 0 */
#define ADC_TR3_HT3_1       (0x00020000) /*!< ADC HT3 bit 1 */
#define ADC_TR3_HT3_2       (0x00040000) /*!< ADC HT3 bit 2 */
#define ADC_TR3_HT3_3       (0x00080000) /*!< ADC HT3 bit 3 */
#define ADC_TR3_HT3_4       (0x00100000) /*!< ADC HT3 bit 4 */
#define ADC_TR3_HT3_5       (0x00200000) /*!< ADC HT3 bit 5 */
#define ADC_TR3_HT3_6       (0x00400000) /*!< ADC HT3 bit 6 */
#define ADC_TR3_HT3_7       (0x00800000) /*!< ADC HT3 bit 7 */

#define ADC_SQR1_L          (0x0000000F) /*!< ADC regular channel sequence length */
#define ADC_SQR1_L_0        (0x00000001) /*!< ADC L bit 0 */
#define ADC_SQR1_L_1        (0x00000002) /*!< ADC L bit 1 */
#define ADC_SQR1_L_2        (0x00000004) /*!< ADC L bit 2 */
#define ADC_SQR1_L_3        (0x00000008) /*!< ADC L bit 3 */

#define ADC_SQR1_SQ1        (0x000007C0) /*!< ADC 1st conversion in regular sequence */
#define ADC_SQR1_SQ1_0      (0x00000040) /*!< ADC SQ1 bit 0 */
#define ADC_SQR1_SQ1_1      (0x00000080) /*!< ADC SQ1 bit 1 */
#define ADC_SQR1_SQ1_2      (0x00000100) /*!< ADC SQ1 bit 2 */
#define ADC_SQR1_SQ1_3      (0x00000200) /*!< ADC SQ1 bit 3 */
#define ADC_SQR1_SQ1_4      (0x00000400) /*!< ADC SQ1 bit 4 */

#define ADC_SQR1_SQ2        (0x0001F000) /*!< ADC 2nd conversion in regular sequence */
#define ADC_SQR1_SQ2_0      (0x00001000) /*!< ADC SQ2 bit 0 */
#define ADC_SQR1_SQ2_1      (0x00002000) /*!< ADC SQ2 bit 1 */
#define ADC_SQR1_SQ2_2      (0x00004000) /*!< ADC SQ2 bit 2 */
#define ADC_SQR1_SQ2_3      (0x00008000) /*!< ADC SQ2 bit 3 */
#define ADC_SQR1_SQ2_4      (0x00010000) /*!< ADC SQ2 bit 4 */

#define ADC_SQR1_SQ3        (0x007C0000) /*!< ADC 3rd conversion in regular sequence */
#define ADC_SQR1_SQ3_0      (0x00040000) /*!< ADC SQ3 bit 0 */
#define ADC_SQR1_SQ3_1      (0x00080000) /*!< ADC SQ3 bit 1 */
#define ADC_SQR1_SQ3_2      (0x00100000) /*!< ADC SQ3 bit 2 */
#define ADC_SQR1_SQ3_3      (0x00200000) /*!< ADC SQ3 bit 3 */
#define ADC_SQR1_SQ3_4      (0x00400000) /*!< ADC SQ3 bit 4 */

