the-nw1-group/acb-modules/acb-common/include/stm/stm32f30x.inc
#define ADC_SQR1_SQ4        (0x1F000000) /*!< ADC 4th conversion in regular sequence */
#define ADC_SQR1_SQ4_0      (0x01000000) /*!< ADC SQ4 bit 0 */
#define ADC_SQR1_SQ4_1      (0x02000000) /*!< ADC SQ4 bit 1 */
#define ADC_SQR1_SQ4_2      (0x04000000) /*!< ADC SQ4 bit 2 */
#define ADC_SQR1_SQ4_3      (0x08000000) /*!< ADC SQ4 bit 3 */
#define ADC_SQR1_SQ4_4      (0x10000000) /*!< ADC SQ4 bit 4 */

#define ADC_SQR2_SQ5        (0x0000001F) /*!< ADC 5th conversion in regular sequence */
#define ADC_SQR2_SQ5_0      (0x00000001) /*!< ADC SQ5 bit 0 */
#define ADC_SQR2_SQ5_1      (0x00000002) /*!< ADC SQ5 bit 1 */
#define ADC_SQR2_SQ5_2      (0x00000004) /*!< ADC SQ5 bit 2 */
#define ADC_SQR2_SQ5_3      (0x00000008) /*!< ADC SQ5 bit 3 */
#define ADC_SQR2_SQ5_4      (0x00000010) /*!< ADC SQ5 bit 4 */

#define ADC_SQR2_SQ6        (0x000007C0) /*!< ADC 6th conversion in regular sequence */
#define ADC_SQR2_SQ6_0      (0x00000040) /*!< ADC SQ6 bit 0 */
#define ADC_SQR2_SQ6_1      (0x00000080) /*!< ADC SQ6 bit 1 */
#define ADC_SQR2_SQ6_2      (0x00000100) /*!< ADC SQ6 bit 2 */
#define ADC_SQR2_SQ6_3      (0x00000200) /*!< ADC SQ6 bit 3 */
#define ADC_SQR2_SQ6_4      (0x00000400) /*!< ADC SQ6 bit 4 */

#define ADC_SQR2_SQ7        (0x0001F000) /*!< ADC 7th conversion in regular sequence */
#define ADC_SQR2_SQ7_0      (0x00001000) /*!< ADC SQ7 bit 0 */
#define ADC_SQR2_SQ7_1      (0x00002000) /*!< ADC SQ7 bit 1 */
#define ADC_SQR2_SQ7_2      (0x00004000) /*!< ADC SQ7 bit 2 */
#define ADC_SQR2_SQ7_3      (0x00008000) /*!< ADC SQ7 bit 3 */
#define ADC_SQR2_SQ7_4      (0x00010000) /*!< ADC SQ7 bit 4 */

#define ADC_SQR2_SQ8        (0x007C0000) /*!< ADC 8th conversion in regular sequence */
#define ADC_SQR2_SQ8_0      (0x00040000) /*!< ADC SQ8 bit 0 */
#define ADC_SQR2_SQ8_1      (0x00080000) /*!< ADC SQ8 bit 1 */
#define ADC_SQR2_SQ8_2      (0x00100000) /*!< ADC SQ8 bit 2 */
#define ADC_SQR2_SQ8_3      (0x00200000) /*!< ADC SQ8 bit 3 */
#define ADC_SQR2_SQ8_4      (0x00400000) /*!< ADC SQ8 bit 4 */

#define ADC_SQR2_SQ9        (0x1F000000) /*!< ADC 9th conversion in regular sequence */
#define ADC_SQR2_SQ9_0      (0x01000000) /*!< ADC SQ9 bit 0 */
#define ADC_SQR2_SQ9_1      (0x02000000) /*!< ADC SQ9 bit 1 */
#define ADC_SQR2_SQ9_2      (0x04000000) /*!< ADC SQ9 bit 2 */
#define ADC_SQR2_SQ9_3      (0x08000000) /*!< ADC SQ9 bit 3 */
#define ADC_SQR2_SQ9_4      (0x10000000) /*!< ADC SQ9 bit 4 */

#define ADC_SQR3_SQ10       (0x0000001F) /*!< ADC 10th conversion in regular sequence */
#define ADC_SQR3_SQ10_0     (0x00000001) /*!< ADC SQ10 bit 0 */
#define ADC_SQR3_SQ10_1     (0x00000002) /*!< ADC SQ10 bit 1 */
#define ADC_SQR3_SQ10_2     (0x00000004) /*!< ADC SQ10 bit 2 */
#define ADC_SQR3_SQ10_3     (0x00000008) /*!< ADC SQ10 bit 3 */
#define ADC_SQR3_SQ10_4     (0x00000010) /*!< ADC SQ10 bit 4 */

#define ADC_SQR3_SQ11       (0x000007C0) /*!< ADC 11th conversion in regular sequence */
#define ADC_SQR3_SQ11_0     (0x00000040) /*!< ADC SQ11 bit 0 */
#define ADC_SQR3_SQ11_1     (0x00000080) /*!< ADC SQ11 bit 1 */
#define ADC_SQR3_SQ11_2     (0x00000100) /*!< ADC SQ11 bit 2 */
#define ADC_SQR3_SQ11_3     (0x00000200) /*!< ADC SQ11 bit 3 */
#define ADC_SQR3_SQ11_4     (0x00000400) /*!< ADC SQ11 bit 4 */

#define ADC_SQR3_SQ12       (0x0001F000) /*!< ADC 12th conversion in regular sequence */
#define ADC_SQR3_SQ12_0     (0x00001000) /*!< ADC SQ12 bit 0 */
#define ADC_SQR3_SQ12_1     (0x00002000) /*!< ADC SQ12 bit 1 */
#define ADC_SQR3_SQ12_2     (0x00004000) /*!< ADC SQ12 bit 2 */
#define ADC_SQR3_SQ12_3     (0x00008000) /*!< ADC SQ12 bit 3 */
#define ADC_SQR3_SQ12_4     (0x00010000) /*!< ADC SQ12 bit 4 */

#define ADC_SQR3_SQ13       (0x007C0000) /*!< ADC 13th conversion in regular sequence */
#define ADC_SQR3_SQ13_0     (0x00040000) /*!< ADC SQ13 bit 0 */
#define ADC_SQR3_SQ13_1     (0x00080000) /*!< ADC SQ13 bit 1 */
#define ADC_SQR3_SQ13_2     (0x00100000) /*!< ADC SQ13 bit 2 */
#define ADC_SQR3_SQ13_3     (0x00200000) /*!< ADC SQ13 bit 3 */
#define ADC_SQR3_SQ13_4     (0x00400000) /*!< ADC SQ13 bit 4 */

#define ADC_SQR3_SQ14       (0x1F000000) /*!< ADC 14th conversion in regular sequence */
#define ADC_SQR3_SQ14_0     (0x01000000) /*!< ADC SQ14 bit 0 */
#define ADC_SQR3_SQ14_1     (0x02000000) /*!< ADC SQ14 bit 1 */
#define ADC_SQR3_SQ14_2     (0x04000000) /*!< ADC SQ14 bit 2 */
#define ADC_SQR3_SQ14_3     (0x08000000) /*!< ADC SQ14 bit 3 */
#define ADC_SQR3_SQ14_4     (0x10000000) /*!< ADC SQ14 bit 4 */

#define ADC_SQR4_SQ15       (0x0000001F) /*!< ADC 15th conversion in regular sequence */
#define ADC_SQR4_SQ15_0     (0x00000001) /*!< ADC SQ15 bit 0 */
#define ADC_SQR4_SQ15_1     (0x00000002) /*!< ADC SQ15 bit 1 */
#define ADC_SQR4_SQ15_2     (0x00000004) /*!< ADC SQ15 bit 2 */
#define ADC_SQR4_SQ15_3     (0x00000008) /*!< ADC SQ15 bit 3 */
#define ADC_SQR4_SQ15_4     (0x00000010) /*!< ADC SQ105 bit 4 */

#define ADC_SQR4_SQ16       (0x000007C0) /*!< ADC 16th conversion in regular sequence */
#define ADC_SQR4_SQ16_0     (0x00000040) /*!< ADC SQ16 bit 0 */
#define ADC_SQR4_SQ16_1     (0x00000080) /*!< ADC SQ16 bit 1 */
#define ADC_SQR4_SQ16_2     (0x00000100) /*!< ADC SQ16 bit 2 */
#define ADC_SQR4_SQ16_3     (0x00000200) /*!< ADC SQ16 bit 3 */
#define ADC_SQR4_SQ16_4     (0x00000400) /*!< ADC SQ16 bit 4 */

#define ADC_SQR3_SQ15       ADC_SQR4_SQ15 /*!< ADC 15th conversion in regular sequence */
#define ADC_SQR3_SQ15_0     ADC_SQR4_SQ15_0 /*!< ADC SQ15 bit 0 */
#define ADC_SQR3_SQ15_1     ADC_SQR4_SQ15_1 /*!< ADC SQ15 bit 1 */
#define ADC_SQR3_SQ15_2     ADC_SQR4_SQ15_2 /*!< ADC SQ15 bit 2 */
#define ADC_SQR3_SQ15_3     ADC_SQR4_SQ15_3 /*!< ADC SQ15 bit 3 */
#define ADC_SQR3_SQ15_4     ADC_SQR4_SQ15_4 /*!< ADC SQ105 bit 4 */

#define ADC_SQR3_SQ16       ADC_SQR4_SQ16 /*!< ADC 16th conversion in regular sequence */
#define ADC_SQR3_SQ16_0     ADC_SQR4_SQ16_0 /*!< ADC SQ16 bit 0 */
#define ADC_SQR3_SQ16_1     ADC_SQR4_SQ16_1 /*!< ADC SQ16 bit 1 */
#define ADC_SQR3_SQ16_2     ADC_SQR4_SQ16_2 /*!< ADC SQ16 bit 2 */
#define ADC_SQR3_SQ16_3     ADC_SQR4_SQ16_3 /*!< ADC SQ16 bit 3 */
#define ADC_SQR3_SQ16_4     ADC_SQR4_SQ16_4 /*!< ADC SQ16 bit 4 */
#define ADC_DR_RDATA        (0x0000FFFF) /*!< ADC regular Data converted */
#define ADC_DR_RDATA_0      (0x00000001) /*!< ADC RDATA bit 0 */
#define ADC_DR_RDATA_1      (0x00000002) /*!< ADC RDATA bit 1 */
#define ADC_DR_RDATA_2      (0x00000004) /*!< ADC RDATA bit 2 */
#define ADC_DR_RDATA_3      (0x00000008) /*!< ADC RDATA bit 3 */
#define ADC_DR_RDATA_4      (0x00000010) /*!< ADC RDATA bit 4 */
#define ADC_DR_RDATA_5      (0x00000020) /*!< ADC RDATA bit 5 */
#define ADC_DR_RDATA_6      (0x00000040) /*!< ADC RDATA bit 6 */
#define ADC_DR_RDATA_7      (0x00000080) /*!< ADC RDATA bit 7 */
#define ADC_DR_RDATA_8      (0x00000100) /*!< ADC RDATA bit 8 */
#define ADC_DR_RDATA_9      (0x00000200) /*!< ADC RDATA bit 9 */
#define ADC_DR_RDATA_10     (0x00000400) /*!< ADC RDATA bit 10 */
#define ADC_DR_RDATA_11     (0x00000800) /*!< ADC RDATA bit 11 */
#define ADC_DR_RDATA_12     (0x00001000) /*!< ADC RDATA bit 12 */
#define ADC_DR_RDATA_13     (0x00002000) /*!< ADC RDATA bit 13 */
#define ADC_DR_RDATA_14     (0x00004000) /*!< ADC RDATA bit 14 */
#define ADC_DR_RDATA_15     (0x00008000) /*!< ADC RDATA bit 15 */

