the-nw1-group/acb-modules/acb-common/include/stm/stm32f30x.inc
#define ADC_OFR3_OFFSET3_EN (0x80000000) /*!< ADC offset 3 enable */

#define ADC_OFR4_OFFSET4    (0x00000FFF) /*!< ADC data offset 4 for channel programmed into bits OFFSET4_CH[4:0] */
#define ADC_OFR4_OFFSET4_0  (0x00000001) /*!< ADC OFFSET4 bit 0 */
#define ADC_OFR4_OFFSET4_1  (0x00000002) /*!< ADC OFFSET4 bit 1 */
#define ADC_OFR4_OFFSET4_2  (0x00000004) /*!< ADC OFFSET4 bit 2 */
#define ADC_OFR4_OFFSET4_3  (0x00000008) /*!< ADC OFFSET4 bit 3 */
#define ADC_OFR4_OFFSET4_4  (0x00000010) /*!< ADC OFFSET4 bit 4 */
#define ADC_OFR4_OFFSET4_5  (0x00000020) /*!< ADC OFFSET4 bit 5 */
#define ADC_OFR4_OFFSET4_6  (0x00000040) /*!< ADC OFFSET4 bit 6 */
#define ADC_OFR4_OFFSET4_7  (0x00000080) /*!< ADC OFFSET4 bit 7 */
#define ADC_OFR4_OFFSET4_8  (0x00000100) /*!< ADC OFFSET4 bit 8 */
#define ADC_OFR4_OFFSET4_9  (0x00000200) /*!< ADC OFFSET4 bit 9 */
#define ADC_OFR4_OFFSET4_10 (0x00000400) /*!< ADC OFFSET4 bit 10 */
#define ADC_OFR4_OFFSET4_11 (0x00000800) /*!< ADC OFFSET4 bit 11 */

#define ADC_OFR4_OFFSET4_CH     (0x7C000000) /*!< ADC Channel selection for the data offset 4 */
#define ADC_OFR4_OFFSET4_CH_0  (0x04000000) /*!< ADC OFFSET4_CH bit 0 */
#define ADC_OFR4_OFFSET4_CH_1  (0x08000000) /*!< ADC OFFSET4_CH bit 1 */
#define ADC_OFR4_OFFSET4_CH_2  (0x10000000) /*!< ADC OFFSET4_CH bit 2 */
#define ADC_OFR4_OFFSET4_CH_3  (0x20000000) /*!< ADC OFFSET4_CH bit 3 */
#define ADC_OFR4_OFFSET4_CH_4  (0x40000000) /*!< ADC OFFSET4_CH bit 4 */

#define ADC_OFR4_OFFSET4_EN (0x80000000) /*!< ADC offset 4 enable */

#define ADC_JDR1_JDATA      (0x0000FFFF) /*!< ADC Injected DATA */
#define ADC_JDR1_JDATA_0    (0x00000001) /*!< ADC JDATA bit 0 */
#define ADC_JDR1_JDATA_1    (0x00000002) /*!< ADC JDATA bit 1 */
#define ADC_JDR1_JDATA_2    (0x00000004) /*!< ADC JDATA bit 2 */
#define ADC_JDR1_JDATA_3    (0x00000008) /*!< ADC JDATA bit 3 */
#define ADC_JDR1_JDATA_4    (0x00000010) /*!< ADC JDATA bit 4 */
#define ADC_JDR1_JDATA_5    (0x00000020) /*!< ADC JDATA bit 5 */
#define ADC_JDR1_JDATA_6    (0x00000040) /*!< ADC JDATA bit 6 */
#define ADC_JDR1_JDATA_7    (0x00000080) /*!< ADC JDATA bit 7 */
#define ADC_JDR1_JDATA_8    (0x00000100) /*!< ADC JDATA bit 8 */
#define ADC_JDR1_JDATA_9    (0x00000200) /*!< ADC JDATA bit 9 */
#define ADC_JDR1_JDATA_10   (0x00000400) /*!< ADC JDATA bit 10 */
#define ADC_JDR1_JDATA_11   (0x00000800) /*!< ADC JDATA bit 11 */
#define ADC_JDR1_JDATA_12   (0x00001000) /*!< ADC JDATA bit 12 */
#define ADC_JDR1_JDATA_13   (0x00002000) /*!< ADC JDATA bit 13 */
#define ADC_JDR1_JDATA_14   (0x00004000) /*!< ADC JDATA bit 14 */
#define ADC_JDR1_JDATA_15   (0x00008000) /*!< ADC JDATA bit 15 */

#define ADC_JDR2_JDATA      (0x0000FFFF) /*!< ADC Injected DATA */
#define ADC_JDR2_JDATA_0    (0x00000001) /*!< ADC JDATA bit 0 */
#define ADC_JDR2_JDATA_1    (0x00000002) /*!< ADC JDATA bit 1 */
#define ADC_JDR2_JDATA_2    (0x00000004) /*!< ADC JDATA bit 2 */
#define ADC_JDR2_JDATA_3    (0x00000008) /*!< ADC JDATA bit 3 */
#define ADC_JDR2_JDATA_4    (0x00000010) /*!< ADC JDATA bit 4 */
#define ADC_JDR2_JDATA_5    (0x00000020) /*!< ADC JDATA bit 5 */
#define ADC_JDR2_JDATA_6    (0x00000040) /*!< ADC JDATA bit 6 */
#define ADC_JDR2_JDATA_7    (0x00000080) /*!< ADC JDATA bit 7 */
#define ADC_JDR2_JDATA_8    (0x00000100) /*!< ADC JDATA bit 8 */
#define ADC_JDR2_JDATA_9    (0x00000200) /*!< ADC JDATA bit 9 */
#define ADC_JDR2_JDATA_10   (0x00000400) /*!< ADC JDATA bit 10 */
#define ADC_JDR2_JDATA_11   (0x00000800) /*!< ADC JDATA bit 11 */
#define ADC_JDR2_JDATA_12   (0x00001000) /*!< ADC JDATA bit 12 */
#define ADC_JDR2_JDATA_13   (0x00002000) /*!< ADC JDATA bit 13 */
#define ADC_JDR2_JDATA_14   (0x00004000) /*!< ADC JDATA bit 14 */
#define ADC_JDR2_JDATA_15   (0x00008000) /*!< ADC JDATA bit 15 */

#define ADC_JDR3_JDATA      (0x0000FFFF) /*!< ADC Injected DATA */
#define ADC_JDR3_JDATA_0    (0x00000001) /*!< ADC JDATA bit 0 */
#define ADC_JDR3_JDATA_1    (0x00000002) /*!< ADC JDATA bit 1 */
#define ADC_JDR3_JDATA_2    (0x00000004) /*!< ADC JDATA bit 2 */
#define ADC_JDR3_JDATA_3    (0x00000008) /*!< ADC JDATA bit 3 */
#define ADC_JDR3_JDATA_4    (0x00000010) /*!< ADC JDATA bit 4 */
#define ADC_JDR3_JDATA_5    (0x00000020) /*!< ADC JDATA bit 5 */
#define ADC_JDR3_JDATA_6    (0x00000040) /*!< ADC JDATA bit 6 */
#define ADC_JDR3_JDATA_7    (0x00000080) /*!< ADC JDATA bit 7 */
#define ADC_JDR3_JDATA_8    (0x00000100) /*!< ADC JDATA bit 8 */
#define ADC_JDR3_JDATA_9    (0x00000200) /*!< ADC JDATA bit 9 */
#define ADC_JDR3_JDATA_10   (0x00000400) /*!< ADC JDATA bit 10 */
#define ADC_JDR3_JDATA_11   (0x00000800) /*!< ADC JDATA bit 11 */
#define ADC_JDR3_JDATA_12   (0x00001000) /*!< ADC JDATA bit 12 */
#define ADC_JDR3_JDATA_13   (0x00002000) /*!< ADC JDATA bit 13 */
#define ADC_JDR3_JDATA_14   (0x00004000) /*!< ADC JDATA bit 14 */
#define ADC_JDR3_JDATA_15   (0x00008000) /*!< ADC JDATA bit 15 */

#define ADC_JDR4_JDATA      (0x0000FFFF) /*!< ADC Injected DATA */
#define ADC_JDR4_JDATA_0    (0x00000001) /*!< ADC JDATA bit 0 */
#define ADC_JDR4_JDATA_1    (0x00000002) /*!< ADC JDATA bit 1 */
#define ADC_JDR4_JDATA_2    (0x00000004) /*!< ADC JDATA bit 2 */
#define ADC_JDR4_JDATA_3    (0x00000008) /*!< ADC JDATA bit 3 */
#define ADC_JDR4_JDATA_4    (0x00000010) /*!< ADC JDATA bit 4 */
#define ADC_JDR4_JDATA_5    (0x00000020) /*!< ADC JDATA bit 5 */
#define ADC_JDR4_JDATA_6    (0x00000040) /*!< ADC JDATA bit 6 */
#define ADC_JDR4_JDATA_7    (0x00000080) /*!< ADC JDATA bit 7 */
#define ADC_JDR4_JDATA_8    (0x00000100) /*!< ADC JDATA bit 8 */
#define ADC_JDR4_JDATA_9    (0x00000200) /*!< ADC JDATA bit 9 */
#define ADC_JDR4_JDATA_10   (0x00000400) /*!< ADC JDATA bit 10 */
#define ADC_JDR4_JDATA_11   (0x00000800) /*!< ADC JDATA bit 11 */
#define ADC_JDR4_JDATA_12   (0x00001000) /*!< ADC JDATA bit 12 */
#define ADC_JDR4_JDATA_13   (0x00002000) /*!< ADC JDATA bit 13 */
#define ADC_JDR4_JDATA_14   (0x00004000) /*!< ADC JDATA bit 14 */
#define ADC_JDR4_JDATA_15   (0x00008000) /*!< ADC JDATA bit 15 */

#define ADC_AWD2CR_AWD2CH    (0x0007FFFE) /*!< ADC Analog watchdog 2 channel selection */
#define ADC_AWD2CR_AWD2CH_0  (0x00000002) /*!< ADC AWD2CH bit 0 */
#define ADC_AWD2CR_AWD2CH_1  (0x00000004) /*!< ADC AWD2CH bit 1 */
#define ADC_AWD2CR_AWD2CH_2  (0x00000008) /*!< ADC AWD2CH bit 2 */
#define ADC_AWD2CR_AWD2CH_3  (0x00000010) /*!< ADC AWD2CH bit 3 */
#define ADC_AWD2CR_AWD2CH_4  (0x00000020) /*!< ADC AWD2CH bit 4 */
#define ADC_AWD2CR_AWD2CH_5  (0x00000040) /*!< ADC AWD2CH bit 5 */
#define ADC_AWD2CR_AWD2CH_6  (0x00000080) /*!< ADC AWD2CH bit 6 */
#define ADC_AWD2CR_AWD2CH_7  (0x00000100) /*!< ADC AWD2CH bit 7 */
#define ADC_AWD2CR_AWD2CH_8  (0x00000200) /*!< ADC AWD2CH bit 8 */
#define ADC_AWD2CR_AWD2CH_9  (0x00000400) /*!< ADC AWD2CH bit 9 */
#define ADC_AWD2CR_AWD2CH_10 (0x00000800) /*!< ADC AWD2CH bit 10 */
#define ADC_AWD2CR_AWD2CH_11 (0x00001000) /*!< ADC AWD2CH bit 11 */
#define ADC_AWD2CR_AWD2CH_12 (0x00002000) /*!< ADC AWD2CH bit 12 */
#define ADC_AWD2CR_AWD2CH_13 (0x00004000) /*!< ADC AWD2CH bit 13 */
#define ADC_AWD2CR_AWD2CH_14 (0x00008000) /*!< ADC AWD2CH bit 14 */
#define ADC_AWD2CR_AWD2CH_15 (0x00010000) /*!< ADC AWD2CH bit 15 */
#define ADC_AWD2CR_AWD2CH_16 (0x00020000) /*!< ADC AWD2CH bit 16 */
#define ADC_AWD2CR_AWD2CH_17 (0x00030000) /*!< ADC AWD2CH bit 17 */

#define ADC_AWD3CR_AWD3CH    (0x0007FFFE) /*!< ADC Analog watchdog 2 channel selection */
#define ADC_AWD3CR_AWD3CH_0  (0x00000002) /*!< ADC AWD3CH bit 0 */
#define ADC_AWD3CR_AWD3CH_1  (0x00000004) /*!< ADC AWD3CH bit 1 */
#define ADC_AWD3CR_AWD3CH_2  (0x00000008) /*!< ADC AWD3CH bit 2 */
#define ADC_AWD3CR_AWD3CH_3  (0x00000010) /*!< ADC AWD3CH bit 3 */
#define ADC_AWD3CR_AWD3CH_4  (0x00000020) /*!< ADC AWD3CH bit 4 */
#define ADC_AWD3CR_AWD3CH_5  (0x00000040) /*!< ADC AWD3CH bit 5 */
#define ADC_AWD3CR_AWD3CH_6  (0x00000080) /*!< ADC AWD3CH bit 6 */
#define ADC_AWD3CR_AWD3CH_7  (0x00000100) /*!< ADC AWD3CH bit 7 */
#define ADC_AWD3CR_AWD3CH_8  (0x00000200) /*!< ADC AWD3CH bit 8 */
#define ADC_AWD3CR_AWD3CH_9  (0x00000400) /*!< ADC AWD3CH bit 9 */
#define ADC_AWD3CR_AWD3CH_10 (0x00000800) /*!< ADC AWD3CH bit 10 */
#define ADC_AWD3CR_AWD3CH_11 (0x00001000) /*!< ADC AWD3CH bit 11 */
#define ADC_AWD3CR_AWD3CH_12 (0x00002000) /*!< ADC AWD3CH bit 12 */
#define ADC_AWD3CR_AWD3CH_13 (0x00004000) /*!< ADC AWD3CH bit 13 */
#define ADC_AWD3CR_AWD3CH_14 (0x00008000) /*!< ADC AWD3CH bit 14 */
#define ADC_AWD3CR_AWD3CH_15 (0x00010000) /*!< ADC AWD3CH bit 15 */
#define ADC_AWD3CR_AWD3CH_16 (0x00020000) /*!< ADC AWD3CH bit 16 */
#define ADC_AWD3CR_AWD3CH_17 (0x00030000) /*!< ADC AWD3CH bit 17 */

#define ADC_DIFSEL_DIFSEL    (0x0007FFFE) /*!< ADC differential modes for channels 1 to 18 */
#define ADC_DIFSEL_DIFSEL_0  (0x00000002) /*!< ADC DIFSEL bit 0 */
#define ADC_DIFSEL_DIFSEL_1  (0x00000004) /*!< ADC DIFSEL bit 1 */
#define ADC_DIFSEL_DIFSEL_2  (0x00000008) /*!< ADC DIFSEL bit 2 */
#define ADC_DIFSEL_DIFSEL_3  (0x00000010) /*!< ADC DIFSEL bit 3 */
#define ADC_DIFSEL_DIFSEL_4  (0x00000020) /*!< ADC DIFSEL bit 4 */
#define ADC_DIFSEL_DIFSEL_5  (0x00000040) /*!< ADC DIFSEL bit 5 */
#define ADC_DIFSEL_DIFSEL_6  (0x00000080) /*!< ADC DIFSEL bit 6 */
#define ADC_DIFSEL_DIFSEL_7  (0x00000100) /*!< ADC DIFSEL bit 7 */
#define ADC_DIFSEL_DIFSEL_8  (0x00000200) /*!< ADC DIFSEL bit 8 */
#define ADC_DIFSEL_DIFSEL_9  (0x00000400) /*!< ADC DIFSEL bit 9 */
#define ADC_DIFSEL_DIFSEL_10 (0x00000800) /*!< ADC DIFSEL bit 10 */
#define ADC_DIFSEL_DIFSEL_11 (0x00001000) /*!< ADC DIFSEL bit 11 */
#define ADC_DIFSEL_DIFSEL_12 (0x00002000) /*!< ADC DIFSEL bit 12 */
#define ADC_DIFSEL_DIFSEL_13 (0x00004000) /*!< ADC DIFSEL bit 13 */
#define ADC_DIFSEL_DIFSEL_14 (0x00008000) /*!< ADC DIFSEL bit 14 */
#define ADC_DIFSEL_DIFSEL_15 (0x00010000) /*!< ADC DIFSEL bit 15 */
#define ADC_DIFSEL_DIFSEL_16 (0x00020000) /*!< ADC DIFSEL bit 16 */
#define ADC_DIFSEL_DIFSEL_17 (0x00030000) /*!< ADC DIFSEL bit 17 */

#define ADC_CALFACT_CALFACT_S   (0x0000007F) /*!< ADC calibration factors in single-ended mode */
#define ADC_CALFACT_CALFACT_S_0 (0x00000001) /*!< ADC CALFACT_S bit 0 */
#define ADC_CALFACT_CALFACT_S_1 (0x00000002) /*!< ADC CALFACT_S bit 1 */
#define ADC_CALFACT_CALFACT_S_2 (0x00000004) /*!< ADC CALFACT_S bit 2 */
#define ADC_CALFACT_CALFACT_S_3 (0x00000008) /*!< ADC CALFACT_S bit 3 */
#define ADC_CALFACT_CALFACT_S_4 (0x00000010) /*!< ADC CALFACT_S bit 4 */
#define ADC_CALFACT_CALFACT_S_5 (0x00000020) /*!< ADC CALFACT_S bit 5 */
#define ADC_CALFACT_CALFACT_S_6 (0x00000040) /*!< ADC CALFACT_S bit 6 */
#define ADC_CALFACT_CALFACT_D   (0x007F0000) /*!< ADC calibration factors in differential mode */
#define ADC_CALFACT_CALFACT_D_0 (0x00010000) /*!< ADC CALFACT_D bit 0 */
#define ADC_CALFACT_CALFACT_D_1 (0x00020000) /*!< ADC CALFACT_D bit 1 */
#define ADC_CALFACT_CALFACT_D_2 (0x00040000) /*!< ADC CALFACT_D bit 2 */
#define ADC_CALFACT_CALFACT_D_3 (0x00080000) /*!< ADC CALFACT_D bit 3 */
#define ADC_CALFACT_CALFACT_D_4 (0x00100000) /*!< ADC CALFACT_D bit 4 */
#define ADC_CALFACT_CALFACT_D_5 (0x00200000) /*!< ADC CALFACT_D bit 5 */
#define ADC_CALFACT_CALFACT_D_6 (0x00400000) /*!< ADC CALFACT_D bit 6 */

#define ADC12_CSR_ADRDY_MST         (0x00000001) /*!< Master ADC ready */
#define ADC12_CSR_ADRDY_EOSMP_MST   (0x00000002) /*!< End of sampling phase flag of the master ADC */
#define ADC12_CSR_ADRDY_EOC_MST     (0x00000004) /*!< End of regular conversion of the master ADC */
#define ADC12_CSR_ADRDY_EOS_MST     (0x00000008) /*!< End of regular sequence flag of the master ADC */
#define ADC12_CSR_ADRDY_OVR_MST     (0x00000010) /*!< Overrun flag of the master ADC */
#define ADC12_CSR_ADRDY_JEOC_MST    (0x00000020) /*!< End of injected conversion of the master ADC */
#define ADC12_CSR_ADRDY_JEOS_MST    (0x00000040) /*!< End of injected sequence flag of the master ADC */
#define ADC12_CSR_AWD1_MST          (0x00000080) /*!< Analog watchdog 1 flag of the master ADC */
#define ADC12_CSR_AWD2_MST          (0x00000100) /*!< Analog watchdog 2 flag of the master ADC */
#define ADC12_CSR_AWD3_MST          (0x00000200) /*!< Analog watchdog 3 flag of the master ADC */
#define ADC12_CSR_JQOVF_MST         (0x00000400) /*!< Injected context queue overflow flag of the master ADC */
#define ADC12_CSR_ADRDY_SLV         (0x00010000) /*!< Slave ADC ready */
#define ADC12_CSR_ADRDY_EOSMP_SLV   (0x00020000) /*!< End of sampling phase flag of the slave ADC */
#define ADC12_CSR_ADRDY_EOC_SLV     (0x00040000) /*!< End of regular conversion of the slave ADC */
#define ADC12_CSR_ADRDY_EOS_SLV     (0x00080000) /*!< End of regular sequence flag of the slave ADC */
#define ADC12_CSR_ADRDY_OVR_SLV     (0x00100000) /*!< Overrun flag of the slave ADC */
#define ADC12_CSR_ADRDY_JEOC_SLV    (0x00200000) /*!< End of injected conversion of the slave ADC */
#define ADC12_CSR_ADRDY_JEOS_SLV    (0x00400000) /*!< End of injected sequence flag of the slave ADC */
#define ADC12_CSR_AWD1_SLV          (0x00800000) /*!< Analog watchdog 1 flag of the slave ADC */
#define ADC12_CSR_AWD2_SLV          (0x01000000) /*!< Analog watchdog 2 flag of the slave ADC */
#define ADC12_CSR_AWD3_SLV          (0x02000000) /*!< Analog watchdog 3 flag of the slave ADC */
#define ADC12_CSR_JQOVF_SLV         (0x04000000) /*!< Injected context queue overflow flag of the slave ADC */

