the-nw1-group/acb-modules/acb-common/include/stm/stm32f30x.inc
#define ADC34_CSR_ADRDY_MST         (0x00000001) /*!< Master ADC ready */
#define ADC34_CSR_ADRDY_EOSMP_MST   (0x00000002) /*!< End of sampling phase flag of the master ADC */
#define ADC34_CSR_ADRDY_EOC_MST     (0x00000004) /*!< End of regular conversion of the master ADC */
#define ADC34_CSR_ADRDY_EOS_MST     (0x00000008) /*!< End of regular sequence flag of the master ADC */
#define ADC34_CSR_ADRDY_OVR_MST     (0x00000010) /*!< Overrun flag of the master ADC */
#define ADC34_CSR_ADRDY_JEOC_MST    (0x00000020) /*!< End of injected conversion of the master ADC */
#define ADC34_CSR_ADRDY_JEOS_MST    (0x00000040) /*!< End of injected sequence flag of the master ADC */
#define ADC34_CSR_AWD1_MST          (0x00000080) /*!< Analog watchdog 1 flag of the master ADC */
#define ADC34_CSR_AWD2_MST          (0x00000100) /*!< Analog watchdog 2 flag of the master ADC */
#define ADC34_CSR_AWD3_MST          (0x00000200) /*!< Analog watchdog 3 flag of the master ADC */
#define ADC34_CSR_JQOVF_MST         (0x00000400) /*!< Injected context queue overflow flag of the master ADC */
#define ADC34_CSR_ADRDY_SLV         (0x00010000) /*!< Slave ADC ready */
#define ADC34_CSR_ADRDY_EOSMP_SLV   (0x00020000) /*!< End of sampling phase flag of the slave ADC */
#define ADC34_CSR_ADRDY_EOC_SLV     (0x00040000) /*!< End of regular conversion of the slave ADC */
#define ADC34_CSR_ADRDY_EOS_SLV     (0x00080000) /*!< End of regular sequence flag of the slave ADC */
#define ADC12_CSR_ADRDY_OVR_SLV     (0x00100000) /*!< Overrun flag of the slave ADC */
#define ADC34_CSR_ADRDY_JEOC_SLV    (0x00200000) /*!< End of injected conversion of the slave ADC */
#define ADC34_CSR_ADRDY_JEOS_SLV    (0x00400000) /*!< End of injected sequence flag of the slave ADC */
#define ADC34_CSR_AWD1_SLV          (0x00800000) /*!< Analog watchdog 1 flag of the slave ADC */
#define ADC34_CSR_AWD2_SLV          (0x01000000) /*!< Analog watchdog 2 flag of the slave ADC */
#define ADC34_CSR_AWD3_SLV          (0x02000000) /*!< Analog watchdog 3 flag of the slave ADC */
#define ADC34_CSR_JQOVF_SLV         (0x04000000) /*!< Injected context queue overflow flag of the slave ADC */

#define ADC12_CCR_MULTI             (0x0000001F) /*!< Multi ADC mode selection */
#define ADC12_CCR_MULTI_0           (0x00000001) /*!< MULTI bit 0 */
#define ADC12_CCR_MULTI_1           (0x00000002) /*!< MULTI bit 1 */
#define ADC12_CCR_MULTI_2           (0x00000004) /*!< MULTI bit 2 */
#define ADC12_CCR_MULTI_3           (0x00000008) /*!< MULTI bit 3 */
#define ADC12_CCR_MULTI_4           (0x00000010) /*!< MULTI bit 4 */
#define ADC12_CCR_DELAY             (0x00000F00) /*!< Delay between 2 sampling phases */
#define ADC12_CCR_DELAY_0           (0x00000100) /*!< DELAY bit 0 */
#define ADC12_CCR_DELAY_1           (0x00000200) /*!< DELAY bit 1 */
#define ADC12_CCR_DELAY_2           (0x00000400) /*!< DELAY bit 2 */
#define ADC12_CCR_DELAY_3           (0x00000800) /*!< DELAY bit 3 */
#define ADC12_CCR_DMACFG            (0x00002000) /*!< DMA configuration for multi-ADC mode */
#define ADC12_CCR_MDMA              (0x0000C000) /*!< DMA mode for multi-ADC mode */
#define ADC12_CCR_MDMA_0            (0x00004000) /*!< MDMA bit 0 */
#define ADC12_CCR_MDMA_1            (0x00008000) /*!< MDMA bit 1 */
#define ADC12_CCR_CKMODE            (0x00030000) /*!< ADC clock mode */
#define ADC12_CCR_CKMODE_0          (0x00010000) /*!< CKMODE bit 0 */
#define ADC12_CCR_CKMODE_1          (0x00020000) /*!< CKMODE bit 1 */
#define ADC12_CCR_VREFEN            (0x00400000) /*!< VREFINT enable */
#define ADC12_CCR_TSEN              (0x00800000) /*!< Temperature sensor enable */
#define ADC12_CCR_VBATEN            (0x01000000) /*!< VBAT enable */

#define ADC34_CCR_MULTI             (0x0000001F) /*!< Multi ADC mode selection */
#define ADC34_CCR_MULTI_0           (0x00000001) /*!< MULTI bit 0 */
#define ADC34_CCR_MULTI_1           (0x00000002) /*!< MULTI bit 1 */
#define ADC34_CCR_MULTI_2           (0x00000004) /*!< MULTI bit 2 */
#define ADC34_CCR_MULTI_3           (0x00000008) /*!< MULTI bit 3 */
#define ADC34_CCR_MULTI_4           (0x00000010) /*!< MULTI bit 4 */

#define ADC34_CCR_DELAY             (0x00000F00) /*!< Delay between 2 sampling phases */
#define ADC34_CCR_DELAY_0           (0x00000100) /*!< DELAY bit 0 */
#define ADC34_CCR_DELAY_1           (0x00000200) /*!< DELAY bit 1 */
#define ADC34_CCR_DELAY_2           (0x00000400) /*!< DELAY bit 2 */
#define ADC34_CCR_DELAY_3           (0x00000800) /*!< DELAY bit 3 */

#define ADC34_CCR_DMACFG            (0x00002000) /*!< DMA configuration for multi-ADC mode */
#define ADC34_CCR_MDMA              (0x0000C000) /*!< DMA mode for multi-ADC mode */
#define ADC34_CCR_MDMA_0            (0x00004000) /*!< MDMA bit 0 */
#define ADC34_CCR_MDMA_1            (0x00008000) /*!< MDMA bit 1 */

#define ADC34_CCR_CKMODE            (0x00030000) /*!< ADC clock mode */
#define ADC34_CCR_CKMODE_0          (0x00010000) /*!< CKMODE bit 0 */
#define ADC34_CCR_CKMODE_1          (0x00020000) /*!< CKMODE bit 1 */

#define ADC34_CCR_VREFEN            (0x00400000) /*!< VREFINT enable */

#define ADC12_CDR_RDATA_MST         (0x0000FFFF) /*!< Regular Data of the master ADC */
#define ADC12_CDR_RDATA_MST_0       (0x00000001) /*!< RDATA_MST bit 0 */
#define ADC12_CDR_RDATA_MST_1       (0x00000002) /*!< RDATA_MST bit 1 */
#define ADC12_CDR_RDATA_MST_2       (0x00000004) /*!< RDATA_MST bit 2 */
#define ADC12_CDR_RDATA_MST_3       (0x00000008) /*!< RDATA_MST bit 3 */
#define ADC12_CDR_RDATA_MST_4       (0x00000010) /*!< RDATA_MST bit 4 */
#define ADC12_CDR_RDATA_MST_5       (0x00000020) /*!< RDATA_MST bit 5 */
#define ADC12_CDR_RDATA_MST_6       (0x00000040) /*!< RDATA_MST bit 6 */
#define ADC12_CDR_RDATA_MST_7       (0x00000080) /*!< RDATA_MST bit 7 */
#define ADC12_CDR_RDATA_MST_8       (0x00000100) /*!< RDATA_MST bit 8 */
#define ADC12_CDR_RDATA_MST_9       (0x00000200) /*!< RDATA_MST bit 9 */
#define ADC12_CDR_RDATA_MST_10      (0x00000400) /*!< RDATA_MST bit 10 */
#define ADC12_CDR_RDATA_MST_11      (0x00000800) /*!< RDATA_MST bit 11 */
#define ADC12_CDR_RDATA_MST_12      (0x00001000) /*!< RDATA_MST bit 12 */
#define ADC12_CDR_RDATA_MST_13      (0x00002000) /*!< RDATA_MST bit 13 */
#define ADC12_CDR_RDATA_MST_14      (0x00004000) /*!< RDATA_MST bit 14 */
#define ADC12_CDR_RDATA_MST_15      (0x00008000) /*!< RDATA_MST bit 15 */

#define ADC12_CDR_RDATA_SLV         (0xFFFF0000) /*!< Regular Data of the master ADC */
#define ADC12_CDR_RDATA_SLV_0       (0x00010000) /*!< RDATA_SLV bit 0 */
#define ADC12_CDR_RDATA_SLV_1       (0x00020000) /*!< RDATA_SLV bit 1 */
#define ADC12_CDR_RDATA_SLV_2       (0x00040000) /*!< RDATA_SLV bit 2 */
#define ADC12_CDR_RDATA_SLV_3       (0x00080000) /*!< RDATA_SLV bit 3 */
#define ADC12_CDR_RDATA_SLV_4       (0x00100000) /*!< RDATA_SLV bit 4 */
#define ADC12_CDR_RDATA_SLV_5       (0x00200000) /*!< RDATA_SLV bit 5 */
#define ADC12_CDR_RDATA_SLV_6       (0x00400000) /*!< RDATA_SLV bit 6 */
#define ADC12_CDR_RDATA_SLV_7       (0x00800000) /*!< RDATA_SLV bit 7 */
#define ADC12_CDR_RDATA_SLV_8       (0x01000000) /*!< RDATA_SLV bit 8 */
#define ADC12_CDR_RDATA_SLV_9       (0x02000000) /*!< RDATA_SLV bit 9 */
#define ADC12_CDR_RDATA_SLV_10      (0x04000000) /*!< RDATA_SLV bit 10 */
#define ADC12_CDR_RDATA_SLV_11      (0x08000000) /*!< RDATA_SLV bit 11 */
#define ADC12_CDR_RDATA_SLV_12      (0x10000000) /*!< RDATA_SLV bit 12 */
#define ADC12_CDR_RDATA_SLV_13      (0x20000000) /*!< RDATA_SLV bit 13 */
#define ADC12_CDR_RDATA_SLV_14      (0x40000000) /*!< RDATA_SLV bit 14 */
#define ADC12_CDR_RDATA_SLV_15      (0x80000000) /*!< RDATA_SLV bit 15 */

#define ADC34_CDR_RDATA_MST         (0x0000FFFF) /*!< Regular Data of the master ADC */
#define ADC34_CDR_RDATA_MST_0       (0x00000001) /*!< RDATA_MST bit 0 */
#define ADC34_CDR_RDATA_MST_1       (0x00000002) /*!< RDATA_MST bit 1 */
#define ADC34_CDR_RDATA_MST_2       (0x00000004) /*!< RDATA_MST bit 2 */
#define ADC34_CDR_RDATA_MST_3       (0x00000008) /*!< RDATA_MST bit 3 */
#define ADC34_CDR_RDATA_MST_4       (0x00000010) /*!< RDATA_MST bit 4 */
#define ADC34_CDR_RDATA_MST_5       (0x00000020) /*!< RDATA_MST bit 5 */
#define ADC34_CDR_RDATA_MST_6       (0x00000040) /*!< RDATA_MST bit 6 */
#define ADC34_CDR_RDATA_MST_7       (0x00000080) /*!< RDATA_MST bit 7 */
#define ADC34_CDR_RDATA_MST_8       (0x00000100) /*!< RDATA_MST bit 8 */
#define ADC34_CDR_RDATA_MST_9       (0x00000200) /*!< RDATA_MST bit 9 */
#define ADC34_CDR_RDATA_MST_10      (0x00000400) /*!< RDATA_MST bit 10 */
#define ADC34_CDR_RDATA_MST_11      (0x00000800) /*!< RDATA_MST bit 11 */
#define ADC34_CDR_RDATA_MST_12      (0x00001000) /*!< RDATA_MST bit 12 */
#define ADC34_CDR_RDATA_MST_13      (0x00002000) /*!< RDATA_MST bit 13 */
#define ADC34_CDR_RDATA_MST_14      (0x00004000) /*!< RDATA_MST bit 14 */
#define ADC34_CDR_RDATA_MST_15      (0x00008000) /*!< RDATA_MST bit 15 */

#define ADC34_CDR_RDATA_SLV         (0xFFFF0000) /*!< Regular Data of the master ADC */
#define ADC34_CDR_RDATA_SLV_0       (0x00010000) /*!< RDATA_SLV bit 0 */
#define ADC34_CDR_RDATA_SLV_1       (0x00020000) /*!< RDATA_SLV bit 1 */
#define ADC34_CDR_RDATA_SLV_2       (0x00040000) /*!< RDATA_SLV bit 2 */
#define ADC34_CDR_RDATA_SLV_3       (0x00080000) /*!< RDATA_SLV bit 3 */
#define ADC34_CDR_RDATA_SLV_4       (0x00100000) /*!< RDATA_SLV bit 4 */
#define ADC34_CDR_RDATA_SLV_5       (0x00200000) /*!< RDATA_SLV bit 5 */
#define ADC34_CDR_RDATA_SLV_6       (0x00400000) /*!< RDATA_SLV bit 6 */
#define ADC34_CDR_RDATA_SLV_7       (0x00800000) /*!< RDATA_SLV bit 7 */
#define ADC34_CDR_RDATA_SLV_8       (0x01000000) /*!< RDATA_SLV bit 8 */
#define ADC34_CDR_RDATA_SLV_9       (0x02000000) /*!< RDATA_SLV bit 9 */
#define ADC34_CDR_RDATA_SLV_10      (0x04000000) /*!< RDATA_SLV bit 10 */
#define ADC34_CDR_RDATA_SLV_11      (0x08000000) /*!< RDATA_SLV bit 11 */
#define ADC34_CDR_RDATA_SLV_12      (0x10000000) /*!< RDATA_SLV bit 12 */
#define ADC34_CDR_RDATA_SLV_13      (0x20000000) /*!< RDATA_SLV bit 13 */
#define ADC34_CDR_RDATA_SLV_14      (0x40000000) /*!< RDATA_SLV bit 14 */
#define ADC34_CDR_RDATA_SLV_15      (0x80000000) /*!< RDATA_SLV bit 15 */

