the-nw1-group/acb-modules/acb-common/include/stm/stm32f30x.inc
#define COMP1_CSR_COMP1EN               (0x00000001) /*!< COMP1 enable */
#define COMP1_CSR_COMP1SW1              (0x00000002) /*!< COMP1 SW1 switch control */
#define COMP1_CSR_COMP1MODE             (0x0000000C) /*!< COMP1 power mode */
#define COMP1_CSR_COMP1MODE_0           (0x00000004) /*!< COMP1 power mode bit 0 */
#define COMP1_CSR_COMP1MODE_1           (0x00000008) /*!< COMP1 power mode bit 1 */
#define COMP1_CSR_COMP1INSEL            (0x00000070) /*!< COMP1 inverting input select */
#define COMP1_CSR_COMP1INSEL_0          (0x00000010) /*!< COMP1 inverting input select bit 0 */
#define COMP1_CSR_COMP1INSEL_1          (0x00000020) /*!< COMP1 inverting input select bit 1 */
#define COMP1_CSR_COMP1INSEL_2          (0x00000040) /*!< COMP1 inverting input select bit 2 */
#define COMP1_CSR_COMP1NONINSEL         (0x00000080) /*!< COMP1 non inverting input select */
#define COMP1_CSR_COMP1OUTSEL           (0x00003C00) /*!< COMP1 output select */
#define COMP1_CSR_COMP1OUTSEL_0         (0x00000400) /*!< COMP1 output select bit 0 */
#define COMP1_CSR_COMP1OUTSEL_1         (0x00000800) /*!< COMP1 output select bit 1 */
#define COMP1_CSR_COMP1OUTSEL_2         (0x00001000) /*!< COMP1 output select bit 2 */
#define COMP1_CSR_COMP1OUTSEL_3         (0x00002000) /*!< COMP1 output select bit 3 */
#define COMP1_CSR_COMP1POL              (0x00008000) /*!< COMP1 output polarity */
#define COMP1_CSR_COMP1HYST             (0x00030000) /*!< COMP1 hysteresis */
#define COMP1_CSR_COMP1HYST_0           (0x00010000) /*!< COMP1 hysteresis bit 0 */
#define COMP1_CSR_COMP1HYST_1           (0x00020000) /*!< COMP1 hysteresis bit 1 */
#define COMP1_CSR_COMP1BLANKING         (0x000C0000) /*!< COMP1 blanking */
#define COMP1_CSR_COMP1BLANKING_0       (0x00040000) /*!< COMP1 blanking bit 0 */
#define COMP1_CSR_COMP1BLANKING_1       (0x00080000) /*!< COMP1 blanking bit 1 */
#define COMP1_CSR_COMP1BLANKING_2       (0x00100000) /*!< COMP1 blanking bit 2 */
#define COMP1_CSR_COMP1OUT              (0x40000000) /*!< COMP1 output level */
#define COMP1_CSR_COMP1LOCK             (0x80000000) /*!< COMP1 lock */

#define COMP2_CSR_COMP2EN               (0x00000001) /*!< COMP2 enable */
#define COMP2_CSR_COMP2MODE             (0x0000000C) /*!< COMP2 power mode */
#define COMP2_CSR_COMP2MODE_0           (0x00000004) /*!< COMP2 power mode bit 0 */
#define COMP2_CSR_COMP2MODE_1           (0x00000008) /*!< COMP2 power mode bit 1 */
#define COMP2_CSR_COMP2INSEL            (0x00000070) /*!< COMP2 inverting input select */
#define COMP2_CSR_COMP2INSEL_0          (0x00000010) /*!< COMP2 inverting input select bit 0 */
#define COMP2_CSR_COMP2INSEL_1          (0x00000020) /*!< COMP2 inverting input select bit 1 */
#define COMP2_CSR_COMP2INSEL_2          (0x00000040) /*!< COMP2 inverting input select bit 2 */
#define COMP2_CSR_COMP2NONINSEL         (0x00000080) /*!< COMP2 non inverting input select */
#define COMP2_CSR_COMP2WNDWEN           (0x00000200) /*!< COMP2 window mode enable */
#define COMP2_CSR_COMP2OUTSEL           (0x00003C00) /*!< COMP2 output select */
#define COMP2_CSR_COMP2OUTSEL_0         (0x00000400) /*!< COMP2 output select bit 0 */
#define COMP2_CSR_COMP2OUTSEL_1         (0x00000800) /*!< COMP2 output select bit 1 */
#define COMP2_CSR_COMP2OUTSEL_2         (0x00001000) /*!< COMP2 output select bit 2 */
#define COMP2_CSR_COMP2OUTSEL_3         (0x00002000) /*!< COMP2 output select bit 3 */
#define COMP2_CSR_COMP2POL              (0x00008000) /*!< COMP2 output polarity */
#define COMP2_CSR_COMP2HYST             (0x00030000) /*!< COMP2 hysteresis */
#define COMP2_CSR_COMP2HYST_0           (0x00010000) /*!< COMP2 hysteresis bit 0 */
#define COMP2_CSR_COMP2HYST_1           (0x00020000) /*!< COMP2 hysteresis bit 1 */
#define COMP2_CSR_COMP2BLANKING         (0x000C0000) /*!< COMP2 blanking */
#define COMP2_CSR_COMP2BLANKING_0       (0x00040000) /*!< COMP2 blanking bit 0 */
#define COMP2_CSR_COMP2BLANKING_1       (0x00080000) /*!< COMP2 blanking bit 1 */
#define COMP2_CSR_COMP2BLANKING_2       (0x00100000) /*!< COMP2 blanking bit 2 */
#define COMP2_CSR_COMP2OUT              (0x40000000) /*!< COMP2 output level */
#define COMP2_CSR_COMP2LOCK             (0x80000000) /*!< COMP2 lock */

#define COMP3_CSR_COMP3EN               (0x00000001) /*!< COMP3 enable */
#define COMP3_CSR_COMP3MODE             (0x0000000C) /*!< COMP3 power mode */
#define COMP3_CSR_COMP3MODE_0           (0x00000004) /*!< COMP3 power mode bit 0 */
#define COMP3_CSR_COMP3MODE_1           (0x00000008) /*!< COMP3 power mode bit 1 */
#define COMP3_CSR_COMP3INSEL            (0x00000070) /*!< COMP3 inverting input select */
#define COMP3_CSR_COMP3INSEL_0          (0x00000010) /*!< COMP3 inverting input select bit 0 */
#define COMP3_CSR_COMP3INSEL_1          (0x00000020) /*!< COMP3 inverting input select bit 1 */
#define COMP3_CSR_COMP3INSEL_2          (0x00000040) /*!< COMP3 inverting input select bit 2 */
#define COMP3_CSR_COMP3NONINSEL         (0x00000080) /*!< COMP3 non inverting input select */
#define COMP3_CSR_COMP3OUTSEL           (0x00003C00) /*!< COMP3 output select */
#define COMP3_CSR_COMP3OUTSEL_0         (0x00000400) /*!< COMP3 output select bit 0 */
#define COMP3_CSR_COMP3OUTSEL_1         (0x00000800) /*!< COMP3 output select bit 1 */
#define COMP3_CSR_COMP3OUTSEL_2         (0x00001000) /*!< COMP3 output select bit 2 */
#define COMP3_CSR_COMP3OUTSEL_3         (0x00002000) /*!< COMP3 output select bit 3 */
#define COMP3_CSR_COMP3POL              (0x00008000) /*!< COMP3 output polarity */
#define COMP3_CSR_COMP3HYST             (0x00030000) /*!< COMP3 hysteresis */
#define COMP3_CSR_COMP3HYST_0           (0x00010000) /*!< COMP3 hysteresis bit 0 */
#define COMP3_CSR_COMP3HYST_1           (0x00020000) /*!< COMP3 hysteresis bit 1 */
#define COMP3_CSR_COMP3BLANKING         (0x000C0000) /*!< COMP3 blanking */
#define COMP3_CSR_COMP3BLANKING_0       (0x00040000) /*!< COMP3 blanking bit 0 */
#define COMP3_CSR_COMP3BLANKING_1       (0x00080000) /*!< COMP3 blanking bit 1 */
#define COMP3_CSR_COMP3BLANKING_2       (0x00100000) /*!< COMP3 blanking bit 2 */
#define COMP3_CSR_COMP3OUT              (0x40000000) /*!< COMP3 output level */
#define COMP3_CSR_COMP3LOCK             (0x80000000) /*!< COMP3 lock */

#define COMP4_CSR_COMP4EN               (0x00000001) /*!< COMP4 enable */
#define COMP4_CSR_COMP4MODE             (0x0000000C) /*!< COMP4 power mode */
#define COMP4_CSR_COMP4MODE_0           (0x00000004) /*!< COMP4 power mode bit 0 */
#define COMP4_CSR_COMP4MODE_1           (0x00000008) /*!< COMP4 power mode bit 1 */
#define COMP4_CSR_COMP4INSEL            (0x00000070) /*!< COMP4 inverting input select */
#define COMP4_CSR_COMP4INSEL_0          (0x00000010) /*!< COMP4 inverting input select bit 0 */
#define COMP4_CSR_COMP4INSEL_1          (0x00000020) /*!< COMP4 inverting input select bit 1 */
#define COMP4_CSR_COMP4INSEL_2          (0x00000040) /*!< COMP4 inverting input select bit 2 */
#define COMP4_CSR_COMP4NONINSEL         (0x00000080) /*!< COMP4 non inverting input select */
#define COMP4_CSR_COMP4WNDWEN           (0x00000200) /*!< COMP4 window mode enable */
#define COMP4_CSR_COMP4OUTSEL           (0x00003C00) /*!< COMP4 output select */
#define COMP4_CSR_COMP4OUTSEL_0         (0x00000400) /*!< COMP4 output select bit 0 */
#define COMP4_CSR_COMP4OUTSEL_1         (0x00000800) /*!< COMP4 output select bit 1 */
#define COMP4_CSR_COMP4OUTSEL_2         (0x00001000) /*!< COMP4 output select bit 2 */
#define COMP4_CSR_COMP4OUTSEL_3         (0x00002000) /*!< COMP4 output select bit 3 */
#define COMP4_CSR_COMP4POL              (0x00008000) /*!< COMP4 output polarity */
#define COMP4_CSR_COMP4HYST             (0x00030000) /*!< COMP4 hysteresis */
#define COMP4_CSR_COMP4HYST_0           (0x00010000) /*!< COMP4 hysteresis bit 0 */
#define COMP4_CSR_COMP4HYST_1           (0x00020000) /*!< COMP4 hysteresis bit 1 */
#define COMP4_CSR_COMP4BLANKING         (0x000C0000) /*!< COMP4 blanking */
#define COMP4_CSR_COMP4BLANKING_0       (0x00040000) /*!< COMP4 blanking bit 0 */
#define COMP4_CSR_COMP4BLANKING_1       (0x00080000) /*!< COMP4 blanking bit 1 */
#define COMP4_CSR_COMP4BLANKING_2       (0x00100000) /*!< COMP4 blanking bit 2 */
#define COMP4_CSR_COMP4OUT              (0x40000000) /*!< COMP4 output level */
#define COMP4_CSR_COMP4LOCK             (0x80000000) /*!< COMP4 lock */

#define COMP5_CSR_COMP5EN               (0x00000001) /*!< COMP5 enable */
#define COMP5_CSR_COMP5MODE             (0x0000000C) /*!< COMP5 power mode */
#define COMP5_CSR_COMP5MODE_0           (0x00000004) /*!< COMP5 power mode bit 0 */
#define COMP5_CSR_COMP5MODE_1           (0x00000008) /*!< COMP5 power mode bit 1 */
#define COMP5_CSR_COMP5INSEL            (0x00000070) /*!< COMP5 inverting input select */
#define COMP5_CSR_COMP5INSEL_0          (0x00000010) /*!< COMP5 inverting input select bit 0 */
#define COMP5_CSR_COMP5INSEL_1          (0x00000020) /*!< COMP5 inverting input select bit 1 */
#define COMP5_CSR_COMP5INSEL_2          (0x00000040) /*!< COMP5 inverting input select bit 2 */
#define COMP5_CSR_COMP5NONINSEL         (0x00000080) /*!< COMP5 non inverting input select */
#define COMP5_CSR_COMP5OUTSEL           (0x00003C00) /*!< COMP5 output select */
#define COMP5_CSR_COMP5OUTSEL_0         (0x00000400) /*!< COMP5 output select bit 0 */
#define COMP5_CSR_COMP5OUTSEL_1         (0x00000800) /*!< COMP5 output select bit 1 */
#define COMP5_CSR_COMP5OUTSEL_2         (0x00001000) /*!< COMP5 output select bit 2 */
#define COMP5_CSR_COMP5OUTSEL_3         (0x00002000) /*!< COMP5 output select bit 3 */
#define COMP5_CSR_COMP5POL              (0x00008000) /*!< COMP5 output polarity */
#define COMP5_CSR_COMP5HYST             (0x00030000) /*!< COMP5 hysteresis */
#define COMP5_CSR_COMP5HYST_0           (0x00010000) /*!< COMP5 hysteresis bit 0 */
#define COMP5_CSR_COMP5HYST_1           (0x00020000) /*!< COMP5 hysteresis bit 1 */
#define COMP5_CSR_COMP5BLANKING         (0x000C0000) /*!< COMP5 blanking */
#define COMP5_CSR_COMP5BLANKING_0       (0x00040000) /*!< COMP5 blanking bit 0 */
#define COMP5_CSR_COMP5BLANKING_1       (0x00080000) /*!< COMP5 blanking bit 1 */
#define COMP5_CSR_COMP5BLANKING_2       (0x00100000) /*!< COMP5 blanking bit 2 */
#define COMP5_CSR_COMP5OUT              (0x40000000) /*!< COMP5 output level */
#define COMP5_CSR_COMP5LOCK             (0x80000000) /*!< COMP5 lock */

#define COMP6_CSR_COMP6EN               (0x00000001) /*!< COMP6 enable */
#define COMP6_CSR_COMP6MODE             (0x0000000C) /*!< COMP6 power mode */
#define COMP6_CSR_COMP6MODE_0           (0x00000004) /*!< COMP6 power mode bit 0 */
#define COMP6_CSR_COMP6MODE_1           (0x00000008) /*!< COMP6 power mode bit 1 */
#define COMP6_CSR_COMP6INSEL            (0x00000070) /*!< COMP6 inverting input select */
#define COMP6_CSR_COMP6INSEL_0          (0x00000010) /*!< COMP6 inverting input select bit 0 */
#define COMP6_CSR_COMP6INSEL_1          (0x00000020) /*!< COMP6 inverting input select bit 1 */
#define COMP6_CSR_COMP6INSEL_2          (0x00000040) /*!< COMP6 inverting input select bit 2 */
#define COMP6_CSR_COMP6NONINSEL         (0x00000080) /*!< COMP6 non inverting input select */
#define COMP6_CSR_COMP6WNDWEN           (0x00000200) /*!< COMP6 window mode enable */
#define COMP6_CSR_COMP6OUTSEL           (0x00003C00) /*!< COMP6 output select */
#define COMP6_CSR_COMP6OUTSEL_0         (0x00000400) /*!< COMP6 output select bit 0 */
#define COMP6_CSR_COMP6OUTSEL_1         (0x00000800) /*!< COMP6 output select bit 1 */
#define COMP6_CSR_COMP6OUTSEL_2         (0x00001000) /*!< COMP6 output select bit 2 */
#define COMP6_CSR_COMP6OUTSEL_3         (0x00002000) /*!< COMP6 output select bit 3 */
#define COMP6_CSR_COMP6POL              (0x00008000) /*!< COMP6 output polarity */
#define COMP6_CSR_COMP6HYST             (0x00030000) /*!< COMP6 hysteresis */
#define COMP6_CSR_COMP6HYST_0           (0x00010000) /*!< COMP6 hysteresis bit 0 */
#define COMP6_CSR_COMP6HYST_1           (0x00020000) /*!< COMP6 hysteresis bit 1 */
#define COMP6_CSR_COMP6BLANKING         (0x000C0000) /*!< COMP6 blanking */
#define COMP6_CSR_COMP6BLANKING_0       (0x00040000) /*!< COMP6 blanking bit 0 */
#define COMP6_CSR_COMP6BLANKING_1       (0x00080000) /*!< COMP6 blanking bit 1 */
#define COMP6_CSR_COMP6BLANKING_2       (0x00100000) /*!< COMP6 blanking bit 2 */
#define COMP6_CSR_COMP6OUT              (0x40000000) /*!< COMP6 output level */
#define COMP6_CSR_COMP6LOCK             (0x80000000) /*!< COMP6 lock */

#define COMP7_CSR_COMP7EN               (0x00000001) /*!< COMP7 enable */
#define COMP7_CSR_COMP7MODE             (0x0000000C) /*!< COMP7 power mode */
#define COMP7_CSR_COMP7MODE_0           (0x00000004) /*!< COMP7 power mode bit 0 */
#define COMP7_CSR_COMP7MODE_1           (0x00000008) /*!< COMP7 power mode bit 1 */
#define COMP7_CSR_COMP7INSEL            (0x00000070) /*!< COMP7 inverting input select */
#define COMP7_CSR_COMP7INSEL_0          (0x00000010) /*!< COMP7 inverting input select bit 0 */
#define COMP7_CSR_COMP7INSEL_1          (0x00000020) /*!< COMP7 inverting input select bit 1 */
#define COMP7_CSR_COMP7INSEL_2          (0x00000040) /*!< COMP7 inverting input select bit 2 */
#define COMP7_CSR_COMP7NONINSEL         (0x00000080) /*!< COMP7 non inverting input select */
#define COMP7_CSR_COMP7OUTSEL           (0x00003C00) /*!< COMP7 output select */
#define COMP7_CSR_COMP7OUTSEL_0         (0x00000400) /*!< COMP7 output select bit 0 */
#define COMP7_CSR_COMP7OUTSEL_1         (0x00000800) /*!< COMP7 output select bit 1 */
#define COMP7_CSR_COMP7OUTSEL_2         (0x00001000) /*!< COMP7 output select bit 2 */
#define COMP7_CSR_COMP7OUTSEL_3         (0x00002000) /*!< COMP7 output select bit 3 */
#define COMP7_CSR_COMP7POL              (0x00008000) /*!< COMP7 output polarity */
#define COMP7_CSR_COMP7HYST             (0x00030000) /*!< COMP7 hysteresis */
#define COMP7_CSR_COMP7HYST_0           (0x00010000) /*!< COMP7 hysteresis bit 0 */
#define COMP7_CSR_COMP7HYST_1           (0x00020000) /*!< COMP7 hysteresis bit 1 */
#define COMP7_CSR_COMP7BLANKING         (0x000C0000) /*!< COMP7 blanking */
#define COMP7_CSR_COMP7BLANKING_0       (0x00040000) /*!< COMP7 blanking bit 0 */
#define COMP7_CSR_COMP7BLANKING_1       (0x00080000) /*!< COMP7 blanking bit 1 */
#define COMP7_CSR_COMP7BLANKING_2       (0x00100000) /*!< COMP7 blanking bit 2 */
#define COMP7_CSR_COMP7OUT              (0x40000000) /*!< COMP7 output level */
#define COMP7_CSR_COMP7LOCK             (0x80000000) /*!< COMP7 lock */

#define COMP_CSR_COMPxEN               (0x00000001) /*!< COMPx enable */
#define COMP_CSR_COMP1SW1              (0x00000002) /*!< COMP1 SW1 switch control */
#define COMP_CSR_COMPxMODE             (0x0000000C) /*!< COMPx power mode */
#define COMP_CSR_COMPxMODE_0           (0x00000004) /*!< COMPx power mode bit 0 */
#define COMP_CSR_COMPxMODE_1           (0x00000008) /*!< COMPx power mode bit 1 */
#define COMP_CSR_COMPxINSEL            (0x00000070) /*!< COMPx inverting input select */
#define COMP_CSR_COMPxINSEL_0          (0x00000010) /*!< COMPx inverting input select bit 0 */
#define COMP_CSR_COMPxINSEL_1          (0x00000020) /*!< COMPx inverting input select bit 1 */
#define COMP_CSR_COMPxINSEL_2          (0x00000040) /*!< COMPx inverting input select bit 2 */
#define COMP_CSR_COMPxNONINSEL         (0x00000080) /*!< COMPx non inverting input select */
#define COMP_CSR_COMPxWNDWEN           (0x00000200) /*!< COMPx window mode enable */
#define COMP_CSR_COMPxOUTSEL           (0x00003C00) /*!< COMPx output select */
#define COMP_CSR_COMPxOUTSEL_0         (0x00000400) /*!< COMPx output select bit 0 */
#define COMP_CSR_COMPxOUTSEL_1         (0x00000800) /*!< COMPx output select bit 1 */
#define COMP_CSR_COMPxOUTSEL_2         (0x00001000) /*!< COMPx output select bit 2 */
#define COMP_CSR_COMPxOUTSEL_3         (0x00002000) /*!< COMPx output select bit 3 */
#define COMP_CSR_COMPxPOL              (0x00008000) /*!< COMPx output polarity */
#define COMP_CSR_COMPxHYST             (0x00030000) /*!< COMPx hysteresis */
#define COMP_CSR_COMPxHYST_0           (0x00010000) /*!< COMPx hysteresis bit 0 */
#define COMP_CSR_COMPxHYST_1           (0x00020000) /*!< COMPx hysteresis bit 1 */
#define COMP_CSR_COMPxBLANKING         (0x000C0000) /*!< COMPx blanking */
#define COMP_CSR_COMPxBLANKING_0       (0x00040000) /*!< COMPx blanking bit 0 */
#define COMP_CSR_COMPxBLANKING_1       (0x00080000) /*!< COMPx blanking bit 1 */
#define COMP_CSR_COMPxBLANKING_2       (0x00100000) /*!< COMPx blanking bit 2 */
#define COMP_CSR_COMPxINSEL_3          (0x00400000) /*!< COMPx inverting input select bit 3 */
#define COMP_CSR_COMPxOUT              (0x40000000) /*!< COMPx output level */
#define COMP_CSR_COMPxLOCK             (0x80000000) /*!< COMPx lock */

#define OPAMP1_CSR_OPAMP1EN               (0x00000001) /*!< OPAMP1 enable */
#define OPAMP1_CSR_FORCEVP                (0x00000002) /*!< Connect the internal references to the plus input of the OPAMPX */
#define OPAMP1_CSR_VPSEL                  (0x0000000C) /*!< Non inverting input selection */
#define OPAMP1_CSR_VPSEL_0                (0x00000004) /*!< Bit 0 */
#define OPAMP1_CSR_VPSEL_1                (0x00000008) /*!< Bit 1 */
#define OPAMP1_CSR_VMSEL                  (0x00000060) /*!< Inverting input selection */
#define OPAMP1_CSR_VMSEL_0                (0x00000020) /*!< Bit 0 */
#define OPAMP1_CSR_VMSEL_1                (0x00000040) /*!< Bit 1 */
#define OPAMP1_CSR_TCMEN                  (0x00000080) /*!< Timer-Controlled Mux mode enable */
#define OPAMP1_CSR_VMSSEL                 (0x00000100) /*!< Inverting input secondary selection */
#define OPAMP1_CSR_VPSSEL                 (0x00000600) /*!< Non inverting input secondary selection */
#define OPAMP1_CSR_VPSSEL_0               (0x00000200) /*!< Bit 0 */
#define OPAMP1_CSR_VPSSEL_1               (0x00000400) /*!< Bit 1 */
#define OPAMP1_CSR_CALON                  (0x00000800) /*!< Calibration mode enable */
#define OPAMP1_CSR_CALSEL                 (0x00003000) /*!< Calibration selection */
#define OPAMP1_CSR_CALSEL_0               (0x00001000) /*!< Bit 0 */
#define OPAMP1_CSR_CALSEL_1               (0x00002000) /*!< Bit 1 */
#define OPAMP1_CSR_PGGAIN                 (0x0003C000) /*!< Gain in PGA mode */
#define OPAMP1_CSR_PGGAIN_0               (0x00004000) /*!< Bit 0 */
#define OPAMP1_CSR_PGGAIN_1               (0x00008000) /*!< Bit 1 */
#define OPAMP1_CSR_PGGAIN_2               (0x00010000) /*!< Bit 2 */
#define OPAMP1_CSR_PGGAIN_3               (0x00020000) /*!< Bit 3 */
#define OPAMP1_CSR_USERTRIM               (0x00040000) /*!< User trimming enable */
#define OPAMP1_CSR_TRIMOFFSETP            (0x00F80000) /*!< Offset trimming value (PMOS) */
#define OPAMP1_CSR_TRIMOFFSETN            (0x1F000000) /*!< Offset trimming value (NMOS) */
#define OPAMP1_CSR_TSTREF                 (0x20000000) /*!< It enables the switch to put out the internal reference */
#define OPAMP1_CSR_OUTCAL                 (0x40000000) /*!< OPAMP output status flag */
#define OPAMP1_CSR_LOCK                   (0x80000000) /*!< OPAMP lock */

#define OPAMP2_CSR_OPAMP2EN               (0x00000001) /*!< OPAMP2 enable */
#define OPAMP2_CSR_FORCEVP                (0x00000002) /*!< Connect the internal references to the plus input of the OPAMPX */
#define OPAMP2_CSR_VPSEL                  (0x0000000C) /*!< Non inverting input selection */
#define OPAMP2_CSR_VPSEL_0                (0x00000004) /*!< Bit 0 */
#define OPAMP2_CSR_VPSEL_1                (0x00000008) /*!< Bit 1 */
#define OPAMP2_CSR_VMSEL                  (0x00000060) /*!< Inverting input selection */
#define OPAMP2_CSR_VMSEL_0                (0x00000020) /*!< Bit 0 */
#define OPAMP2_CSR_VMSEL_1                (0x00000040) /*!< Bit 1 */
#define OPAMP2_CSR_TCMEN                  (0x00000080) /*!< Timer-Controlled Mux mode enable */
#define OPAMP2_CSR_VMSSEL                 (0x00000100) /*!< Inverting input secondary selection */
#define OPAMP2_CSR_VPSSEL                 (0x00000600) /*!< Non inverting input secondary selection */
#define OPAMP2_CSR_VPSSEL_0               (0x00000200) /*!< Bit 0 */
#define OPAMP2_CSR_VPSSEL_1               (0x00000400) /*!< Bit 1 */
#define OPAMP2_CSR_CALON                  (0x00000800) /*!< Calibration mode enable */
#define OPAMP2_CSR_CALSEL                 (0x00003000) /*!< Calibration selection */
#define OPAMP2_CSR_CALSEL_0               (0x00001000) /*!< Bit 0 */
#define OPAMP2_CSR_CALSEL_1               (0x00002000) /*!< Bit 1 */
#define OPAMP2_CSR_PGGAIN                 (0x0003C000) /*!< Gain in PGA mode */
#define OPAMP2_CSR_PGGAIN_0               (0x00004000) /*!< Bit 0 */
#define OPAMP2_CSR_PGGAIN_1               (0x00008000) /*!< Bit 1 */
#define OPAMP2_CSR_PGGAIN_2               (0x00010000) /*!< Bit 2 */
#define OPAMP2_CSR_PGGAIN_3               (0x00020000) /*!< Bit 3 */
#define OPAMP2_CSR_USERTRIM               (0x00040000) /*!< User trimming enable */
#define OPAMP2_CSR_TRIMOFFSETP            (0x00F80000) /*!< Offset trimming value (PMOS) */
#define OPAMP2_CSR_TRIMOFFSETN            (0x1F000000) /*!< Offset trimming value (NMOS) */
#define OPAMP2_CSR_TSTREF                 (0x20000000) /*!< It enables the switch to put out the internal reference */
#define OPAMP2_CSR_OUTCAL                 (0x40000000) /*!< OPAMP output status flag */
#define OPAMP2_CSR_LOCK                   (0x80000000) /*!< OPAMP lock */

#define OPAMP3_CSR_OPAMP3EN               (0x00000001) /*!< OPAMP3 enable */
#define OPAMP3_CSR_FORCEVP                (0x00000002) /*!< Connect the internal references to the plus input of the OPAMPX */
#define OPAMP3_CSR_VPSEL                  (0x0000000C) /*!< Non inverting input selection */
#define OPAMP3_CSR_VPSEL_0                (0x00000004) /*!< Bit 0 */
#define OPAMP3_CSR_VPSEL_1                (0x00000008) /*!< Bit 1 */
#define OPAMP3_CSR_VMSEL                  (0x00000060) /*!< Inverting input selection */
#define OPAMP3_CSR_VMSEL_0                (0x00000020) /*!< Bit 0 */
#define OPAMP3_CSR_VMSEL_1                (0x00000040) /*!< Bit 1 */
#define OPAMP3_CSR_TCMEN                  (0x00000080) /*!< Timer-Controlled Mux mode enable */
#define OPAMP3_CSR_VMSSEL                 (0x00000100) /*!< Inverting input secondary selection */
#define OPAMP3_CSR_VPSSEL                 (0x00000600) /*!< Non inverting input secondary selection */
#define OPAMP3_CSR_VPSSEL_0               (0x00000200) /*!< Bit 0 */
#define OPAMP3_CSR_VPSSEL_1               (0x00000400) /*!< Bit 1 */
#define OPAMP3_CSR_CALON                  (0x00000800) /*!< Calibration mode enable */
#define OPAMP3_CSR_CALSEL                 (0x00003000) /*!< Calibration selection */
#define OPAMP3_CSR_CALSEL_0               (0x00001000) /*!< Bit 0 */
#define OPAMP3_CSR_CALSEL_1               (0x00002000) /*!< Bit 1 */
#define OPAMP3_CSR_PGGAIN                 (0x0003C000) /*!< Gain in PGA mode */
#define OPAMP3_CSR_PGGAIN_0               (0x00004000) /*!< Bit 0 */
#define OPAMP3_CSR_PGGAIN_1               (0x00008000) /*!< Bit 1 */
#define OPAMP3_CSR_PGGAIN_2               (0x00010000) /*!< Bit 2 */
#define OPAMP3_CSR_PGGAIN_3               (0x00020000) /*!< Bit 3 */
#define OPAMP3_CSR_USERTRIM               (0x00040000) /*!< User trimming enable */
#define OPAMP3_CSR_TRIMOFFSETP            (0x00F80000) /*!< Offset trimming value (PMOS) */
#define OPAMP3_CSR_TRIMOFFSETN            (0x1F000000) /*!< Offset trimming value (NMOS) */
#define OPAMP3_CSR_TSTREF                 (0x20000000) /*!< It enables the switch to put out the internal reference */
#define OPAMP3_CSR_OUTCAL                 (0x40000000) /*!< OPAMP output status flag */
#define OPAMP3_CSR_LOCK                   (0x80000000) /*!< OPAMP lock */

