the-nw1-group/acb-modules/acb-common/include/stm/stm32f30x.inc
#define OPAMP4_CSR_OPAMP4EN               (0x00000001) /*!< OPAMP4 enable */
#define OPAMP4_CSR_FORCEVP                (0x00000002) /*!< Connect the internal references to the plus input of the OPAMPX */
#define OPAMP4_CSR_VPSEL                  (0x0000000C) /*!< Non inverting input selection */
#define OPAMP4_CSR_VPSEL_0                (0x00000004) /*!< Bit 0 */
#define OPAMP4_CSR_VPSEL_1                (0x00000008) /*!< Bit 1 */
#define OPAMP4_CSR_VMSEL                  (0x00000060) /*!< Inverting input selection */
#define OPAMP4_CSR_VMSEL_0                (0x00000020) /*!< Bit 0 */
#define OPAMP4_CSR_VMSEL_1                (0x00000040) /*!< Bit 1 */
#define OPAMP4_CSR_TCMEN                  (0x00000080) /*!< Timer-Controlled Mux mode enable */
#define OPAMP4_CSR_VMSSEL                 (0x00000100) /*!< Inverting input secondary selection */
#define OPAMP4_CSR_VPSSEL                 (0x00000600) /*!< Non inverting input secondary selection */
#define OPAMP4_CSR_VPSSEL_0               (0x00000200) /*!< Bit 0 */
#define OPAMP4_CSR_VPSSEL_1               (0x00000400) /*!< Bit 1 */
#define OPAMP4_CSR_CALON                  (0x00000800) /*!< Calibration mode enable */
#define OPAMP4_CSR_CALSEL                 (0x00003000) /*!< Calibration selection */
#define OPAMP4_CSR_CALSEL_0               (0x00001000) /*!< Bit 0 */
#define OPAMP4_CSR_CALSEL_1               (0x00002000) /*!< Bit 1 */
#define OPAMP4_CSR_PGGAIN                 (0x0003C000) /*!< Gain in PGA mode */
#define OPAMP4_CSR_PGGAIN_0               (0x00004000) /*!< Bit 0 */
#define OPAMP4_CSR_PGGAIN_1               (0x00008000) /*!< Bit 1 */
#define OPAMP4_CSR_PGGAIN_2               (0x00010000) /*!< Bit 2 */
#define OPAMP4_CSR_PGGAIN_3               (0x00020000) /*!< Bit 3 */
#define OPAMP4_CSR_USERTRIM               (0x00040000) /*!< User trimming enable */
#define OPAMP4_CSR_TRIMOFFSETP            (0x00F80000) /*!< Offset trimming value (PMOS) */
#define OPAMP4_CSR_TRIMOFFSETN            (0x1F000000) /*!< Offset trimming value (NMOS) */
#define OPAMP4_CSR_TSTREF                 (0x20000000) /*!< It enables the switch to put out the internal reference */
#define OPAMP4_CSR_OUTCAL                 (0x40000000) /*!< OPAMP output status flag */
#define OPAMP4_CSR_LOCK                   (0x80000000) /*!< OPAMP lock */

#define OPAMP_CSR_OPAMPxEN               (0x00000001) /*!< OPAMP enable */
#define OPAMP_CSR_FORCEVP                (0x00000002) /*!< Connect the internal references to the plus input of the OPAMPX */
#define OPAMP_CSR_VPSEL                  (0x0000000C) /*!< Non inverting input selection */
#define OPAMP_CSR_VPSEL_0                (0x00000004) /*!< Bit 0 */
#define OPAMP_CSR_VPSEL_1                (0x00000008) /*!< Bit 1 */
#define OPAMP_CSR_VMSEL                  (0x00000060) /*!< Inverting input selection */
#define OPAMP_CSR_VMSEL_0                (0x00000020) /*!< Bit 0 */
#define OPAMP_CSR_VMSEL_1                (0x00000040) /*!< Bit 1 */
#define OPAMP_CSR_TCMEN                  (0x00000080) /*!< Timer-Controlled Mux mode enable */
#define OPAMP_CSR_VMSSEL                 (0x00000100) /*!< Inverting input secondary selection */
#define OPAMP_CSR_VPSSEL                 (0x00000600) /*!< Non inverting input secondary selection */
#define OPAMP_CSR_VPSSEL_0               (0x00000200) /*!< Bit 0 */
#define OPAMP_CSR_VPSSEL_1               (0x00000400) /*!< Bit 1 */
#define OPAMP_CSR_CALON                  (0x00000800) /*!< Calibration mode enable */
#define OPAMP_CSR_CALSEL                 (0x00003000) /*!< Calibration selection */
#define OPAMP_CSR_CALSEL_0               (0x00001000) /*!< Bit 0 */
#define OPAMP_CSR_CALSEL_1               (0x00002000) /*!< Bit 1 */
#define OPAMP_CSR_PGGAIN                 (0x0003C000) /*!< Gain in PGA mode */
#define OPAMP_CSR_PGGAIN_0               (0x00004000) /*!< Bit 0 */
#define OPAMP_CSR_PGGAIN_1               (0x00008000) /*!< Bit 1 */
#define OPAMP_CSR_PGGAIN_2               (0x00010000) /*!< Bit 2 */
#define OPAMP_CSR_PGGAIN_3               (0x00020000) /*!< Bit 3 */
#define OPAMP_CSR_USERTRIM               (0x00040000) /*!< User trimming enable */
#define OPAMP_CSR_TRIMOFFSETP            (0x00F80000) /*!< Offset trimming value (PMOS) */
#define OPAMP_CSR_TRIMOFFSETN            (0x1F000000) /*!< Offset trimming value (NMOS) */
#define OPAMP_CSR_TSTREF                 (0x20000000) /*!< It enables the switch to put out the internal reference */
#define OPAMP_CSR_OUTCAL                 (0x40000000) /*!< OPAMP output status flag */
#define OPAMP_CSR_LOCK                   (0x80000000) /*!< OPAMP lock */


#define  CAN_MCR_INRQ                        (0x0001)            /*!<Initialization Request */
#define  CAN_MCR_SLEEP                       (0x0002)            /*!<Sleep Mode Request */
#define  CAN_MCR_TXFP                        (0x0004)            /*!<Transmit FIFO Priority */
#define  CAN_MCR_RFLM                        (0x0008)            /*!<Receive FIFO Locked Mode */
#define  CAN_MCR_NART                        (0x0010)            /*!<No Automatic Retransmission */
#define  CAN_MCR_AWUM                        (0x0020)            /*!<Automatic Wakeup Mode */
#define  CAN_MCR_ABOM                        (0x0040)            /*!<Automatic Bus-Off Management */
#define  CAN_MCR_TTCM                        (0x0080)            /*!<Time Triggered Communication Mode */
#define  CAN_MCR_RESET                       (0x8000)            /*!<bxCAN software master reset */

#define  CAN_MSR_INAK                        (0x0001)            /*!<Initialization Acknowledge */
#define  CAN_MSR_SLAK                        (0x0002)            /*!<Sleep Acknowledge */
#define  CAN_MSR_ERRI                        (0x0004)            /*!<Error Interrupt */
#define  CAN_MSR_WKUI                        (0x0008)            /*!<Wakeup Interrupt */
#define  CAN_MSR_SLAKI                       (0x0010)            /*!<Sleep Acknowledge Interrupt */
#define  CAN_MSR_TXM                         (0x0100)            /*!<Transmit Mode */
#define  CAN_MSR_RXM                         (0x0200)            /*!<Receive Mode */
#define  CAN_MSR_SAMP                        (0x0400)            /*!<Last Sample Point */
#define  CAN_MSR_RX                          (0x0800)            /*!<CAN Rx Signal */

#define  CAN_TSR_RQCP0                       (0x00000001)        /*!<Request Completed Mailbox0 */
#define  CAN_TSR_TXOK0                       (0x00000002)        /*!<Transmission OK of Mailbox0 */
#define  CAN_TSR_ALST0                       (0x00000004)        /*!<Arbitration Lost for Mailbox0 */
#define  CAN_TSR_TERR0                       (0x00000008)        /*!<Transmission Error of Mailbox0 */
#define  CAN_TSR_ABRQ0                       (0x00000080)        /*!<Abort Request for Mailbox0 */
#define  CAN_TSR_RQCP1                       (0x00000100)        /*!<Request Completed Mailbox1 */
#define  CAN_TSR_TXOK1                       (0x00000200)        /*!<Transmission OK of Mailbox1 */
#define  CAN_TSR_ALST1                       (0x00000400)        /*!<Arbitration Lost for Mailbox1 */
#define  CAN_TSR_TERR1                       (0x00000800)        /*!<Transmission Error of Mailbox1 */
#define  CAN_TSR_ABRQ1                       (0x00008000)        /*!<Abort Request for Mailbox 1 */
#define  CAN_TSR_RQCP2                       (0x00010000)        /*!<Request Completed Mailbox2 */
#define  CAN_TSR_TXOK2                       (0x00020000)        /*!<Transmission OK of Mailbox 2 */
#define  CAN_TSR_ALST2                       (0x00040000)        /*!<Arbitration Lost for mailbox 2 */
#define  CAN_TSR_TERR2                       (0x00080000)        /*!<Transmission Error of Mailbox 2 */
#define  CAN_TSR_ABRQ2                       (0x00800000)        /*!<Abort Request for Mailbox 2 */
#define  CAN_TSR_CODE                        (0x03000000)        /*!<Mailbox Code */

#define  CAN_TSR_TME                         (0x1C000000)        /*!<TME[2:0] bits */
#define  CAN_TSR_TME0                        (0x04000000)        /*!<Transmit Mailbox 0 Empty */
#define  CAN_TSR_TME1                        (0x08000000)        /*!<Transmit Mailbox 1 Empty */
#define  CAN_TSR_TME2                        (0x10000000)        /*!<Transmit Mailbox 2 Empty */

