the-nw1-group/acb-modules/acb-common/include/stm/stm32f30x.inc
#define  CAN_TSR_LOW                         (0xE0000000)        /*!<LOW[2:0] bits */
#define  CAN_TSR_LOW0                        (0x20000000)        /*!<Lowest Priority Flag for Mailbox 0 */
#define  CAN_TSR_LOW1                        (0x40000000)        /*!<Lowest Priority Flag for Mailbox 1 */
#define  CAN_TSR_LOW2                        (0x80000000)        /*!<Lowest Priority Flag for Mailbox 2 */

#define  CAN_RF0R_FMP0                       (0x03)               /*!<FIFO 0 Message Pending */
#define  CAN_RF0R_FULL0                      (0x08)               /*!<FIFO 0 Full */
#define  CAN_RF0R_FOVR0                      (0x10)               /*!<FIFO 0 Overrun */
#define  CAN_RF0R_RFOM0                      (0x20)               /*!<Release FIFO 0 Output Mailbox */

#define  CAN_RF1R_FMP1                       (0x03)               /*!<FIFO 1 Message Pending */
#define  CAN_RF1R_FULL1                      (0x08)               /*!<FIFO 1 Full */
#define  CAN_RF1R_FOVR1                      (0x10)               /*!<FIFO 1 Overrun */
#define  CAN_RF1R_RFOM1                      (0x20)               /*!<Release FIFO 1 Output Mailbox */

#define  CAN_IER_TMEIE                       (0x00000001)        /*!<Transmit Mailbox Empty Interrupt Enable */
#define  CAN_IER_FMPIE0                      (0x00000002)        /*!<FIFO Message Pending Interrupt Enable */
#define  CAN_IER_FFIE0                       (0x00000004)        /*!<FIFO Full Interrupt Enable */
#define  CAN_IER_FOVIE0                      (0x00000008)        /*!<FIFO Overrun Interrupt Enable */
#define  CAN_IER_FMPIE1                      (0x00000010)        /*!<FIFO Message Pending Interrupt Enable */
#define  CAN_IER_FFIE1                       (0x00000020)        /*!<FIFO Full Interrupt Enable */
#define  CAN_IER_FOVIE1                      (0x00000040)        /*!<FIFO Overrun Interrupt Enable */
#define  CAN_IER_EWGIE                       (0x00000100)        /*!<Error Warning Interrupt Enable */
#define  CAN_IER_EPVIE                       (0x00000200)        /*!<Error Passive Interrupt Enable */
#define  CAN_IER_BOFIE                       (0x00000400)        /*!<Bus-Off Interrupt Enable */
#define  CAN_IER_LECIE                       (0x00000800)        /*!<Last Error Code Interrupt Enable */
#define  CAN_IER_ERRIE                       (0x00008000)        /*!<Error Interrupt Enable */
#define  CAN_IER_WKUIE                       (0x00010000)        /*!<Wakeup Interrupt Enable */
#define  CAN_IER_SLKIE                       (0x00020000)        /*!<Sleep Interrupt Enable */

#define  CAN_ESR_EWGF                        (0x00000001)        /*!<Error Warning Flag */
#define  CAN_ESR_EPVF                        (0x00000002)        /*!<Error Passive Flag */
#define  CAN_ESR_BOFF                        (0x00000004)        /*!<Bus-Off Flag */

#define  CAN_ESR_LEC                         (0x00000070)        /*!<LEC[2:0] bits (Last Error Code) */
#define  CAN_ESR_LEC_0                       (0x00000010)        /*!<Bit 0 */
#define  CAN_ESR_LEC_1                       (0x00000020)        /*!<Bit 1 */
#define  CAN_ESR_LEC_2                       (0x00000040)        /*!<Bit 2 */

#define  CAN_ESR_TEC                         (0x00FF0000)        /*!<Least significant byte of the 9-bit Transmit Error Counter */
#define  CAN_ESR_REC                         (0xFF000000)        /*!<Receive Error Counter */

#define  CAN_BTR_BRP                         (0x000003FF)        /*!<Baud Rate Prescaler */
#define  CAN_BTR_TS1                         (0x000F0000)        /*!<Time Segment 1 */
#define  CAN_BTR_TS2                         (0x00700000)        /*!<Time Segment 2 */
#define  CAN_BTR_SJW                         (0x03000000)        /*!<Resynchronization Jump Width */
#define  CAN_BTR_LBKM                        (0x40000000)        /*!<Loop Back Mode (Debug) */
#define  CAN_BTR_SILM                        (0x80000000)        /*!<Silent Mode */

#define  CAN_TI0R_TXRQ                       (0x00000001)        /*!<Transmit Mailbox Request */
#define  CAN_TI0R_RTR                        (0x00000002)        /*!<Remote Transmission Request */
#define  CAN_TI0R_IDE                        (0x00000004)        /*!<Identifier Extension */
#define  CAN_TI0R_EXID                       (0x001FFFF8)        /*!<Extended Identifier */
#define  CAN_TI0R_STID                       (0xFFE00000)        /*!<Standard Identifier or Extended Identifier */

#define  CAN_TDT0R_DLC                       (0x0000000F)        /*!<Data Length Code */
#define  CAN_TDT0R_TGT                       (0x00000100)        /*!<Transmit Global Time */
#define  CAN_TDT0R_TIME                      (0xFFFF0000)        /*!<Message Time Stamp */

#define  CAN_TDL0R_DATA0                     (0x000000FF)        /*!<Data byte 0 */
#define  CAN_TDL0R_DATA1                     (0x0000FF00)        /*!<Data byte 1 */
#define  CAN_TDL0R_DATA2                     (0x00FF0000)        /*!<Data byte 2 */
#define  CAN_TDL0R_DATA3                     (0xFF000000)        /*!<Data byte 3 */

#define  CAN_TDH0R_DATA4                     (0x000000FF)        /*!<Data byte 4 */
#define  CAN_TDH0R_DATA5                     (0x0000FF00)        /*!<Data byte 5 */
#define  CAN_TDH0R_DATA6                     (0x00FF0000)        /*!<Data byte 6 */
#define  CAN_TDH0R_DATA7                     (0xFF000000)        /*!<Data byte 7 */

#define  CAN_TI1R_TXRQ                       (0x00000001)        /*!<Transmit Mailbox Request */
#define  CAN_TI1R_RTR                        (0x00000002)        /*!<Remote Transmission Request */
#define  CAN_TI1R_IDE                        (0x00000004)        /*!<Identifier Extension */
#define  CAN_TI1R_EXID                       (0x001FFFF8)        /*!<Extended Identifier */
#define  CAN_TI1R_STID                       (0xFFE00000)        /*!<Standard Identifier or Extended Identifier */

#define  CAN_TDT1R_DLC                       (0x0000000F)        /*!<Data Length Code */
#define  CAN_TDT1R_TGT                       (0x00000100)        /*!<Transmit Global Time */
#define  CAN_TDT1R_TIME                      (0xFFFF0000)        /*!<Message Time Stamp */

#define  CAN_TDL1R_DATA0                     (0x000000FF)        /*!<Data byte 0 */
#define  CAN_TDL1R_DATA1                     (0x0000FF00)        /*!<Data byte 1 */
#define  CAN_TDL1R_DATA2                     (0x00FF0000)        /*!<Data byte 2 */
#define  CAN_TDL1R_DATA3                     (0xFF000000)        /*!<Data byte 3 */

#define  CAN_TDH1R_DATA4                     (0x000000FF)        /*!<Data byte 4 */
#define  CAN_TDH1R_DATA5                     (0x0000FF00)        /*!<Data byte 5 */
#define  CAN_TDH1R_DATA6                     (0x00FF0000)        /*!<Data byte 6 */
#define  CAN_TDH1R_DATA7                     (0xFF000000)        /*!<Data byte 7 */

#define  CAN_TI2R_TXRQ                       (0x00000001)        /*!<Transmit Mailbox Request */
#define  CAN_TI2R_RTR                        (0x00000002)        /*!<Remote Transmission Request */
#define  CAN_TI2R_IDE                        (0x00000004)        /*!<Identifier Extension */
#define  CAN_TI2R_EXID                       (0x001FFFF8)        /*!<Extended identifier */
#define  CAN_TI2R_STID                       (0xFFE00000)        /*!<Standard Identifier or Extended Identifier */

#define  CAN_TDT2R_DLC                       (0x0000000F)        /*!<Data Length Code */
#define  CAN_TDT2R_TGT                       (0x00000100)        /*!<Transmit Global Time */
#define  CAN_TDT2R_TIME                      (0xFFFF0000)        /*!<Message Time Stamp */

#define  CAN_TDL2R_DATA0                     (0x000000FF)        /*!<Data byte 0 */
#define  CAN_TDL2R_DATA1                     (0x0000FF00)        /*!<Data byte 1 */
#define  CAN_TDL2R_DATA2                     (0x00FF0000)        /*!<Data byte 2 */
#define  CAN_TDL2R_DATA3                     (0xFF000000)        /*!<Data byte 3 */

#define  CAN_TDH2R_DATA4                     (0x000000FF)        /*!<Data byte 4 */
#define  CAN_TDH2R_DATA5                     (0x0000FF00)        /*!<Data byte 5 */
#define  CAN_TDH2R_DATA6                     (0x00FF0000)        /*!<Data byte 6 */
#define  CAN_TDH2R_DATA7                     (0xFF000000)        /*!<Data byte 7 */

#define  CAN_RI0R_RTR                        (0x00000002)        /*!<Remote Transmission Request */
#define  CAN_RI0R_IDE                        (0x00000004)        /*!<Identifier Extension */
#define  CAN_RI0R_EXID                       (0x001FFFF8)        /*!<Extended Identifier */
#define  CAN_RI0R_STID                       (0xFFE00000)        /*!<Standard Identifier or Extended Identifier */

#define  CAN_RDT0R_DLC                       (0x0000000F)        /*!<Data Length Code */
#define  CAN_RDT0R_FMI                       (0x0000FF00)        /*!<Filter Match Index */
#define  CAN_RDT0R_TIME                      (0xFFFF0000)        /*!<Message Time Stamp */

