the-nw1-group/acb-modules/acb-common/include/stm/stm32f30x.inc
#define  FLASH_ACR_LATENCY                   (0x03)               /*!< LATENCY[2:0] bits (Latency) */
#define  FLASH_ACR_LATENCY_0                 (0x01)               /*!< Bit 0 */
#define  FLASH_ACR_LATENCY_1                 (0x02)               /*!< Bit 1 */

#define  FLASH_ACR_HLFCYA                    (0x08)               /*!< Flash Half Cycle Access Enable */
#define  FLASH_ACR_PRFTBE                    (0x10)               /*!< Prefetch Buffer Enable */
#define  FLASH_ACR_PRFTBS                    (0x20)  

#define  FLASH_KEYR_FKEYR                    (0xFFFFFFFF)        /*!< FPEC Key */

#define  RDP_KEY                             (0x00A5)            /*!< RDP Key */
#define  FLASH_KEY1                          (0x45670123)        /*!< FPEC Key1 */
#define  FLASH_KEY2                          (0xCDEF89AB)        /*!< FPEC Key2 */

#define  FLASH_OPTKEYR_OPTKEYR               (0xFFFFFFFF)        /*!< Option Byte Key */

#define  FLASH_OPTKEY1                       FLASH_KEY1                    /*!< Option Byte Key1 */
#define  FLASH_OPTKEY2                       FLASH_KEY2                    /*!< Option Byte Key2 */

#define  FLASH_SR_BSY                        (0x00000001)        /*!< Busy */
#define  FLASH_SR_PGERR                      (0x00000004)        /*!< Programming Error */
#define  FLASH_SR_WRPERR                     (0x00000010)        /*!< Write Protection Error */
#define  FLASH_SR_EOP                        (0x00000020)        /*!< End of operation */

#define  FLASH_CR_PG                         (0x00000001)        /*!< Programming */
#define  FLASH_CR_PER                        (0x00000002)        /*!< Page Erase */
#define  FLASH_CR_MER                        (0x00000004)        /*!< Mass Erase */
#define  FLASH_CR_OPTPG                      (0x00000010)        /*!< Option Byte Programming */
#define  FLASH_CR_OPTER                      (0x00000020)        /*!< Option Byte Erase */
#define  FLASH_CR_STRT                       (0x00000040)        /*!< Start */
#define  FLASH_CR_LOCK                       (0x00000080)        /*!< Lock */
#define  FLASH_CR_OPTWRE                     (0x00000200)        /*!< Option Bytes Write Enable */
#define  FLASH_CR_ERRIE                      (0x00000400)        /*!< Error Interrupt Enable */
#define  FLASH_CR_EOPIE                      (0x00001000)        /*!< End of operation interrupt enable */
#define  FLASH_CR_OBL_LAUNCH                 (0x00002000)        /*!< OptionBytes Loader Launch */

#define  FLASH_AR_FAR                        (0xFFFFFFFF)        /*!< Flash Address */

#define  FLASH_OBR_OPTERR                    (0x00000001)        /*!< Option Byte Error */
#define  FLASH_OBR_RDPRT1                    (0x00000002)        /*!< Read protection Level 1 */
#define  FLASH_OBR_RDPRT2                    (0x00000004)        /*!< Read protection Level 2 */

#ifdef STM32F303xE
#define  FLASH_OBR_USER                      (0x00007700)        /*!< User Option Bytes */
#else
#define  FLASH_OBR_USER                      (0x00003700)        /*!< User Option Bytes */
#endif /* STM32F303xE */

#define  FLASH_OBR_IWDG_SW                   (0x00000100)        /*!< IWDG SW */
#define  FLASH_OBR_nRST_STOP                 (0x00000200)        /*!< nRST_STOP */
#define  FLASH_OBR_nRST_STDBY                (0x00000400)        /*!< nRST_STDBY */
#define  FLASH_OBR_nBOOT1                    (0x00001000)        /*!< nBOOT1 */
#define  FLASH_OBR_VDDA_MONITOR              (0x00002000)        /*!< VDDA_MONITOR */
#define  FLASH_OBR_SRAM_PE                   (0x00004000)        /*!< SRAM_PE */


#define  FLASH_WRPR_WRP                        (0xFFFFFFFF)      /*!< Write Protect */


#define  OB_RDP_RDP                          (0x000000FF)        /*!< Read protection option byte */
#define  OB_RDP_nRDP                         (0x0000FF00)        /*!< Read protection complemented option byte */

#define  OB_USER_USER                        (0x00FF0000)        /*!< User option byte */
#define  OB_USER_nUSER                       (0xFF000000)        /*!< User complemented option byte */

#define  OB_WRP0_WRP0                        (0x000000FF)        /*!< Flash memory write protection option bytes */
#define  OB_WRP0_nWRP0                       (0x0000FF00)        /*!< Flash memory write protection complemented option bytes */

#define  OB_WRP1_WRP1                        (0x00FF0000)        /*!< Flash memory write protection option bytes */
#define  OB_WRP1_nWRP1                       (0xFF000000)        /*!< Flash memory write protection complemented option bytes */

#define  OB_WRP2_WRP2                        (0x000000FF)        /*!< Flash memory write protection option bytes */
#define  OB_WRP2_nWRP2                       (0x0000FF00)        /*!< Flash memory write protection complemented option bytes */

#define  OB_WRP3_WRP3                        (0x00FF0000)        /*!< Flash memory write protection option bytes */
#define  OB_WRP3_nWRP3                       (0xFF000000)        /*!< Flash memory write protection complemented option bytes */

#define  FMC_BCR1_MBKEN                     (0x00000001)        /*!<Memory bank enable bit                 */
#define  FMC_BCR1_MUXEN                     (0x00000002)        /*!<Address/data multiplexing enable bit   */

#define  FMC_BCR1_MTYP                      (0x0000000C)        /*!<MTYP[1:0] bits (Memory type)           */
#define  FMC_BCR1_MTYP_0                    (0x00000004)        /*!<Bit 0 */
#define  FMC_BCR1_MTYP_1                    (0x00000008)        /*!<Bit 1 */

#define  FMC_BCR1_MWID                      (0x00000030)        /*!<MWID[1:0] bits (Memory data bus width) */
#define  FMC_BCR1_MWID_0                    (0x00000010)        /*!<Bit 0 */
#define  FMC_BCR1_MWID_1                    (0x00000020)        /*!<Bit 1 */

#define  FMC_BCR1_FACCEN                    (0x00000040)        /*!<Flash access enable        */
#define  FMC_BCR1_BURSTEN                   (0x00000100)        /*!<Burst enable bit           */
#define  FMC_BCR1_WAITPOL                   (0x00000200)        /*!<Wait signal polarity bit   */
#define  FMC_BCR1_WRAPMOD                   (0x00000400)        /*!<Wrapped burst mode support */
#define  FMC_BCR1_WAITCFG                   (0x00000800)        /*!<Wait timing configuration  */
#define  FMC_BCR1_WREN                      (0x00001000)        /*!<Write enable bit           */
#define  FMC_BCR1_WAITEN                    (0x00002000)        /*!<Wait enable bit            */
#define  FMC_BCR1_EXTMOD                    (0x00004000)        /*!<Extended mode enable       */
#define  FMC_BCR1_ASYNCWAIT                 (0x00008000)        /*!<Asynchronous wait          */
#define  FMC_BCR1_CBURSTRW                  (0x00080000)        /*!<Write burst enable         */
#define  FMC_BCR1_CCLKEN                    (0x00100000)        /*!<Conitnuous clock enable     */

#define  FMC_BCR2_MBKEN                     (0x00000001)        /*!<Memory bank enable bit                 */
#define  FMC_BCR2_MUXEN                     (0x00000002)        /*!<Address/data multiplexing enable bit   */

#define  FMC_BCR2_MTYP                      (0x0000000C)        /*!<MTYP[1:0] bits (Memory type)           */
#define  FMC_BCR2_MTYP_0                    (0x00000004)        /*!<Bit 0 */
#define  FMC_BCR2_MTYP_1                    (0x00000008)        /*!<Bit 1 */

#define  FMC_BCR2_MWID                      (0x00000030)        /*!<MWID[1:0] bits (Memory data bus width) */
#define  FMC_BCR2_MWID_0                    (0x00000010)        /*!<Bit 0 */
#define  FMC_BCR2_MWID_1                    (0x00000020)        /*!<Bit 1 */

#define  FMC_BCR2_FACCEN                    (0x00000040)        /*!<Flash access enable        */
#define  FMC_BCR2_BURSTEN                   (0x00000100)        /*!<Burst enable bit           */
#define  FMC_BCR2_WAITPOL                   (0x00000200)        /*!<Wait signal polarity bit   */
#define  FMC_BCR2_WRAPMOD                   (0x00000400)        /*!<Wrapped burst mode support */
#define  FMC_BCR2_WAITCFG                   (0x00000800)        /*!<Wait timing configuration  */
#define  FMC_BCR2_WREN                      (0x00001000)        /*!<Write enable bit           */
#define  FMC_BCR2_WAITEN                    (0x00002000)        /*!<Wait enable bit            */
#define  FMC_BCR2_EXTMOD                    (0x00004000)        /*!<Extended mode enable       */
#define  FMC_BCR2_ASYNCWAIT                 (0x00008000)        /*!<Asynchronous wait          */
#define  FMC_BCR2_CBURSTRW                  (0x00080000)        /*!<Write burst enable         */

