the-nw1-group/acb-modules/acb-common/include/stm/stm32f30x.inc
#define  FMC_BCR3_MBKEN                     (0x00000001)        /*!<Memory bank enable bit                 */
#define  FMC_BCR3_MUXEN                     (0x00000002)        /*!<Address/data multiplexing enable bit   */

#define  FMC_BCR3_MTYP                      (0x0000000C)        /*!<MTYP[1:0] bits (Memory type)           */
#define  FMC_BCR3_MTYP_0                    (0x00000004)        /*!<Bit 0 */
#define  FMC_BCR3_MTYP_1                    (0x00000008)        /*!<Bit 1 */

#define  FMC_BCR3_MWID                      (0x00000030)        /*!<MWID[1:0] bits (Memory data bus width) */
#define  FMC_BCR3_MWID_0                    (0x00000010)        /*!<Bit 0 */
#define  FMC_BCR3_MWID_1                    (0x00000020)        /*!<Bit 1 */

#define  FMC_BCR3_FACCEN                    (0x00000040)        /*!<Flash access enable        */
#define  FMC_BCR3_BURSTEN                   (0x00000100)        /*!<Burst enable bit           */
#define  FMC_BCR3_WAITPOL                   (0x00000200)        /*!<Wait signal polarity bit   */
#define  FMC_BCR3_WRAPMOD                   (0x00000400)        /*!<Wrapped burst mode support */
#define  FMC_BCR3_WAITCFG                   (0x00000800)        /*!<Wait timing configuration  */
#define  FMC_BCR3_WREN                      (0x00001000)        /*!<Write enable bit           */
#define  FMC_BCR3_WAITEN                    (0x00002000)        /*!<Wait enable bit            */
#define  FMC_BCR3_EXTMOD                    (0x00004000)        /*!<Extended mode enable       */
#define  FMC_BCR3_ASYNCWAIT                 (0x00008000)        /*!<Asynchronous wait          */
#define  FMC_BCR3_CBURSTRW                  (0x00080000)        /*!<Write burst enable         */

#define  FMC_BCR4_MBKEN                     (0x00000001)        /*!<Memory bank enable bit                 */
#define  FMC_BCR4_MUXEN                     (0x00000002)        /*!<Address/data multiplexing enable bit   */

#define  FMC_BCR4_MTYP                      (0x0000000C)        /*!<MTYP[1:0] bits (Memory type)           */
#define  FMC_BCR4_MTYP_0                    (0x00000004)        /*!<Bit 0 */
#define  FMC_BCR4_MTYP_1                    (0x00000008)        /*!<Bit 1 */

#define  FMC_BCR4_MWID                      (0x00000030)        /*!<MWID[1:0] bits (Memory data bus width) */
#define  FMC_BCR4_MWID_0                    (0x00000010)        /*!<Bit 0 */
#define  FMC_BCR4_MWID_1                    (0x00000020)        /*!<Bit 1 */

#define  FMC_BCR4_FACCEN                    (0x00000040)        /*!<Flash access enable        */
#define  FMC_BCR4_BURSTEN                   (0x00000100)        /*!<Burst enable bit           */
#define  FMC_BCR4_WAITPOL                   (0x00000200)        /*!<Wait signal polarity bit   */
#define  FMC_BCR4_WRAPMOD                   (0x00000400)        /*!<Wrapped burst mode support */
#define  FMC_BCR4_WAITCFG                   (0x00000800)        /*!<Wait timing configuration  */
#define  FMC_BCR4_WREN                      (0x00001000)        /*!<Write enable bit           */
#define  FMC_BCR4_WAITEN                    (0x00002000)        /*!<Wait enable bit            */
#define  FMC_BCR4_EXTMOD                    (0x00004000)        /*!<Extended mode enable       */
#define  FMC_BCR4_ASYNCWAIT                 (0x00008000)        /*!<Asynchronous wait          */
#define  FMC_BCR4_CBURSTRW                  (0x00080000)        /*!<Write burst enable         */

#define  FMC_BTR1_ADDSET                    (0x0000000F)        /*!<ADDSET[3:0] bits (Address setup phase duration) */
#define  FMC_BTR1_ADDSET_0                  (0x00000001)        /*!<Bit 0 */
#define  FMC_BTR1_ADDSET_1                  (0x00000002)        /*!<Bit 1 */
#define  FMC_BTR1_ADDSET_2                  (0x00000004)        /*!<Bit 2 */
#define  FMC_BTR1_ADDSET_3                  (0x00000008)        /*!<Bit 3 */

#define  FMC_BTR1_ADDHLD                    (0x000000F0)        /*!<ADDHLD[3:0] bits (Address-hold phase duration)  */
#define  FMC_BTR1_ADDHLD_0                  (0x00000010)        /*!<Bit 0 */
#define  FMC_BTR1_ADDHLD_1                  (0x00000020)        /*!<Bit 1 */
#define  FMC_BTR1_ADDHLD_2                  (0x00000040)        /*!<Bit 2 */
#define  FMC_BTR1_ADDHLD_3                  (0x00000080)        /*!<Bit 3 */

#define  FMC_BTR1_DATAST                    (0x0000FF00)        /*!<DATAST [3:0] bits (Data-phase duration) */
#define  FMC_BTR1_DATAST_0                  (0x00000100)        /*!<Bit 0 */
#define  FMC_BTR1_DATAST_1                  (0x00000200)        /*!<Bit 1 */
#define  FMC_BTR1_DATAST_2                  (0x00000400)        /*!<Bit 2 */
#define  FMC_BTR1_DATAST_3                  (0x00000800)        /*!<Bit 3 */
#define  FMC_BTR1_DATAST_4                  (0x00001000)        /*!<Bit 4 */
#define  FMC_BTR1_DATAST_5                  (0x00002000)        /*!<Bit 5 */
#define  FMC_BTR1_DATAST_6                  (0x00004000)        /*!<Bit 6 */
#define  FMC_BTR1_DATAST_7                  (0x00008000)        /*!<Bit 7 */

#define  FMC_BTR1_BUSTURN                   (0x000F0000)        /*!<BUSTURN[3:0] bits (Bus turnaround phase duration) */
#define  FMC_BTR1_BUSTURN_0                 (0x00010000)        /*!<Bit 0 */
#define  FMC_BTR1_BUSTURN_1                 (0x00020000)        /*!<Bit 1 */
#define  FMC_BTR1_BUSTURN_2                 (0x00040000)        /*!<Bit 2 */
#define  FMC_BTR1_BUSTURN_3                 (0x00080000)        /*!<Bit 3 */

#define  FMC_BTR1_CLKDIV                    (0x00F00000)        /*!<CLKDIV[3:0] bits (Clock divide ratio) */
#define  FMC_BTR1_CLKDIV_0                  (0x00100000)        /*!<Bit 0 */
#define  FMC_BTR1_CLKDIV_1                  (0x00200000)        /*!<Bit 1 */
#define  FMC_BTR1_CLKDIV_2                  (0x00400000)        /*!<Bit 2 */
#define  FMC_BTR1_CLKDIV_3                  (0x00800000)        /*!<Bit 3 */

#define  FMC_BTR1_DATLAT                    (0x0F000000)        /*!<DATLA[3:0] bits (Data latency) */
#define  FMC_BTR1_DATLAT_0                  (0x01000000)        /*!<Bit 0 */
#define  FMC_BTR1_DATLAT_1                  (0x02000000)        /*!<Bit 1 */
#define  FMC_BTR1_DATLAT_2                  (0x04000000)        /*!<Bit 2 */
#define  FMC_BTR1_DATLAT_3                  (0x08000000)        /*!<Bit 3 */

#define  FMC_BTR1_ACCMOD                    (0x30000000)        /*!<ACCMOD[1:0] bits (Access mode) */
#define  FMC_BTR1_ACCMOD_0                  (0x10000000)        /*!<Bit 0 */
#define  FMC_BTR1_ACCMOD_1                  (0x20000000)        /*!<Bit 1 */

#define  FMC_BTR2_ADDSET                    (0x0000000F)        /*!<ADDSET[3:0] bits (Address setup phase duration) */
#define  FMC_BTR2_ADDSET_0                  (0x00000001)        /*!<Bit 0 */
#define  FMC_BTR2_ADDSET_1                  (0x00000002)        /*!<Bit 1 */
#define  FMC_BTR2_ADDSET_2                  (0x00000004)        /*!<Bit 2 */
#define  FMC_BTR2_ADDSET_3                  (0x00000008)        /*!<Bit 3 */

#define  FMC_BTR2_ADDHLD                    (0x000000F0)        /*!<ADDHLD[3:0] bits (Address-hold phase duration) */
#define  FMC_BTR2_ADDHLD_0                  (0x00000010)        /*!<Bit 0 */
#define  FMC_BTR2_ADDHLD_1                  (0x00000020)        /*!<Bit 1 */
#define  FMC_BTR2_ADDHLD_2                  (0x00000040)        /*!<Bit 2 */
#define  FMC_BTR2_ADDHLD_3                  (0x00000080)        /*!<Bit 3 */

#define  FMC_BTR2_DATAST                    (0x0000FF00)        /*!<DATAST [3:0] bits (Data-phase duration) */
#define  FMC_BTR2_DATAST_0                  (0x00000100)        /*!<Bit 0 */
#define  FMC_BTR2_DATAST_1                  (0x00000200)        /*!<Bit 1 */
#define  FMC_BTR2_DATAST_2                  (0x00000400)        /*!<Bit 2 */
#define  FMC_BTR2_DATAST_3                  (0x00000800)        /*!<Bit 3 */
#define  FMC_BTR2_DATAST_4                  (0x00001000)        /*!<Bit 4 */
#define  FMC_BTR2_DATAST_5                  (0x00002000)        /*!<Bit 5 */
#define  FMC_BTR2_DATAST_6                  (0x00004000)        /*!<Bit 6 */
#define  FMC_BTR2_DATAST_7                  (0x00008000)        /*!<Bit 7 */

