the-nw1-group/acb-modules/acb-common/include/stm/stm32f30x.inc
#define  FMC_BTR2_BUSTURN                   (0x000F0000)        /*!<BUSTURN[3:0] bits (Bus turnaround phase duration) */
#define  FMC_BTR2_BUSTURN_0                 (0x00010000)        /*!<Bit 0 */
#define  FMC_BTR2_BUSTURN_1                 (0x00020000)        /*!<Bit 1 */
#define  FMC_BTR2_BUSTURN_2                 (0x00040000)        /*!<Bit 2 */
#define  FMC_BTR2_BUSTURN_3                 (0x00080000)        /*!<Bit 3 */

#define  FMC_BTR2_CLKDIV                    (0x00F00000)        /*!<CLKDIV[3:0] bits (Clock divide ratio) */
#define  FMC_BTR2_CLKDIV_0                  (0x00100000)        /*!<Bit 0 */
#define  FMC_BTR2_CLKDIV_1                  (0x00200000)        /*!<Bit 1 */
#define  FMC_BTR2_CLKDIV_2                  (0x00400000)        /*!<Bit 2 */
#define  FMC_BTR2_CLKDIV_3                  (0x00800000)        /*!<Bit 3 */

#define  FMC_BTR2_DATLAT                    (0x0F000000)        /*!<DATLA[3:0] bits (Data latency) */
#define  FMC_BTR2_DATLAT_0                  (0x01000000)        /*!<Bit 0 */
#define  FMC_BTR2_DATLAT_1                  (0x02000000)        /*!<Bit 1 */
#define  FMC_BTR2_DATLAT_2                  (0x04000000)        /*!<Bit 2 */
#define  FMC_BTR2_DATLAT_3                  (0x08000000)        /*!<Bit 3 */

#define  FMC_BTR2_ACCMOD                    (0x30000000)        /*!<ACCMOD[1:0] bits (Access mode) */
#define  FMC_BTR2_ACCMOD_0                  (0x10000000)        /*!<Bit 0 */
#define  FMC_BTR2_ACCMOD_1                  (0x20000000)        /*!<Bit 1 */

#define  FMC_BTR3_ADDSET                    (0x0000000F)        /*!<ADDSET[3:0] bits (Address setup phase duration) */
#define  FMC_BTR3_ADDSET_0                  (0x00000001)        /*!<Bit 0 */
#define  FMC_BTR3_ADDSET_1                  (0x00000002)        /*!<Bit 1 */
#define  FMC_BTR3_ADDSET_2                  (0x00000004)        /*!<Bit 2 */
#define  FMC_BTR3_ADDSET_3                  (0x00000008)        /*!<Bit 3 */

#define  FMC_BTR3_ADDHLD                    (0x000000F0)        /*!<ADDHLD[3:0] bits (Address-hold phase duration) */
#define  FMC_BTR3_ADDHLD_0                  (0x00000010)        /*!<Bit 0 */
#define  FMC_BTR3_ADDHLD_1                  (0x00000020)        /*!<Bit 1 */
#define  FMC_BTR3_ADDHLD_2                  (0x00000040)        /*!<Bit 2 */
#define  FMC_BTR3_ADDHLD_3                  (0x00000080)        /*!<Bit 3 */

#define  FMC_BTR3_DATAST                    (0x0000FF00)        /*!<DATAST [3:0] bits (Data-phase duration) */
#define  FMC_BTR3_DATAST_0                  (0x00000100)        /*!<Bit 0 */
#define  FMC_BTR3_DATAST_1                  (0x00000200)        /*!<Bit 1 */
#define  FMC_BTR3_DATAST_2                  (0x00000400)        /*!<Bit 2 */
#define  FMC_BTR3_DATAST_3                  (0x00000800)        /*!<Bit 3 */
#define  FMC_BTR3_DATAST_4                  (0x00001000)        /*!<Bit 4 */
#define  FMC_BTR3_DATAST_5                  (0x00002000)        /*!<Bit 5 */
#define  FMC_BTR3_DATAST_6                  (0x00004000)        /*!<Bit 6 */
#define  FMC_BTR3_DATAST_7                  (0x00008000)        /*!<Bit 7 */

#define  FMC_BTR3_BUSTURN                   (0x000F0000)        /*!<BUSTURN[3:0] bits (Bus turnaround phase duration) */
#define  FMC_BTR3_BUSTURN_0                 (0x00010000)        /*!<Bit 0 */
#define  FMC_BTR3_BUSTURN_1                 (0x00020000)        /*!<Bit 1 */
#define  FMC_BTR3_BUSTURN_2                 (0x00040000)        /*!<Bit 2 */
#define  FMC_BTR3_BUSTURN_3                 (0x00080000)        /*!<Bit 3 */

#define  FMC_BTR3_CLKDIV                    (0x00F00000)        /*!<CLKDIV[3:0] bits (Clock divide ratio) */
#define  FMC_BTR3_CLKDIV_0                  (0x00100000)        /*!<Bit 0 */
#define  FMC_BTR3_CLKDIV_1                  (0x00200000)        /*!<Bit 1 */
#define  FMC_BTR3_CLKDIV_2                  (0x00400000)        /*!<Bit 2 */
#define  FMC_BTR3_CLKDIV_3                  (0x00800000)        /*!<Bit 3 */

#define  FMC_BTR3_DATLAT                    (0x0F000000)        /*!<DATLA[3:0] bits (Data latency) */
#define  FMC_BTR3_DATLAT_0                  (0x01000000)        /*!<Bit 0 */
#define  FMC_BTR3_DATLAT_1                  (0x02000000)        /*!<Bit 1 */
#define  FMC_BTR3_DATLAT_2                  (0x04000000)        /*!<Bit 2 */
#define  FMC_BTR3_DATLAT_3                  (0x08000000)        /*!<Bit 3 */

#define  FMC_BTR3_ACCMOD                    (0x30000000)        /*!<ACCMOD[1:0] bits (Access mode) */
#define  FMC_BTR3_ACCMOD_0                  (0x10000000)        /*!<Bit 0 */
#define  FMC_BTR3_ACCMOD_1                  (0x20000000)        /*!<Bit 1 */

#define  FMC_BTR4_ADDSET                    (0x0000000F)        /*!<ADDSET[3:0] bits (Address setup phase duration) */
#define  FMC_BTR4_ADDSET_0                  (0x00000001)        /*!<Bit 0 */
#define  FMC_BTR4_ADDSET_1                  (0x00000002)        /*!<Bit 1 */
#define  FMC_BTR4_ADDSET_2                  (0x00000004)        /*!<Bit 2 */
#define  FMC_BTR4_ADDSET_3                  (0x00000008)        /*!<Bit 3 */

#define  FMC_BTR4_ADDHLD                    (0x000000F0)        /*!<ADDHLD[3:0] bits (Address-hold phase duration) */
#define  FMC_BTR4_ADDHLD_0                  (0x00000010)        /*!<Bit 0 */
#define  FMC_BTR4_ADDHLD_1                  (0x00000020)        /*!<Bit 1 */
#define  FMC_BTR4_ADDHLD_2                  (0x00000040)        /*!<Bit 2 */
#define  FMC_BTR4_ADDHLD_3                  (0x00000080)        /*!<Bit 3 */

#define  FMC_BTR4_DATAST                    (0x0000FF00)        /*!<DATAST [3:0] bits (Data-phase duration) */
#define  FMC_BTR4_DATAST_0                  (0x00000100)        /*!<Bit 0 */
#define  FMC_BTR4_DATAST_1                  (0x00000200)        /*!<Bit 1 */
#define  FMC_BTR4_DATAST_2                  (0x00000400)        /*!<Bit 2 */
#define  FMC_BTR4_DATAST_3                  (0x00000800)        /*!<Bit 3 */
#define  FMC_BTR4_DATAST_4                  (0x00001000)        /*!<Bit 4 */
#define  FMC_BTR4_DATAST_5                  (0x00002000)        /*!<Bit 5 */
#define  FMC_BTR4_DATAST_6                  (0x00004000)        /*!<Bit 6 */
#define  FMC_BTR4_DATAST_7                  (0x00008000)        /*!<Bit 7 */

#define  FMC_BTR4_BUSTURN                   (0x000F0000)        /*!<BUSTURN[3:0] bits (Bus turnaround phase duration) */
#define  FMC_BTR4_BUSTURN_0                 (0x00010000)        /*!<Bit 0 */
#define  FMC_BTR4_BUSTURN_1                 (0x00020000)        /*!<Bit 1 */
#define  FMC_BTR4_BUSTURN_2                 (0x00040000)        /*!<Bit 2 */
#define  FMC_BTR4_BUSTURN_3                 (0x00080000)        /*!<Bit 3 */

#define  FMC_BTR4_CLKDIV                    (0x00F00000)        /*!<CLKDIV[3:0] bits (Clock divide ratio) */
#define  FMC_BTR4_CLKDIV_0                  (0x00100000)        /*!<Bit 0 */
#define  FMC_BTR4_CLKDIV_1                  (0x00200000)        /*!<Bit 1 */
#define  FMC_BTR4_CLKDIV_2                  (0x00400000)        /*!<Bit 2 */
#define  FMC_BTR4_CLKDIV_3                  (0x00800000)        /*!<Bit 3 */

#define  FMC_BTR4_DATLAT                    (0x0F000000)        /*!<DATLA[3:0] bits (Data latency) */
#define  FMC_BTR4_DATLAT_0                  (0x01000000)        /*!<Bit 0 */
#define  FMC_BTR4_DATLAT_1                  (0x02000000)        /*!<Bit 1 */
#define  FMC_BTR4_DATLAT_2                  (0x04000000)        /*!<Bit 2 */
#define  FMC_BTR4_DATLAT_3                  (0x08000000)        /*!<Bit 3 */

#define  FMC_BTR4_ACCMOD                    (0x30000000)        /*!<ACCMOD[1:0] bits (Access mode) */
#define  FMC_BTR4_ACCMOD_0                  (0x10000000)        /*!<Bit 0 */
#define  FMC_BTR4_ACCMOD_1                  (0x20000000)        /*!<Bit 1 */

#define  FMC_BWTR1_ADDSET                   (0x0000000F)        /*!<ADDSET[3:0] bits (Address setup phase duration) */
#define  FMC_BWTR1_ADDSET_0                 (0x00000001)        /*!<Bit 0 */
#define  FMC_BWTR1_ADDSET_1                 (0x00000002)        /*!<Bit 1 */
#define  FMC_BWTR1_ADDSET_2                 (0x00000004)        /*!<Bit 2 */
#define  FMC_BWTR1_ADDSET_3                 (0x00000008)        /*!<Bit 3 */

