the-nw1-group/acb-modules/acb-common/include/stm/stm32f30x.inc
#define  FMC_BWTR4_ADDHLD                   (0x000000F0)        /*!<ADDHLD[3:0] bits (Address-hold phase duration) */
#define  FMC_BWTR4_ADDHLD_0                 (0x00000010)        /*!<Bit 0 */
#define  FMC_BWTR4_ADDHLD_1                 (0x00000020)        /*!<Bit 1 */
#define  FMC_BWTR4_ADDHLD_2                 (0x00000040)        /*!<Bit 2 */
#define  FMC_BWTR4_ADDHLD_3                 (0x00000080)        /*!<Bit 3 */

#define  FMC_BWTR4_DATAST                   (0x0000FF00)        /*!<DATAST [3:0] bits (Data-phase duration) */
#define  FMC_BWTR4_DATAST_0                 (0x00000100)        /*!<Bit 0 */
#define  FMC_BWTR4_DATAST_1                 (0x00000200)        /*!<Bit 1 */
#define  FMC_BWTR4_DATAST_2                 (0x00000400)        /*!<Bit 2 */
#define  FMC_BWTR4_DATAST_3                 (0x00000800)        /*!<Bit 3 */
#define  FMC_BWTR4_DATAST_4                 (0x00001000)        /*!<Bit 4 */
#define  FMC_BWTR4_DATAST_5                 (0x00002000)        /*!<Bit 5 */
#define  FMC_BWTR4_DATAST_6                 (0x00004000)        /*!<Bit 6 */
#define  FMC_BWTR4_DATAST_7                 (0x00008000)        /*!<Bit 7 */

#define  FMC_BWTR4_CLKDIV                   (0x00F00000)        /*!<CLKDIV[3:0] bits (Clock divide ratio) */
#define  FMC_BWTR4_CLKDIV_0                 (0x00100000)        /*!<Bit 0 */
#define  FMC_BWTR4_CLKDIV_1                 (0x00200000)        /*!<Bit 1 */
#define  FMC_BWTR4_CLKDIV_2                 (0x00400000)        /*!<Bit 2 */
#define  FMC_BWTR4_CLKDIV_3                 (0x00800000)        /*!<Bit 3 */

#define  FMC_BWTR4_DATLAT                   (0x0F000000)        /*!<DATLA[3:0] bits (Data latency) */
#define  FMC_BWTR4_DATLAT_0                 (0x01000000)        /*!<Bit 0 */
#define  FMC_BWTR4_DATLAT_1                 (0x02000000)        /*!<Bit 1 */
#define  FMC_BWTR4_DATLAT_2                 (0x04000000)        /*!<Bit 2 */
#define  FMC_BWTR4_DATLAT_3                 (0x08000000)        /*!<Bit 3 */

#define  FMC_BWTR4_ACCMOD                   (0x30000000)        /*!<ACCMOD[1:0] bits (Access mode) */
#define  FMC_BWTR4_ACCMOD_0                 (0x10000000)        /*!<Bit 0 */
#define  FMC_BWTR4_ACCMOD_1                 (0x20000000)        /*!<Bit 1 */

#define  FMC_PCR2_PWAITEN                   (0x00000002)        /*!<Wait feature enable bit                   */
#define  FMC_PCR2_PBKEN                     (0x00000004)        /*!<PC Card/NAND Flash memory bank enable bit */
#define  FMC_PCR2_PTYP                      (0x00000008)        /*!<Memory type                               */

#define  FMC_PCR2_PWID                      (0x00000030)        /*!<PWID[1:0] bits (NAND Flash databus width) */
#define  FMC_PCR2_PWID_0                    (0x00000010)        /*!<Bit 0 */
#define  FMC_PCR2_PWID_1                    (0x00000020)        /*!<Bit 1 */

#define  FMC_PCR2_ECCEN                     (0x00000040)        /*!<ECC computation logic enable bit          */

#define  FMC_PCR2_TCLR                      (0x00001E00)        /*!<TCLR[3:0] bits (CLE to RE delay)          */
#define  FMC_PCR2_TCLR_0                    (0x00000200)        /*!<Bit 0 */
#define  FMC_PCR2_TCLR_1                    (0x00000400)        /*!<Bit 1 */
#define  FMC_PCR2_TCLR_2                    (0x00000800)        /*!<Bit 2 */
#define  FMC_PCR2_TCLR_3                    (0x00001000)        /*!<Bit 3 */

#define  FMC_PCR2_TAR                       (0x0001E000)        /*!<TAR[3:0] bits (ALE to RE delay)           */
#define  FMC_PCR2_TAR_0                     (0x00002000)        /*!<Bit 0 */
#define  FMC_PCR2_TAR_1                     (0x00004000)        /*!<Bit 1 */
#define  FMC_PCR2_TAR_2                     (0x00008000)        /*!<Bit 2 */
#define  FMC_PCR2_TAR_3                     (0x00010000)        /*!<Bit 3 */

#define  FMC_PCR2_ECCPS                     (0x000E0000)        /*!<ECCPS[1:0] bits (ECC page size)           */
#define  FMC_PCR2_ECCPS_0                   (0x00020000)        /*!<Bit 0 */
#define  FMC_PCR2_ECCPS_1                   (0x00040000)        /*!<Bit 1 */
#define  FMC_PCR2_ECCPS_2                   (0x00080000)        /*!<Bit 2 */

#define  FMC_PCR3_PWAITEN                   (0x00000002)        /*!<Wait feature enable bit                   */
#define  FMC_PCR3_PBKEN                     (0x00000004)        /*!<PC Card/NAND Flash memory bank enable bit */
#define  FMC_PCR3_PTYP                      (0x00000008)        /*!<Memory type                               */

#define  FMC_PCR3_PWID                      (0x00000030)        /*!<PWID[1:0] bits (NAND Flash databus width) */
#define  FMC_PCR3_PWID_0                    (0x00000010)        /*!<Bit 0 */
#define  FMC_PCR3_PWID_1                    (0x00000020)        /*!<Bit 1 */

#define  FMC_PCR3_ECCEN                     (0x00000040)        /*!<ECC computation logic enable bit          */

#define  FMC_PCR3_TCLR                      (0x00001E00)        /*!<TCLR[3:0] bits (CLE to RE delay)          */
#define  FMC_PCR3_TCLR_0                    (0x00000200)        /*!<Bit 0 */
#define  FMC_PCR3_TCLR_1                    (0x00000400)        /*!<Bit 1 */
#define  FMC_PCR3_TCLR_2                    (0x00000800)        /*!<Bit 2 */
#define  FMC_PCR3_TCLR_3                    (0x00001000)        /*!<Bit 3 */

#define  FMC_PCR3_TAR                       (0x0001E000)        /*!<TAR[3:0] bits (ALE to RE delay)           */
#define  FMC_PCR3_TAR_0                     (0x00002000)        /*!<Bit 0 */
#define  FMC_PCR3_TAR_1                     (0x00004000)        /*!<Bit 1 */
#define  FMC_PCR3_TAR_2                     (0x00008000)        /*!<Bit 2 */
#define  FMC_PCR3_TAR_3                     (0x00010000)        /*!<Bit 3 */

#define  FMC_PCR3_ECCPS                     (0x000E0000)        /*!<ECCPS[2:0] bits (ECC page size)           */
#define  FMC_PCR3_ECCPS_0                   (0x00020000)        /*!<Bit 0 */
#define  FMC_PCR3_ECCPS_1                   (0x00040000)        /*!<Bit 1 */
#define  FMC_PCR3_ECCPS_2                   (0x00080000)        /*!<Bit 2 */

#define  FMC_PCR4_PWAITEN                   (0x00000002)        /*!<Wait feature enable bit                   */
#define  FMC_PCR4_PBKEN                     (0x00000004)        /*!<PC Card/NAND Flash memory bank enable bit */
#define  FMC_PCR4_PTYP                      (0x00000008)        /*!<Memory type                               */

#define  FMC_PCR4_PWID                      (0x00000030)        /*!<PWID[1:0] bits (NAND Flash databus width) */
#define  FMC_PCR4_PWID_0                    (0x00000010)        /*!<Bit 0 */
#define  FMC_PCR4_PWID_1                    (0x00000020)        /*!<Bit 1 */

#define  FMC_PCR4_ECCEN                     (0x00000040)        /*!<ECC computation logic enable bit          */

#define  FMC_PCR4_TCLR                      (0x00001E00)        /*!<TCLR[3:0] bits (CLE to RE delay)          */
#define  FMC_PCR4_TCLR_0                    (0x00000200)        /*!<Bit 0 */
#define  FMC_PCR4_TCLR_1                    (0x00000400)        /*!<Bit 1 */
#define  FMC_PCR4_TCLR_2                    (0x00000800)        /*!<Bit 2 */
#define  FMC_PCR4_TCLR_3                    (0x00001000)        /*!<Bit 3 */

#define  FMC_PCR4_TAR                       (0x0001E000)        /*!<TAR[3:0] bits (ALE to RE delay)           */
#define  FMC_PCR4_TAR_0                     (0x00002000)        /*!<Bit 0 */
#define  FMC_PCR4_TAR_1                     (0x00004000)        /*!<Bit 1 */
#define  FMC_PCR4_TAR_2                     (0x00008000)        /*!<Bit 2 */
#define  FMC_PCR4_TAR_3                     (0x00010000)        /*!<Bit 3 */

#define  FMC_PCR4_ECCPS                     (0x000E0000)        /*!<ECCPS[2:0] bits (ECC page size)           */
#define  FMC_PCR4_ECCPS_0                   (0x00020000)        /*!<Bit 0 */
#define  FMC_PCR4_ECCPS_1                   (0x00040000)        /*!<Bit 1 */
#define  FMC_PCR4_ECCPS_2                   (0x00080000)        /*!<Bit 2 */

#define  FMC_SR2_IRS                        (0x01)               /*!<Interrupt Rising Edge status                */
#define  FMC_SR2_ILS                        (0x02)               /*!<Interrupt Level status                      */
#define  FMC_SR2_IFS                        (0x04)               /*!<Interrupt Falling Edge status               */
#define  FMC_SR2_IREN                       (0x08)               /*!<Interrupt Rising Edge detection Enable bit  */
#define  FMC_SR2_ILEN                       (0x10)               /*!<Interrupt Level detection Enable bit        */
#define  FMC_SR2_IFEN                       (0x20)               /*!<Interrupt Falling Edge detection Enable bit */
#define  FMC_SR2_FEMPT                      (0x40)               /*!<FIFO empty                                  */

#define  FMC_SR3_IRS                        (0x01)               /*!<Interrupt Rising Edge status                */
#define  FMC_SR3_ILS                        (0x02)               /*!<Interrupt Level status                      */
#define  FMC_SR3_IFS                        (0x04)               /*!<Interrupt Falling Edge status               */
#define  FMC_SR3_IREN                       (0x08)               /*!<Interrupt Rising Edge detection Enable bit  */
#define  FMC_SR3_ILEN                       (0x10)               /*!<Interrupt Level detection Enable bit        */
#define  FMC_SR3_IFEN                       (0x20)               /*!<Interrupt Falling Edge detection Enable bit */
#define  FMC_SR3_FEMPT                      (0x40)               /*!<FIFO empty                                  */

#define  FMC_SR4_IRS                        (0x01)               /*!<Interrupt Rising Edge status                */
#define  FMC_SR4_ILS                        (0x02)               /*!<Interrupt Level status                      */
#define  FMC_SR4_IFS                        (0x04)               /*!<Interrupt Falling Edge status               */
#define  FMC_SR4_IREN                       (0x08)               /*!<Interrupt Rising Edge detection Enable bit  */
#define  FMC_SR4_ILEN                       (0x10)               /*!<Interrupt Level detection Enable bit        */
#define  FMC_SR4_IFEN                       (0x20)               /*!<Interrupt Falling Edge detection Enable bit */
#define  FMC_SR4_FEMPT                      (0x40)               /*!<FIFO empty                                  */

