the-nw1-group/acb-modules/acb-common/include/stm/stm32f30x.inc
#define  FMC_PMEM4_MEMWAIT4                 (0x0000FF00)        /*!<MEMWAIT4[7:0] bits (Common memory 4 wait time) */
#define  FMC_PMEM4_MEMWAIT4_0               (0x00000100)        /*!<Bit 0 */
#define  FMC_PMEM4_MEMWAIT4_1               (0x00000200)        /*!<Bit 1 */
#define  FMC_PMEM4_MEMWAIT4_2               (0x00000400)        /*!<Bit 2 */
#define  FMC_PMEM4_MEMWAIT4_3               (0x00000800)        /*!<Bit 3 */
#define  FMC_PMEM4_MEMWAIT4_4               (0x00001000)        /*!<Bit 4 */
#define  FMC_PMEM4_MEMWAIT4_5               (0x00002000)        /*!<Bit 5 */
#define  FMC_PMEM4_MEMWAIT4_6               (0x00004000)        /*!<Bit 6 */
#define  FMC_PMEM4_MEMWAIT4_7               (0x00008000)        /*!<Bit 7 */

#define  FMC_PMEM4_MEMHOLD4                 (0x00FF0000)        /*!<MEMHOLD4[7:0] bits (Common memory 4 hold time) */
#define  FMC_PMEM4_MEMHOLD4_0               (0x00010000)        /*!<Bit 0 */
#define  FMC_PMEM4_MEMHOLD4_1               (0x00020000)        /*!<Bit 1 */
#define  FMC_PMEM4_MEMHOLD4_2               (0x00040000)        /*!<Bit 2 */
#define  FMC_PMEM4_MEMHOLD4_3               (0x00080000)        /*!<Bit 3 */
#define  FMC_PMEM4_MEMHOLD4_4               (0x00100000)        /*!<Bit 4 */
#define  FMC_PMEM4_MEMHOLD4_5               (0x00200000)        /*!<Bit 5 */
#define  FMC_PMEM4_MEMHOLD4_6               (0x00400000)        /*!<Bit 6 */
#define  FMC_PMEM4_MEMHOLD4_7               (0x00800000)        /*!<Bit 7 */

#define  FMC_PMEM4_MEMHIZ4                  (0xFF000000)        /*!<MEMHIZ4[7:0] bits (Common memory 4 databus HiZ time) */
#define  FMC_PMEM4_MEMHIZ4_0                (0x01000000)        /*!<Bit 0 */
#define  FMC_PMEM4_MEMHIZ4_1                (0x02000000)        /*!<Bit 1 */
#define  FMC_PMEM4_MEMHIZ4_2                (0x04000000)        /*!<Bit 2 */
#define  FMC_PMEM4_MEMHIZ4_3                (0x08000000)        /*!<Bit 3 */
#define  FMC_PMEM4_MEMHIZ4_4                (0x10000000)        /*!<Bit 4 */
#define  FMC_PMEM4_MEMHIZ4_5                (0x20000000)        /*!<Bit 5 */
#define  FMC_PMEM4_MEMHIZ4_6                (0x40000000)        /*!<Bit 6 */
#define  FMC_PMEM4_MEMHIZ4_7                (0x80000000)        /*!<Bit 7 */

#define  FMC_PATT2_ATTSET2                  (0x000000FF)        /*!<ATTSET2[7:0] bits (Attribute memory 2 setup time) */
#define  FMC_PATT2_ATTSET2_0                (0x00000001)        /*!<Bit 0 */
#define  FMC_PATT2_ATTSET2_1                (0x00000002)        /*!<Bit 1 */
#define  FMC_PATT2_ATTSET2_2                (0x00000004)        /*!<Bit 2 */
#define  FMC_PATT2_ATTSET2_3                (0x00000008)        /*!<Bit 3 */
#define  FMC_PATT2_ATTSET2_4                (0x00000010)        /*!<Bit 4 */
#define  FMC_PATT2_ATTSET2_5                (0x00000020)        /*!<Bit 5 */
#define  FMC_PATT2_ATTSET2_6                (0x00000040)        /*!<Bit 6 */
#define  FMC_PATT2_ATTSET2_7                (0x00000080)        /*!<Bit 7 */

#define  FMC_PATT2_ATTWAIT2                 (0x0000FF00)        /*!<ATTWAIT2[7:0] bits (Attribute memory 2 wait time) */
#define  FMC_PATT2_ATTWAIT2_0               (0x00000100)        /*!<Bit 0 */
#define  FMC_PATT2_ATTWAIT2_1               (0x00000200)        /*!<Bit 1 */
#define  FMC_PATT2_ATTWAIT2_2               (0x00000400)        /*!<Bit 2 */
#define  FMC_PATT2_ATTWAIT2_3               (0x00000800)        /*!<Bit 3 */
#define  FMC_PATT2_ATTWAIT2_4               (0x00001000)        /*!<Bit 4 */
#define  FMC_PATT2_ATTWAIT2_5               (0x00002000)        /*!<Bit 5 */
#define  FMC_PATT2_ATTWAIT2_6               (0x00004000)        /*!<Bit 6 */
#define  FMC_PATT2_ATTWAIT2_7               (0x00008000)        /*!<Bit 7 */

#define  FMC_PATT2_ATTHOLD2                 (0x00FF0000)        /*!<ATTHOLD2[7:0] bits (Attribute memory 2 hold time) */
#define  FMC_PATT2_ATTHOLD2_0               (0x00010000)        /*!<Bit 0 */
#define  FMC_PATT2_ATTHOLD2_1               (0x00020000)        /*!<Bit 1 */
#define  FMC_PATT2_ATTHOLD2_2               (0x00040000)        /*!<Bit 2 */
#define  FMC_PATT2_ATTHOLD2_3               (0x00080000)        /*!<Bit 3 */
#define  FMC_PATT2_ATTHOLD2_4               (0x00100000)        /*!<Bit 4 */
#define  FMC_PATT2_ATTHOLD2_5               (0x00200000)        /*!<Bit 5 */
#define  FMC_PATT2_ATTHOLD2_6               (0x00400000)        /*!<Bit 6 */
#define  FMC_PATT2_ATTHOLD2_7               (0x00800000)        /*!<Bit 7 */

#define  FMC_PATT2_ATTHIZ2                  (0xFF000000)        /*!<ATTHIZ2[7:0] bits (Attribute memory 2 databus HiZ time) */
#define  FMC_PATT2_ATTHIZ2_0                (0x01000000)        /*!<Bit 0 */
#define  FMC_PATT2_ATTHIZ2_1                (0x02000000)        /*!<Bit 1 */
#define  FMC_PATT2_ATTHIZ2_2                (0x04000000)        /*!<Bit 2 */
#define  FMC_PATT2_ATTHIZ2_3                (0x08000000)        /*!<Bit 3 */
#define  FMC_PATT2_ATTHIZ2_4                (0x10000000)        /*!<Bit 4 */
#define  FMC_PATT2_ATTHIZ2_5                (0x20000000)        /*!<Bit 5 */
#define  FMC_PATT2_ATTHIZ2_6                (0x40000000)        /*!<Bit 6 */
#define  FMC_PATT2_ATTHIZ2_7                (0x80000000)        /*!<Bit 7 */

#define  FMC_PATT3_ATTSET3                  (0x000000FF)        /*!<ATTSET3[7:0] bits (Attribute memory 3 setup time) */
#define  FMC_PATT3_ATTSET3_0                (0x00000001)        /*!<Bit 0 */
#define  FMC_PATT3_ATTSET3_1                (0x00000002)        /*!<Bit 1 */
#define  FMC_PATT3_ATTSET3_2                (0x00000004)        /*!<Bit 2 */
#define  FMC_PATT3_ATTSET3_3                (0x00000008)        /*!<Bit 3 */
#define  FMC_PATT3_ATTSET3_4                (0x00000010)        /*!<Bit 4 */
#define  FMC_PATT3_ATTSET3_5                (0x00000020)        /*!<Bit 5 */
#define  FMC_PATT3_ATTSET3_6                (0x00000040)        /*!<Bit 6 */
#define  FMC_PATT3_ATTSET3_7                (0x00000080)        /*!<Bit 7 */

#define  FMC_PATT3_ATTWAIT3                 (0x0000FF00)        /*!<ATTWAIT3[7:0] bits (Attribute memory 3 wait time) */
#define  FMC_PATT3_ATTWAIT3_0               (0x00000100)        /*!<Bit 0 */
#define  FMC_PATT3_ATTWAIT3_1               (0x00000200)        /*!<Bit 1 */
#define  FMC_PATT3_ATTWAIT3_2               (0x00000400)        /*!<Bit 2 */
#define  FMC_PATT3_ATTWAIT3_3               (0x00000800)        /*!<Bit 3 */
#define  FMC_PATT3_ATTWAIT3_4               (0x00001000)        /*!<Bit 4 */
#define  FMC_PATT3_ATTWAIT3_5               (0x00002000)        /*!<Bit 5 */
#define  FMC_PATT3_ATTWAIT3_6               (0x00004000)        /*!<Bit 6 */
#define  FMC_PATT3_ATTWAIT3_7               (0x00008000)        /*!<Bit 7 */

