the-nw1-group/acb-modules/acb-common/include/stm/stm32f30x.inc
#define  FMC_PATT3_ATTHOLD3                 (0x00FF0000)        /*!<ATTHOLD3[7:0] bits (Attribute memory 3 hold time) */
#define  FMC_PATT3_ATTHOLD3_0               (0x00010000)        /*!<Bit 0 */
#define  FMC_PATT3_ATTHOLD3_1               (0x00020000)        /*!<Bit 1 */
#define  FMC_PATT3_ATTHOLD3_2               (0x00040000)        /*!<Bit 2 */
#define  FMC_PATT3_ATTHOLD3_3               (0x00080000)        /*!<Bit 3 */
#define  FMC_PATT3_ATTHOLD3_4               (0x00100000)        /*!<Bit 4 */
#define  FMC_PATT3_ATTHOLD3_5               (0x00200000)        /*!<Bit 5 */
#define  FMC_PATT3_ATTHOLD3_6               (0x00400000)        /*!<Bit 6 */
#define  FMC_PATT3_ATTHOLD3_7               (0x00800000)        /*!<Bit 7 */

#define  FMC_PATT3_ATTHIZ3                  (0xFF000000)        /*!<ATTHIZ3[7:0] bits (Attribute memory 3 databus HiZ time) */
#define  FMC_PATT3_ATTHIZ3_0                (0x01000000)        /*!<Bit 0 */
#define  FMC_PATT3_ATTHIZ3_1                (0x02000000)        /*!<Bit 1 */
#define  FMC_PATT3_ATTHIZ3_2                (0x04000000)        /*!<Bit 2 */
#define  FMC_PATT3_ATTHIZ3_3                (0x08000000)        /*!<Bit 3 */
#define  FMC_PATT3_ATTHIZ3_4                (0x10000000)        /*!<Bit 4 */
#define  FMC_PATT3_ATTHIZ3_5                (0x20000000)        /*!<Bit 5 */
#define  FMC_PATT3_ATTHIZ3_6                (0x40000000)        /*!<Bit 6 */
#define  FMC_PATT3_ATTHIZ3_7                (0x80000000)        /*!<Bit 7 */

#define  FMC_PATT4_ATTSET4                  (0x000000FF)        /*!<ATTSET4[7:0] bits (Attribute memory 4 setup time) */
#define  FMC_PATT4_ATTSET4_0                (0x00000001)        /*!<Bit 0 */
#define  FMC_PATT4_ATTSET4_1                (0x00000002)        /*!<Bit 1 */
#define  FMC_PATT4_ATTSET4_2                (0x00000004)        /*!<Bit 2 */
#define  FMC_PATT4_ATTSET4_3                (0x00000008)        /*!<Bit 3 */
#define  FMC_PATT4_ATTSET4_4                (0x00000010)        /*!<Bit 4 */
#define  FMC_PATT4_ATTSET4_5                (0x00000020)        /*!<Bit 5 */
#define  FMC_PATT4_ATTSET4_6                (0x00000040)        /*!<Bit 6 */
#define  FMC_PATT4_ATTSET4_7                (0x00000080)        /*!<Bit 7 */

#define  FMC_PATT4_ATTWAIT4                 (0x0000FF00)        /*!<ATTWAIT4[7:0] bits (Attribute memory 4 wait time) */
#define  FMC_PATT4_ATTWAIT4_0               (0x00000100)        /*!<Bit 0 */
#define  FMC_PATT4_ATTWAIT4_1               (0x00000200)        /*!<Bit 1 */
#define  FMC_PATT4_ATTWAIT4_2               (0x00000400)        /*!<Bit 2 */
#define  FMC_PATT4_ATTWAIT4_3               (0x00000800)        /*!<Bit 3 */
#define  FMC_PATT4_ATTWAIT4_4               (0x00001000)        /*!<Bit 4 */
#define  FMC_PATT4_ATTWAIT4_5               (0x00002000)        /*!<Bit 5 */
#define  FMC_PATT4_ATTWAIT4_6               (0x00004000)        /*!<Bit 6 */
#define  FMC_PATT4_ATTWAIT4_7               (0x00008000)        /*!<Bit 7 */

#define  FMC_PATT4_ATTHOLD4                 (0x00FF0000)        /*!<ATTHOLD4[7:0] bits (Attribute memory 4 hold time) */
#define  FMC_PATT4_ATTHOLD4_0               (0x00010000)        /*!<Bit 0 */
#define  FMC_PATT4_ATTHOLD4_1               (0x00020000)        /*!<Bit 1 */
#define  FMC_PATT4_ATTHOLD4_2               (0x00040000)        /*!<Bit 2 */
#define  FMC_PATT4_ATTHOLD4_3               (0x00080000)        /*!<Bit 3 */
#define  FMC_PATT4_ATTHOLD4_4               (0x00100000)        /*!<Bit 4 */
#define  FMC_PATT4_ATTHOLD4_5               (0x00200000)        /*!<Bit 5 */
#define  FMC_PATT4_ATTHOLD4_6               (0x00400000)        /*!<Bit 6 */
#define  FMC_PATT4_ATTHOLD4_7               (0x00800000)        /*!<Bit 7 */

#define  FMC_PATT4_ATTHIZ4                  (0xFF000000)        /*!<ATTHIZ4[7:0] bits (Attribute memory 4 databus HiZ time) */
#define  FMC_PATT4_ATTHIZ4_0                (0x01000000)        /*!<Bit 0 */
#define  FMC_PATT4_ATTHIZ4_1                (0x02000000)        /*!<Bit 1 */
#define  FMC_PATT4_ATTHIZ4_2                (0x04000000)        /*!<Bit 2 */
#define  FMC_PATT4_ATTHIZ4_3                (0x08000000)        /*!<Bit 3 */
#define  FMC_PATT4_ATTHIZ4_4                (0x10000000)        /*!<Bit 4 */
#define  FMC_PATT4_ATTHIZ4_5                (0x20000000)        /*!<Bit 5 */
#define  FMC_PATT4_ATTHIZ4_6                (0x40000000)        /*!<Bit 6 */
#define  FMC_PATT4_ATTHIZ4_7                (0x80000000)        /*!<Bit 7 */

#define  FMC_PIO4_IOSET4                    (0x000000FF)        /*!<IOSET4[7:0] bits (I/O 4 setup time) */
#define  FMC_PIO4_IOSET4_0                  (0x00000001)        /*!<Bit 0 */
#define  FMC_PIO4_IOSET4_1                  (0x00000002)        /*!<Bit 1 */
#define  FMC_PIO4_IOSET4_2                  (0x00000004)        /*!<Bit 2 */
#define  FMC_PIO4_IOSET4_3                  (0x00000008)        /*!<Bit 3 */
#define  FMC_PIO4_IOSET4_4                  (0x00000010)        /*!<Bit 4 */
#define  FMC_PIO4_IOSET4_5                  (0x00000020)        /*!<Bit 5 */
#define  FMC_PIO4_IOSET4_6                  (0x00000040)        /*!<Bit 6 */
#define  FMC_PIO4_IOSET4_7                  (0x00000080)        /*!<Bit 7 */

#define  FMC_PIO4_IOWAIT4                   (0x0000FF00)        /*!<IOWAIT4[7:0] bits (I/O 4 wait time) */
#define  FMC_PIO4_IOWAIT4_0                 (0x00000100)        /*!<Bit 0 */
#define  FMC_PIO4_IOWAIT4_1                 (0x00000200)        /*!<Bit 1 */
#define  FMC_PIO4_IOWAIT4_2                 (0x00000400)        /*!<Bit 2 */
#define  FMC_PIO4_IOWAIT4_3                 (0x00000800)        /*!<Bit 3 */
#define  FMC_PIO4_IOWAIT4_4                 (0x00001000)        /*!<Bit 4 */
#define  FMC_PIO4_IOWAIT4_5                 (0x00002000)        /*!<Bit 5 */
#define  FMC_PIO4_IOWAIT4_6                 (0x00004000)        /*!<Bit 6 */
#define  FMC_PIO4_IOWAIT4_7                 (0x00008000)        /*!<Bit 7 */

#define  FMC_PIO4_IOHOLD4                   (0x00FF0000)        /*!<IOHOLD4[7:0] bits (I/O 4 hold time) */
#define  FMC_PIO4_IOHOLD4_0                 (0x00010000)        /*!<Bit 0 */
#define  FMC_PIO4_IOHOLD4_1                 (0x00020000)        /*!<Bit 1 */
#define  FMC_PIO4_IOHOLD4_2                 (0x00040000)        /*!<Bit 2 */
#define  FMC_PIO4_IOHOLD4_3                 (0x00080000)        /*!<Bit 3 */
#define  FMC_PIO4_IOHOLD4_4                 (0x00100000)        /*!<Bit 4 */
#define  FMC_PIO4_IOHOLD4_5                 (0x00200000)        /*!<Bit 5 */
#define  FMC_PIO4_IOHOLD4_6                 (0x00400000)        /*!<Bit 6 */
#define  FMC_PIO4_IOHOLD4_7                 (0x00800000)        /*!<Bit 7 */

#define  FMC_PIO4_IOHIZ4                    (0xFF000000)        /*!<IOHIZ4[7:0] bits (I/O 4 databus HiZ time) */
#define  FMC_PIO4_IOHIZ4_0                  (0x01000000)        /*!<Bit 0 */
#define  FMC_PIO4_IOHIZ4_1                  (0x02000000)        /*!<Bit 1 */
#define  FMC_PIO4_IOHIZ4_2                  (0x04000000)        /*!<Bit 2 */
#define  FMC_PIO4_IOHIZ4_3                  (0x08000000)        /*!<Bit 3 */
#define  FMC_PIO4_IOHIZ4_4                  (0x10000000)        /*!<Bit 4 */
#define  FMC_PIO4_IOHIZ4_5                  (0x20000000)        /*!<Bit 5 */
#define  FMC_PIO4_IOHIZ4_6                  (0x40000000)        /*!<Bit 6 */
#define  FMC_PIO4_IOHIZ4_7                  (0x80000000)        /*!<Bit 7 */

