the-nw1-group/acb-modules/acb-common/include/stm/stm32f30x.inc
#define  FMC_ECCR2_ECC2                     (0xFFFFFFFF)        /*!<ECC result */

#define  FMC_ECCR3_ECC3                     (0xFFFFFFFF)        /*!<ECC result */

#define  FMC_SDCR1_NC                       (0x00000003)        /*!<NC[1:0] bits (Number of column bits) */
#define  FMC_SDCR1_NC_0                     (0x00000001)        /*!<Bit 0 */
#define  FMC_SDCR1_NC_1                     (0x00000002)        /*!<Bit 1 */

#define  FMC_SDCR1_NR                       (0x0000000C)        /*!<NR[1:0] bits (Number of row bits) */
#define  FMC_SDCR1_NR_0                     (0x00000004)        /*!<Bit 0 */
#define  FMC_SDCR1_NR_1                     (0x00000008)        /*!<Bit 1 */

#define  FMC_SDCR1_MWID                     (0x00000030)        /*!<NR[1:0] bits (Number of row bits) */
#define  FMC_SDCR1_MWID_0                   (0x00000010)        /*!<Bit 0 */
#define  FMC_SDCR1_MWID_1                   (0x00000020)        /*!<Bit 1 */

#define  FMC_SDCR1_NB                       (0x00000040)        /*!<Number of internal bank */

#define  FMC_SDCR1_CAS                      (0x00000180)        /*!<CAS[1:0] bits (CAS latency) */
#define  FMC_SDCR1_CAS_0                    (0x00000080)        /*!<Bit 0 */
#define  FMC_SDCR1_CAS_1                    (0x00000100)        /*!<Bit 1 */

#define  FMC_SDCR1_WP                       (0x00000200)        /*!<Write protection */

#define  FMC_SDCR1_SDCLK                    (0x00000C00)        /*!<SDRAM clock configuration */
#define  FMC_SDCR1_SDCLK_0                  (0x00000400)        /*!<Bit 0 */
#define  FMC_SDCR1_SDCLK_1                  (0x00000800)        /*!<Bit 1 */

#define  FMC_SDCR1_RBURST                   (0x00001000)        /*!<Read burst */

#define  FMC_SDCR1_RPIPE                    (0x00006000)        /*!<Write protection */
#define  FMC_SDCR1_RPIPE_0                  (0x00002000)        /*!<Bit 0 */
#define  FMC_SDCR1_RPIPE_1                  (0x00004000)        /*!<Bit 1 */

#define  FMC_SDCR2_NC                       (0x00000003)        /*!<NC[1:0] bits (Number of column bits) */
#define  FMC_SDCR2_NC_0                     (0x00000001)        /*!<Bit 0 */
#define  FMC_SDCR2_NC_1                     (0x00000002)        /*!<Bit 1 */

#define  FMC_SDCR2_NR                       (0x0000000C)        /*!<NR[1:0] bits (Number of row bits) */
#define  FMC_SDCR2_NR_0                     (0x00000004)        /*!<Bit 0 */
#define  FMC_SDCR2_NR_1                     (0x00000008)        /*!<Bit 1 */

#define  FMC_SDCR2_MWID                     (0x00000030)        /*!<NR[1:0] bits (Number of row bits) */
#define  FMC_SDCR2_MWID_0                   (0x00000010)        /*!<Bit 0 */
#define  FMC_SDCR2_MWID_1                   (0x00000020)        /*!<Bit 1 */

#define  FMC_SDCR2_NB                       (0x00000040)        /*!<Number of internal bank */

#define  FMC_SDCR2_CAS                      (0x00000180)        /*!<CAS[1:0] bits (CAS latency) */
#define  FMC_SDCR2_CAS_0                    (0x00000080)        /*!<Bit 0 */
#define  FMC_SDCR2_CAS_1                    (0x00000100)        /*!<Bit 1 */

#define  FMC_SDCR2_WP                       (0x00000200)        /*!<Write protection */

#define  FMC_SDCR2_SDCLK                    (0x00000C00)        /*!<SDCLK[1:0] (SDRAM clock configuration) */
#define  FMC_SDCR2_SDCLK_0                  (0x00000400)        /*!<Bit 0 */
#define  FMC_SDCR2_SDCLK_1                  (0x00000800)        /*!<Bit 1 */

#define  FMC_SDCR2_RBURST                   (0x00001000)        /*!<Read burst */

#define  FMC_SDCR2_RPIPE                    (0x00006000)        /*!<RPIPE[1:0](Read pipe) */
#define  FMC_SDCR2_RPIPE_0                  (0x00002000)        /*!<Bit 0 */
#define  FMC_SDCR2_RPIPE_1                  (0x00004000)        /*!<Bit 1 */

#define  FMC_SDTR1_TMRD                     (0x0000000F)        /*!<TMRD[3:0] bits (Load mode register to active) */
#define  FMC_SDTR1_TMRD_0                   (0x00000001)        /*!<Bit 0 */
#define  FMC_SDTR1_TMRD_1                   (0x00000002)        /*!<Bit 1 */
#define  FMC_SDTR1_TMRD_2                   (0x00000004)        /*!<Bit 2 */
#define  FMC_SDTR1_TMRD_3                   (0x00000008)        /*!<Bit 3 */

#define  FMC_SDTR1_TXSR                     (0x000000F0)        /*!<TXSR[3:0] bits (Exit self refresh) */
#define  FMC_SDTR1_TXSR_0                   (0x00000010)        /*!<Bit 0 */
#define  FMC_SDTR1_TXSR_1                   (0x00000020)        /*!<Bit 1 */
#define  FMC_SDTR1_TXSR_2                   (0x00000040)        /*!<Bit 2 */
#define  FMC_SDTR1_TXSR_3                   (0x00000080)        /*!<Bit 3 */

#define  FMC_SDTR1_TRAS                     (0x00000F00)        /*!<TRAS[3:0] bits (Self refresh time) */
#define  FMC_SDTR1_TRAS_0                   (0x00000100)        /*!<Bit 0 */
#define  FMC_SDTR1_TRAS_1                   (0x00000200)        /*!<Bit 1 */
#define  FMC_SDTR1_TRAS_2                   (0x00000400)        /*!<Bit 2 */
#define  FMC_SDTR1_TRAS_3                   (0x00000800)        /*!<Bit 3 */

#define  FMC_SDTR1_TRC                      (0x0000F000)        /*!<TRC[2:0] bits (Row cycle delay) */
#define  FMC_SDTR1_TRC_0                    (0x00001000)        /*!<Bit 0 */
#define  FMC_SDTR1_TRC_1                    (0x00002000)        /*!<Bit 1 */
#define  FMC_SDTR1_TRC_2                    (0x00004000)        /*!<Bit 2 */

#define  FMC_SDTR1_TWR                      (0x000F0000)        /*!<TRC[2:0] bits (Write recovery delay) */
#define  FMC_SDTR1_TWR_0                    (0x00010000)        /*!<Bit 0 */
#define  FMC_SDTR1_TWR_1                    (0x00020000)        /*!<Bit 1 */
#define  FMC_SDTR1_TWR_2                    (0x00040000)        /*!<Bit 2 */

#define  FMC_SDTR1_TRP                      (0x00F00000)        /*!<TRP[2:0] bits (Row precharge delay) */
#define  FMC_SDTR1_TRP_0                    (0x00100000)        /*!<Bit 0 */
#define  FMC_SDTR1_TRP_1                    (0x00200000)        /*!<Bit 1 */
#define  FMC_SDTR1_TRP_2                    (0x00400000)        /*!<Bit 2 */

#define  FMC_SDTR1_TRCD                     (0x0F000000)        /*!<TRP[2:0] bits (Row to column delay) */
#define  FMC_SDTR1_TRCD_0                   (0x01000000)        /*!<Bit 0 */
#define  FMC_SDTR1_TRCD_1                   (0x02000000)        /*!<Bit 1 */
#define  FMC_SDTR1_TRCD_2                   (0x04000000)        /*!<Bit 2 */

#define  FMC_SDTR2_TMRD                     (0x0000000F)        /*!<TMRD[3:0] bits (Load mode register to active) */
#define  FMC_SDTR2_TMRD_0                   (0x00000001)        /*!<Bit 0 */
#define  FMC_SDTR2_TMRD_1                   (0x00000002)        /*!<Bit 1 */
#define  FMC_SDTR2_TMRD_2                   (0x00000004)        /*!<Bit 2 */
#define  FMC_SDTR2_TMRD_3                   (0x00000008)        /*!<Bit 3 */

