the-nw1-group/acb-modules/acb-common/include/stm/stm32f30x.inc
#define  FMC_SDTR2_TXSR                     (0x000000F0)        /*!<TXSR[3:0] bits (Exit self refresh) */
#define  FMC_SDTR2_TXSR_0                   (0x00000010)        /*!<Bit 0 */
#define  FMC_SDTR2_TXSR_1                   (0x00000020)        /*!<Bit 1 */
#define  FMC_SDTR2_TXSR_2                   (0x00000040)        /*!<Bit 2 */
#define  FMC_SDTR2_TXSR_3                   (0x00000080)        /*!<Bit 3 */

#define  FMC_SDTR2_TRAS                     (0x00000F00)        /*!<TRAS[3:0] bits (Self refresh time) */
#define  FMC_SDTR2_TRAS_0                   (0x00000100)        /*!<Bit 0 */
#define  FMC_SDTR2_TRAS_1                   (0x00000200)        /*!<Bit 1 */
#define  FMC_SDTR2_TRAS_2                   (0x00000400)        /*!<Bit 2 */
#define  FMC_SDTR2_TRAS_3                   (0x00000800)        /*!<Bit 3 */

#define  FMC_SDTR2_TRC                      (0x0000F000)        /*!<TRC[2:0] bits (Row cycle delay) */
#define  FMC_SDTR2_TRC_0                    (0x00001000)        /*!<Bit 0 */
#define  FMC_SDTR2_TRC_1                    (0x00002000)        /*!<Bit 1 */
#define  FMC_SDTR2_TRC_2                    (0x00004000)        /*!<Bit 2 */

#define  FMC_SDTR2_TWR                      (0x000F0000)        /*!<TRC[2:0] bits (Write recovery delay) */
#define  FMC_SDTR2_TWR_0                    (0x00010000)        /*!<Bit 0 */
#define  FMC_SDTR2_TWR_1                    (0x00020000)        /*!<Bit 1 */
#define  FMC_SDTR2_TWR_2                    (0x00040000)        /*!<Bit 2 */

#define  FMC_SDTR2_TRP                      (0x00F00000)        /*!<TRP[2:0] bits (Row precharge delay) */
#define  FMC_SDTR2_TRP_0                    (0x00100000)        /*!<Bit 0 */
#define  FMC_SDTR2_TRP_1                    (0x00200000)        /*!<Bit 1 */
#define  FMC_SDTR2_TRP_2                    (0x00400000)        /*!<Bit 2 */

#define  FMC_SDTR2_TRCD                     (0x0F000000)        /*!<TRP[2:0] bits (Row to column delay) */
#define  FMC_SDTR2_TRCD_0                   (0x01000000)        /*!<Bit 0 */
#define  FMC_SDTR2_TRCD_1                   (0x02000000)        /*!<Bit 1 */
#define  FMC_SDTR2_TRCD_2                   (0x04000000)        /*!<Bit 2 */

#define  FMC_SDCMR_MODE                     (0x00000007)        /*!<MODE[2:0] bits (Command mode) */
#define  FMC_SDCMR_MODE_0                   (0x00000001)        /*!<Bit 0 */
#define  FMC_SDCMR_MODE_1                   (0x00000002)        /*!<Bit 1 */
#define  FMC_SDCMR_MODE_2                   (0x00000003)        /*!<Bit 2 */

#define  FMC_SDCMR_CTB2                     (0x00000008)        /*!<Command target 2 */

#define  FMC_SDCMR_CTB1                     (0x00000010)        /*!<Command target 1 */

#define  FMC_SDCMR_NRFS                     (0x000001E0)        /*!<NRFS[3:0] bits (Number of auto-refresh) */
#define  FMC_SDCMR_NRFS_0                   (0x00000020)        /*!<Bit 0 */
#define  FMC_SDCMR_NRFS_1                   (0x00000040)        /*!<Bit 1 */
#define  FMC_SDCMR_NRFS_2                   (0x00000080)        /*!<Bit 2 */
#define  FMC_SDCMR_NRFS_3                   (0x00000100)        /*!<Bit 3 */

#define  FMC_SDCMR_MRD                      (0x003FFE00)        /*!<MRD[12:0] bits (Mode register definition) */

#define  FMC_SDRTR_CRE                      (0x00000001)        /*!<Clear refresh error flag */

#define  FMC_SDRTR_COUNT                    (0x00003FFE)        /*!<COUNT[12:0] bits (Refresh timer count) */

#define  FMC_SDRTR_REIE                     (0x00004000)        /*!<RES interrupt enable */

#define  FMC_SDSR_RE                        (0x00000001)        /*!<Refresh error flag */

#define  FMC_SDSR_MODES1                    (0x00000006)        /*!<MODES1[1:0]bits (Status mode for bank 1) */
#define  FMC_SDSR_MODES1_0                  (0x00000002)        /*!<Bit 0 */
#define  FMC_SDSR_MODES1_1                  (0x00000004)        /*!<Bit 1 */

#define  FMC_SDSR_MODES2                    (0x00000018)        /*!<MODES2[1:0]bits (Status mode for bank 2) */
#define  FMC_SDSR_MODES2_0                  (0x00000008)        /*!<Bit 0 */
#define  FMC_SDSR_MODES2_1                  (0x00000010)        /*!<Bit 1 */
#define  FMC_SDSR_BUSY                      (0x00000020)        /*!<Busy status */

#define GPIO_MODER_MODER0          (0x00000003)
#define GPIO_MODER_MODER0_0        (0x00000001)
#define GPIO_MODER_MODER0_1        (0x00000002)
#define GPIO_MODER_MODER1          (0x0000000C)
#define GPIO_MODER_MODER1_0        (0x00000004)
#define GPIO_MODER_MODER1_1        (0x00000008)
#define GPIO_MODER_MODER2          (0x00000030)
#define GPIO_MODER_MODER2_0        (0x00000010)
#define GPIO_MODER_MODER2_1        (0x00000020)
#define GPIO_MODER_MODER3          (0x000000C0)
#define GPIO_MODER_MODER3_0        (0x00000040)
#define GPIO_MODER_MODER3_1        (0x00000080)
#define GPIO_MODER_MODER4          (0x00000300)
#define GPIO_MODER_MODER4_0        (0x00000100)
#define GPIO_MODER_MODER4_1        (0x00000200)
#define GPIO_MODER_MODER5          (0x00000C00)
#define GPIO_MODER_MODER5_0        (0x00000400)
#define GPIO_MODER_MODER5_1        (0x00000800)
#define GPIO_MODER_MODER6          (0x00003000)
#define GPIO_MODER_MODER6_0        (0x00001000)
#define GPIO_MODER_MODER6_1        (0x00002000)
#define GPIO_MODER_MODER7          (0x0000C000)
#define GPIO_MODER_MODER7_0        (0x00004000)
#define GPIO_MODER_MODER7_1        (0x00008000)
#define GPIO_MODER_MODER8          (0x00030000)
#define GPIO_MODER_MODER8_0        (0x00010000)
#define GPIO_MODER_MODER8_1        (0x00020000)
#define GPIO_MODER_MODER9          (0x000C0000)
#define GPIO_MODER_MODER9_0        (0x00040000)
#define GPIO_MODER_MODER9_1        (0x00080000)
#define GPIO_MODER_MODER10         (0x00300000)
#define GPIO_MODER_MODER10_0       (0x00100000)
#define GPIO_MODER_MODER10_1       (0x00200000)
#define GPIO_MODER_MODER11         (0x00C00000)
#define GPIO_MODER_MODER11_0       (0x00400000)
#define GPIO_MODER_MODER11_1       (0x00800000)
#define GPIO_MODER_MODER12         (0x03000000)
#define GPIO_MODER_MODER12_0       (0x01000000)
#define GPIO_MODER_MODER12_1       (0x02000000)
#define GPIO_MODER_MODER13         (0x0C000000)
#define GPIO_MODER_MODER13_0       (0x04000000)
#define GPIO_MODER_MODER13_1       (0x08000000)
#define GPIO_MODER_MODER14         (0x30000000)
#define GPIO_MODER_MODER14_0       (0x10000000)
#define GPIO_MODER_MODER14_1       (0x20000000)
#define GPIO_MODER_MODER15         (0xC0000000)
#define GPIO_MODER_MODER15_0       (0x40000000)
#define GPIO_MODER_MODER15_1       (0x80000000)


#define GPIO_OTYPER_OT_0           (0x00000001)
#define GPIO_OTYPER_OT_1           (0x00000002)
#define GPIO_OTYPER_OT_2           (0x00000004)
#define GPIO_OTYPER_OT_3           (0x00000008)
#define GPIO_OTYPER_OT_4           (0x00000010)
#define GPIO_OTYPER_OT_5           (0x00000020)
#define GPIO_OTYPER_OT_6           (0x00000040)
#define GPIO_OTYPER_OT_7           (0x00000080)
#define GPIO_OTYPER_OT_8           (0x00000100)
#define GPIO_OTYPER_OT_9           (0x00000200)
#define GPIO_OTYPER_OT_10          (0x00000400)
#define GPIO_OTYPER_OT_11          (0x00000800)
#define GPIO_OTYPER_OT_12          (0x00001000)
#define GPIO_OTYPER_OT_13          (0x00002000)
#define GPIO_OTYPER_OT_14          (0x00004000)
#define GPIO_OTYPER_OT_15          (0x00008000)


#define GPIO_OSPEEDER_OSPEEDR0     (0x00000003)
#define GPIO_OSPEEDER_OSPEEDR0_0   (0x00000001)
#define GPIO_OSPEEDER_OSPEEDR0_1   (0x00000002)
#define GPIO_OSPEEDER_OSPEEDR1     (0x0000000C)
#define GPIO_OSPEEDER_OSPEEDR1_0   (0x00000004)
#define GPIO_OSPEEDER_OSPEEDR1_1   (0x00000008)
#define GPIO_OSPEEDER_OSPEEDR2     (0x00000030)
#define GPIO_OSPEEDER_OSPEEDR2_0   (0x00000010)
#define GPIO_OSPEEDER_OSPEEDR2_1   (0x00000020)
#define GPIO_OSPEEDER_OSPEEDR3     (0x000000C0)
#define GPIO_OSPEEDER_OSPEEDR3_0   (0x00000040)
#define GPIO_OSPEEDER_OSPEEDR3_1   (0x00000080)
#define GPIO_OSPEEDER_OSPEEDR4     (0x00000300)
#define GPIO_OSPEEDER_OSPEEDR4_0   (0x00000100)
#define GPIO_OSPEEDER_OSPEEDR4_1   (0x00000200)
#define GPIO_OSPEEDER_OSPEEDR5     (0x00000C00)
#define GPIO_OSPEEDER_OSPEEDR5_0   (0x00000400)
#define GPIO_OSPEEDER_OSPEEDR5_1   (0x00000800)
#define GPIO_OSPEEDER_OSPEEDR6     (0x00003000)
#define GPIO_OSPEEDER_OSPEEDR6_0   (0x00001000)
#define GPIO_OSPEEDER_OSPEEDR6_1   (0x00002000)
#define GPIO_OSPEEDER_OSPEEDR7     (0x0000C000)
#define GPIO_OSPEEDER_OSPEEDR7_0   (0x00004000)
#define GPIO_OSPEEDER_OSPEEDR7_1   (0x00008000)
#define GPIO_OSPEEDER_OSPEEDR8     (0x00030000)
#define GPIO_OSPEEDER_OSPEEDR8_0   (0x00010000)
#define GPIO_OSPEEDER_OSPEEDR8_1   (0x00020000)
#define GPIO_OSPEEDER_OSPEEDR9     (0x000C0000)
#define GPIO_OSPEEDER_OSPEEDR9_0   (0x00040000)
#define GPIO_OSPEEDER_OSPEEDR9_1   (0x00080000)
#define GPIO_OSPEEDER_OSPEEDR10    (0x00300000)
#define GPIO_OSPEEDER_OSPEEDR10_0  (0x00100000)
#define GPIO_OSPEEDER_OSPEEDR10_1  (0x00200000)
#define GPIO_OSPEEDER_OSPEEDR11    (0x00C00000)
#define GPIO_OSPEEDER_OSPEEDR11_0  (0x00400000)
#define GPIO_OSPEEDER_OSPEEDR11_1  (0x00800000)
#define GPIO_OSPEEDER_OSPEEDR12    (0x03000000)
#define GPIO_OSPEEDER_OSPEEDR12_0  (0x01000000)
#define GPIO_OSPEEDER_OSPEEDR12_1  (0x02000000)
#define GPIO_OSPEEDER_OSPEEDR13    (0x0C000000)
#define GPIO_OSPEEDER_OSPEEDR13_0  (0x04000000)
#define GPIO_OSPEEDER_OSPEEDR13_1  (0x08000000)
#define GPIO_OSPEEDER_OSPEEDR14    (0x30000000)
#define GPIO_OSPEEDER_OSPEEDR14_0  (0x10000000)
#define GPIO_OSPEEDER_OSPEEDR14_1  (0x20000000)
#define GPIO_OSPEEDER_OSPEEDR15    (0xC0000000)
#define GPIO_OSPEEDER_OSPEEDR15_0  (0x40000000)
#define GPIO_OSPEEDER_OSPEEDR15_1  (0x80000000)                       

#define GPIO_PUPDR_PUPDR0          (0x00000003)
#define GPIO_PUPDR_PUPDR0_0        (0x00000001)
#define GPIO_PUPDR_PUPDR0_1        (0x00000002)
#define GPIO_PUPDR_PUPDR1          (0x0000000C)
#define GPIO_PUPDR_PUPDR1_0        (0x00000004)
#define GPIO_PUPDR_PUPDR1_1        (0x00000008)
#define GPIO_PUPDR_PUPDR2          (0x00000030)
#define GPIO_PUPDR_PUPDR2_0        (0x00000010)
#define GPIO_PUPDR_PUPDR2_1        (0x00000020)
#define GPIO_PUPDR_PUPDR3          (0x000000C0)
#define GPIO_PUPDR_PUPDR3_0        (0x00000040)
#define GPIO_PUPDR_PUPDR3_1        (0x00000080)
#define GPIO_PUPDR_PUPDR4          (0x00000300)
#define GPIO_PUPDR_PUPDR4_0        (0x00000100)
#define GPIO_PUPDR_PUPDR4_1        (0x00000200)
#define GPIO_PUPDR_PUPDR5          (0x00000C00)
#define GPIO_PUPDR_PUPDR5_0        (0x00000400)
#define GPIO_PUPDR_PUPDR5_1        (0x00000800)
#define GPIO_PUPDR_PUPDR6          (0x00003000)
#define GPIO_PUPDR_PUPDR6_0        (0x00001000)
#define GPIO_PUPDR_PUPDR6_1        (0x00002000)
#define GPIO_PUPDR_PUPDR7          (0x0000C000)
#define GPIO_PUPDR_PUPDR7_0        (0x00004000)
#define GPIO_PUPDR_PUPDR7_1        (0x00008000)
#define GPIO_PUPDR_PUPDR8          (0x00030000)
#define GPIO_PUPDR_PUPDR8_0        (0x00010000)
#define GPIO_PUPDR_PUPDR8_1        (0x00020000)
#define GPIO_PUPDR_PUPDR9          (0x000C0000)
#define GPIO_PUPDR_PUPDR9_0        (0x00040000)
#define GPIO_PUPDR_PUPDR9_1        (0x00080000)
#define GPIO_PUPDR_PUPDR10         (0x00300000)
#define GPIO_PUPDR_PUPDR10_0       (0x00100000)
#define GPIO_PUPDR_PUPDR10_1       (0x00200000)
#define GPIO_PUPDR_PUPDR11         (0x00C00000)
#define GPIO_PUPDR_PUPDR11_0       (0x00400000)
#define GPIO_PUPDR_PUPDR11_1       (0x00800000)
#define GPIO_PUPDR_PUPDR12         (0x03000000)
#define GPIO_PUPDR_PUPDR12_0       (0x01000000)
#define GPIO_PUPDR_PUPDR12_1       (0x02000000)
#define GPIO_PUPDR_PUPDR13         (0x0C000000)
#define GPIO_PUPDR_PUPDR13_0       (0x04000000)
#define GPIO_PUPDR_PUPDR13_1       (0x08000000)
#define GPIO_PUPDR_PUPDR14         (0x30000000)
#define GPIO_PUPDR_PUPDR14_0       (0x10000000)
#define GPIO_PUPDR_PUPDR14_1       (0x20000000)
#define GPIO_PUPDR_PUPDR15         (0xC0000000)
#define GPIO_PUPDR_PUPDR15_0       (0x40000000)
#define GPIO_PUPDR_PUPDR15_1       (0x80000000)

#define GPIO_IDR_0                 (0x00000001)
#define GPIO_IDR_1                 (0x00000002)
#define GPIO_IDR_2                 (0x00000004)
#define GPIO_IDR_3                 (0x00000008)
#define GPIO_IDR_4                 (0x00000010)
#define GPIO_IDR_5                 (0x00000020)
#define GPIO_IDR_6                 (0x00000040)
#define GPIO_IDR_7                 (0x00000080)
#define GPIO_IDR_8                 (0x00000100)
#define GPIO_IDR_9                 (0x00000200)
#define GPIO_IDR_10                (0x00000400)
#define GPIO_IDR_11                (0x00000800)
#define GPIO_IDR_12                (0x00001000)
#define GPIO_IDR_13                (0x00002000)
#define GPIO_IDR_14                (0x00004000)
#define GPIO_IDR_15                (0x00008000)

#define GPIO_ODR_0                 (0x00000001)
#define GPIO_ODR_1                 (0x00000002)
#define GPIO_ODR_2                 (0x00000004)
#define GPIO_ODR_3                 (0x00000008)
#define GPIO_ODR_4                 (0x00000010)
#define GPIO_ODR_5                 (0x00000020)
#define GPIO_ODR_6                 (0x00000040)
#define GPIO_ODR_7                 (0x00000080)
#define GPIO_ODR_8                 (0x00000100)
#define GPIO_ODR_9                 (0x00000200)
#define GPIO_ODR_10                (0x00000400)
#define GPIO_ODR_11                (0x00000800)
#define GPIO_ODR_12                (0x00001000)
#define GPIO_ODR_13                (0x00002000)
#define GPIO_ODR_14                (0x00004000)
#define GPIO_ODR_15                (0x00008000)

#define GPIO_BSRR_BS_0             (0x00000001)
#define GPIO_BSRR_BS_1             (0x00000002)
#define GPIO_BSRR_BS_2             (0x00000004)
#define GPIO_BSRR_BS_3             (0x00000008)
#define GPIO_BSRR_BS_4             (0x00000010)
#define GPIO_BSRR_BS_5             (0x00000020)
#define GPIO_BSRR_BS_6             (0x00000040)
#define GPIO_BSRR_BS_7             (0x00000080)
#define GPIO_BSRR_BS_8             (0x00000100)
#define GPIO_BSRR_BS_9             (0x00000200)
#define GPIO_BSRR_BS_10            (0x00000400)
#define GPIO_BSRR_BS_11            (0x00000800)
#define GPIO_BSRR_BS_12            (0x00001000)
#define GPIO_BSRR_BS_13            (0x00002000)
#define GPIO_BSRR_BS_14            (0x00004000)
#define GPIO_BSRR_BS_15            (0x00008000)
#define GPIO_BSRR_BR_0             (0x00010000)
#define GPIO_BSRR_BR_1             (0x00020000)
#define GPIO_BSRR_BR_2             (0x00040000)
#define GPIO_BSRR_BR_3             (0x00080000)
#define GPIO_BSRR_BR_4             (0x00100000)
#define GPIO_BSRR_BR_5             (0x00200000)
#define GPIO_BSRR_BR_6             (0x00400000)
#define GPIO_BSRR_BR_7             (0x00800000)
#define GPIO_BSRR_BR_8             (0x01000000)
#define GPIO_BSRR_BR_9             (0x02000000)
#define GPIO_BSRR_BR_10            (0x04000000)
#define GPIO_BSRR_BR_11            (0x08000000)
#define GPIO_BSRR_BR_12            (0x10000000)
#define GPIO_BSRR_BR_13            (0x20000000)
#define GPIO_BSRR_BR_14            (0x40000000)
#define GPIO_BSRR_BR_15            (0x80000000)

