the-nw1-group/acb-modules/acb-common/include/stm/stm32f30x.inc
#define GPIO_LCKR_LCK0             (0x00000001)
#define GPIO_LCKR_LCK1             (0x00000002)
#define GPIO_LCKR_LCK2             (0x00000004)
#define GPIO_LCKR_LCK3             (0x00000008)
#define GPIO_LCKR_LCK4             (0x00000010)
#define GPIO_LCKR_LCK5             (0x00000020)
#define GPIO_LCKR_LCK6             (0x00000040)
#define GPIO_LCKR_LCK7             (0x00000080)
#define GPIO_LCKR_LCK8             (0x00000100)
#define GPIO_LCKR_LCK9             (0x00000200)
#define GPIO_LCKR_LCK10            (0x00000400)
#define GPIO_LCKR_LCK11            (0x00000800)
#define GPIO_LCKR_LCK12            (0x00001000)
#define GPIO_LCKR_LCK13            (0x00002000)
#define GPIO_LCKR_LCK14            (0x00004000)
#define GPIO_LCKR_LCK15            (0x00008000)
#define GPIO_LCKR_LCKK             (0x00010000)

#define GPIO_AFRL_AFRL0            (0x0000000F)
#define GPIO_AFRL_AFRL1            (0x000000F0)
#define GPIO_AFRL_AFRL2            (0x00000F00)
#define GPIO_AFRL_AFRL3            (0x0000F000)
#define GPIO_AFRL_AFRL4            (0x000F0000)
#define GPIO_AFRL_AFRL5            (0x00F00000)
#define GPIO_AFRL_AFRL6            (0x0F000000)
#define GPIO_AFRL_AFRL7            (0xF0000000)

#define GPIO_AFRH_AFRH0            (0x0000000F)
#define GPIO_AFRH_AFRH1            (0x000000F0)
#define GPIO_AFRH_AFRH2            (0x00000F00)
#define GPIO_AFRH_AFRH3            (0x0000F000)
#define GPIO_AFRH_AFRH4            (0x000F0000)
#define GPIO_AFRH_AFRH5            (0x00F00000)
#define GPIO_AFRH_AFRH6            (0x0F000000)
#define GPIO_AFRH_AFRH7            (0xF0000000)

#define GPIO_BRR_BR_0              (0x00000001)
#define GPIO_BRR_BR_1              (0x00000002)
#define GPIO_BRR_BR_2              (0x00000004)
#define GPIO_BRR_BR_3              (0x00000008)
#define GPIO_BRR_BR_4              (0x00000010)
#define GPIO_BRR_BR_5              (0x00000020)
#define GPIO_BRR_BR_6              (0x00000040)
#define GPIO_BRR_BR_7              (0x00000080)
#define GPIO_BRR_BR_8              (0x00000100)
#define GPIO_BRR_BR_9              (0x00000200)
#define GPIO_BRR_BR_10             (0x00000400)
#define GPIO_BRR_BR_11             (0x00000800)
#define GPIO_BRR_BR_12             (0x00001000)
#define GPIO_BRR_BR_13             (0x00002000)
#define GPIO_BRR_BR_14             (0x00004000)
#define GPIO_BRR_BR_15             (0x00008000)

#define  I2C_CR1_PE                          (0x00000001)        /*!< Peripheral enable */
#define  I2C_CR1_TXIE                        (0x00000002)        /*!< TX interrupt enable */
#define  I2C_CR1_RXIE                        (0x00000004)        /*!< RX interrupt enable */
#define  I2C_CR1_ADDRIE                      (0x00000008)        /*!< Address match interrupt enable */
#define  I2C_CR1_NACKIE                      (0x00000010)        /*!< NACK received interrupt enable */
#define  I2C_CR1_STOPIE                      (0x00000020)        /*!< STOP detection interrupt enable */
#define  I2C_CR1_TCIE                        (0x00000040)        /*!< Transfer complete interrupt enable */
#define  I2C_CR1_ERRIE                       (0x00000080)        /*!< Errors interrupt enable */
#define  I2C_CR1_DFN                         (0x00000F00)        /*!< Digital noise filter */
#define  I2C_CR1_ANFOFF                      (0x00001000)        /*!< Analog noise filter OFF */
#define  I2C_CR1_SWRST                       (0x00002000)        /*!< Software reset */
#define  I2C_CR1_TXDMAEN                     (0x00004000)        /*!< DMA transmission requests enable */
#define  I2C_CR1_RXDMAEN                     (0x00008000)        /*!< DMA reception requests enable */
#define  I2C_CR1_SBC                         (0x00010000)        /*!< Slave byte control */
#define  I2C_CR1_NOSTRETCH                   (0x00020000)        /*!< Clock stretching disable */
#define  I2C_CR1_WUPEN                       (0x00040000)        /*!< Wakeup from STOP enable */
#define  I2C_CR1_GCEN                        (0x00080000)        /*!< General call enable */
#define  I2C_CR1_SMBHEN                      (0x00100000)        /*!< SMBus host address enable */
#define  I2C_CR1_SMBDEN                      (0x00200000)        /*!< SMBus device default address enable */
#define  I2C_CR1_ALERTEN                     (0x00400000)        /*!< SMBus alert enable */
#define  I2C_CR1_PECEN                       (0x00800000)        /*!< PEC enable */

#define  I2C_CR2_SADD                        (0x000003FF)        /*!< Slave address (master mode) */
#define  I2C_CR2_RD_WRN                      (0x00000400)        /*!< Transfer direction (master mode) */
#define  I2C_CR2_ADD10                       (0x00000800)        /*!< 10-bit addressing mode (master mode) */
#define  I2C_CR2_HEAD10R                     (0x00001000)        /*!< 10-bit address header only read direction (master mode) */
#define  I2C_CR2_START                       (0x00002000)        /*!< START generation */
#define  I2C_CR2_STOP                        (0x00004000)        /*!< STOP generation (master mode) */
#define  I2C_CR2_NACK                        (0x00008000)        /*!< NACK generation (slave mode) */
#define  I2C_CR2_NBYTES                      (0x00FF0000)        /*!< Number of bytes */
#define  I2C_CR2_RELOAD                      (0x01000000)        /*!< NBYTES reload mode */
#define  I2C_CR2_AUTOEND                     (0x02000000)        /*!< Automatic end mode (master mode) */
#define  I2C_CR2_PECBYTE                     (0x04000000)        /*!< Packet error checking byte */

#define  I2C_OAR1_OA1                        (0x000003FF)        /*!< Interface own address 1 */
#define  I2C_OAR1_OA1MODE                    (0x00000400)        /*!< Own address 1 10-bit mode */
#define  I2C_OAR1_OA1EN                      (0x00008000)        /*!< Own address 1 enable */

#define  I2C_OAR2_OA2                        (0x000000FE)        /*!< Interface own address 2 */
#define  I2C_OAR2_OA2MSK                     (0x00000700)        /*!< Own address 2 masks */
#define  I2C_OAR2_OA2EN                      (0x00008000)        /*!< Own address 2 enable */

#define  I2C_TIMINGR_SCLL                    (0x000000FF)        /*!< SCL low period (master mode) */
#define  I2C_TIMINGR_SCLH                    (0x0000FF00)        /*!< SCL high period (master mode) */
#define  I2C_TIMINGR_SDADEL                  (0x000F0000)        /*!< Data hold time */
#define  I2C_TIMINGR_SCLDEL                  (0x00F00000)        /*!< Data setup time */
#define  I2C_TIMINGR_PRESC                   (0xF0000000)        /*!< Timings prescaler */

#define  I2C_TIMEOUTR_TIMEOUTA               (0x00000FFF)        /*!< Bus timeout A */
#define  I2C_TIMEOUTR_TIDLE                  (0x00001000)        /*!< Idle clock timeout detection */
#define  I2C_TIMEOUTR_TIMOUTEN               (0x00008000)        /*!< Clock timeout enable */
#define  I2C_TIMEOUTR_TIMEOUTB               (0x0FFF0000)        /*!< Bus timeout B*/
#define  I2C_TIMEOUTR_TEXTEN                 (0x80000000)        /*!< Extended clock timeout enable */

#define  I2C_ISR_TXE                         (0x00000001)        /*!< Transmit data register empty */
#define  I2C_ISR_TXIS                        (0x00000002)        /*!< Transmit interrupt status */
#define  I2C_ISR_RXNE                        (0x00000004)        /*!< Receive data register not empty */
#define  I2C_ISR_ADDR                        (0x00000008)        /*!< Address matched (slave mode)*/
#define  I2C_ISR_NACKF                       (0x00000010)        /*!< NACK received flag */
#define  I2C_ISR_STOPF                       (0x00000020)        /*!< STOP detection flag */
#define  I2C_ISR_TC                          (0x00000040)        /*!< Transfer complete (master mode) */
#define  I2C_ISR_TCR                         (0x00000080)        /*!< Transfer complete reload */
#define  I2C_ISR_BERR                        (0x00000100)        /*!< Bus error */
#define  I2C_ISR_ARLO                        (0x00000200)        /*!< Arbitration lost */
#define  I2C_ISR_OVR                         (0x00000400)        /*!< Overrun/Underrun */
#define  I2C_ISR_PECERR                      (0x00000800)        /*!< PEC error in reception */
#define  I2C_ISR_TIMEOUT                     (0x00001000)        /*!< Timeout or Tlow detection flag */
#define  I2C_ISR_ALERT                       (0x00002000)        /*!< SMBus alert */
#define  I2C_ISR_BUSY                        (0x00008000)        /*!< Bus busy */
#define  I2C_ISR_DIR                         (0x00010000)        /*!< Transfer direction (slave mode) */
#define  I2C_ISR_ADDCODE                     (0x00FE0000)        /*!< Address match code (slave mode) */

#define  I2C_ICR_ADDRCF                      (0x00000008)        /*!< Address matched clear flag */
#define  I2C_ICR_NACKCF                      (0x00000010)        /*!< NACK clear flag */
#define  I2C_ICR_STOPCF                      (0x00000020)        /*!< STOP detection clear flag */
#define  I2C_ICR_BERRCF                      (0x00000100)        /*!< Bus error clear flag */
#define  I2C_ICR_ARLOCF                      (0x00000200)        /*!< Arbitration lost clear flag */
#define  I2C_ICR_OVRCF                       (0x00000400)        /*!< Overrun/Underrun clear flag */
#define  I2C_ICR_PECCF                       (0x00000800)        /*!< PAC error clear flag */
#define  I2C_ICR_TIMOUTCF                    (0x00001000)        /*!< Timeout clear flag */
#define  I2C_ICR_ALERTCF                     (0x00002000)        /*!< Alert clear flag */

#define  I2C_PECR_PEC                        (0x000000FF)        /*!< PEC register */

#define  I2C_RXDR_RXDATA                     (0x000000FF)        /*!< 8-bit receive data */

#define  I2C_TXDR_TXDATA                     (0x000000FF)        /*!< 8-bit transmit data */


#define  IWDG_KR_KEY                         (0xFFFF)            /*!< Key value (write only, read 0000h) */

#define  IWDG_PR_PR                          (0x07)               /*!< PR[2:0] (Prescaler divider) */
#define  IWDG_PR_PR_0                        (0x01)               /*!< Bit 0 */
#define  IWDG_PR_PR_1                        (0x02)               /*!< Bit 1 */
#define  IWDG_PR_PR_2                        (0x04)               /*!< Bit 2 */

#define  IWDG_RLR_RL                         (0x0FFF)            /*!< Watchdog counter reload value */

#define  IWDG_SR_PVU                         (0x01)               /*!< Watchdog prescaler value update */
#define  IWDG_SR_RVU                         (0x02)               /*!< Watchdog counter reload value update */
#define  IWDG_SR_WVU                         (0x04)               /*!< Watchdog counter window value update */

