the-nw1-group/acb-modules/acb-common/include/stm/stm32f30x.inc
#define  IWDG_WINR_WIN                       (0x0FFF)            /*!< Watchdog counter window value */

#define  PWR_CR_LPSDSR                       (0x0001)     /*!< Low-power deepsleep/sleep/low power run */
#define  PWR_CR_PDDS                         (0x0002)     /*!< Power Down Deepsleep */
#define  PWR_CR_CWUF                         (0x0004)     /*!< Clear Wakeup Flag */
#define  PWR_CR_CSBF                         (0x0008)     /*!< Clear Standby Flag */
#define  PWR_CR_PVDE                         (0x0010)     /*!< Power Voltage Detector Enable */

#define  PWR_CR_PLS                          (0x00E0)     /*!< PLS[2:0] bits (PVD Level Selection) */
#define  PWR_CR_PLS_0                        (0x0020)     /*!< Bit 0 */
#define  PWR_CR_PLS_1                        (0x0040)     /*!< Bit 1 */
#define  PWR_CR_PLS_2                        (0x0080)     /*!< Bit 2 */

#define  PWR_CR_PLS_LEV0                     (0x0000)     /*!< PVD level 0 */
#define  PWR_CR_PLS_LEV1                     (0x0020)     /*!< PVD level 1 */
#define  PWR_CR_PLS_LEV2                     (0x0040)     /*!< PVD level 2 */
#define  PWR_CR_PLS_LEV3                     (0x0060)     /*!< PVD level 3 */
#define  PWR_CR_PLS_LEV4                     (0x0080)     /*!< PVD level 4 */
#define  PWR_CR_PLS_LEV5                     (0x00A0)     /*!< PVD level 5 */
#define  PWR_CR_PLS_LEV6                     (0x00C0)     /*!< PVD level 6 */
#define  PWR_CR_PLS_LEV7                     (0x00E0)     /*!< PVD level 7 */

#define  PWR_CR_DBP                          (0x0100)     /*!< Disable Backup Domain write protection */

#define  PWR_CSR_WUF                         (0x0001)     /*!< Wakeup Flag */
#define  PWR_CSR_SBF                         (0x0002)     /*!< Standby Flag */
#define  PWR_CSR_PVDO                        (0x0004)     /*!< PVD Output */
#define  PWR_CSR_VREFINTRDYF                 (0x0008)     /*!< Internal voltage reference (VREFINT) ready flag */

#define  PWR_CSR_EWUP1                       (0x0100)     /*!< Enable WKUP pin 1 */
#define  PWR_CSR_EWUP2                       (0x0200)     /*!< Enable WKUP pin 2 */
#define  PWR_CSR_EWUP3                       (0x0400)     /*!< Enable WKUP pin 3 */

#define  RCC_CR_HSION                        (0x00000001)
#define  RCC_CR_HSIRDY                       (0x00000002)

#define  RCC_CR_HSITRIM                      (0x000000F8)
#define  RCC_CR_HSITRIM_0                    (0x00000008)/*!<Bit 0 */
#define  RCC_CR_HSITRIM_1                    (0x00000010)/*!<Bit 1 */
#define  RCC_CR_HSITRIM_2                    (0x00000020)/*!<Bit 2 */
#define  RCC_CR_HSITRIM_3                    (0x00000040)/*!<Bit 3 */
#define  RCC_CR_HSITRIM_4                    (0x00000080)/*!<Bit 4 */

#define  RCC_CR_HSICAL                       (0x0000FF00)
#define  RCC_CR_HSICAL_0                     (0x00000100)/*!<Bit 0 */
#define  RCC_CR_HSICAL_1                     (0x00000200)/*!<Bit 1 */
#define  RCC_CR_HSICAL_2                     (0x00000400)/*!<Bit 2 */
#define  RCC_CR_HSICAL_3                     (0x00000800)/*!<Bit 3 */
#define  RCC_CR_HSICAL_4                     (0x00001000)/*!<Bit 4 */
#define  RCC_CR_HSICAL_5                     (0x00002000)/*!<Bit 5 */
#define  RCC_CR_HSICAL_6                     (0x00004000)/*!<Bit 6 */
#define  RCC_CR_HSICAL_7                     (0x00008000)/*!<Bit 7 */

#define  RCC_CR_HSEON                        (0x00010000)
#define  RCC_CR_HSERDY                       (0x00020000)
#define  RCC_CR_HSEBYP                       (0x00040000)
#define  RCC_CR_CSSON                        (0x00080000)

#define  RCC_CR_PLLON                        (0x01000000)
#define  RCC_CR_PLLRDY                       (0x02000000)

#define  RCC_CFGR_SW                         (0x00000003)        /*!< SW[1:0] bits (System clock Switch) */
#define  RCC_CFGR_SW_0                       (0x00000001)        /*!< Bit 0 */
#define  RCC_CFGR_SW_1                       (0x00000002)        /*!< Bit 1 */

#define  RCC_CFGR_SW_HSI                     (0x00000000)        /*!< HSI selected as system clock */
#define  RCC_CFGR_SW_HSE                     (0x00000001)        /*!< HSE selected as system clock */
#define  RCC_CFGR_SW_PLL                     (0x00000002)        /*!< PLL selected as system clock */

#define  RCC_CFGR_SWS                        (0x0000000C)        /*!< SWS[1:0] bits (System Clock Switch Status) */
#define  RCC_CFGR_SWS_0                      (0x00000004)        /*!< Bit 0 */
#define  RCC_CFGR_SWS_1                      (0x00000008)        /*!< Bit 1 */

#define  RCC_CFGR_SWS_HSI                    (0x00000000)        /*!< HSI oscillator used as system clock */
#define  RCC_CFGR_SWS_HSE                    (0x00000004)        /*!< HSE oscillator used as system clock */
#define  RCC_CFGR_SWS_PLL                    (0x00000008)        /*!< PLL used as system clock */

#define  RCC_CFGR_HPRE                       (0x000000F0)        /*!< HPRE[3:0] bits (AHB prescaler) */
#define  RCC_CFGR_HPRE_0                     (0x00000010)        /*!< Bit 0 */
#define  RCC_CFGR_HPRE_1                     (0x00000020)        /*!< Bit 1 */
#define  RCC_CFGR_HPRE_2                     (0x00000040)        /*!< Bit 2 */
#define  RCC_CFGR_HPRE_3                     (0x00000080)        /*!< Bit 3 */

#define  RCC_CFGR_HPRE_DIV1                  (0x00000000)        /*!< SYSCLK not divided */
#define  RCC_CFGR_HPRE_DIV2                  (0x00000080)        /*!< SYSCLK divided by 2 */
#define  RCC_CFGR_HPRE_DIV4                  (0x00000090)        /*!< SYSCLK divided by 4 */
#define  RCC_CFGR_HPRE_DIV8                  (0x000000A0)        /*!< SYSCLK divided by 8 */
#define  RCC_CFGR_HPRE_DIV16                 (0x000000B0)        /*!< SYSCLK divided by 16 */
#define  RCC_CFGR_HPRE_DIV64                 (0x000000C0)        /*!< SYSCLK divided by 64 */
#define  RCC_CFGR_HPRE_DIV128                (0x000000D0)        /*!< SYSCLK divided by 128 */
#define  RCC_CFGR_HPRE_DIV256                (0x000000E0)        /*!< SYSCLK divided by 256 */
#define  RCC_CFGR_HPRE_DIV512                (0x000000F0)        /*!< SYSCLK divided by 512 */

#define  RCC_CFGR_PPRE1                      (0x00000700)        /*!< PRE1[2:0] bits (APB1 prescaler) */
#define  RCC_CFGR_PPRE1_0                    (0x00000100)        /*!< Bit 0 */
#define  RCC_CFGR_PPRE1_1                    (0x00000200)        /*!< Bit 1 */
#define  RCC_CFGR_PPRE1_2                    (0x00000400)        /*!< Bit 2 */

#define  RCC_CFGR_PPRE1_DIV1                 (0x00000000)        /*!< HCLK not divided */
#define  RCC_CFGR_PPRE1_DIV2                 (0x00000400)        /*!< HCLK divided by 2 */
#define  RCC_CFGR_PPRE1_DIV4                 (0x00000500)        /*!< HCLK divided by 4 */
#define  RCC_CFGR_PPRE1_DIV8                 (0x00000600)        /*!< HCLK divided by 8 */
#define  RCC_CFGR_PPRE1_DIV16                (0x00000700)        /*!< HCLK divided by 16 */

#define  RCC_CFGR_PPRE2                      (0x00003800)        /*!< PRE2[2:0] bits (APB2 prescaler) */
#define  RCC_CFGR_PPRE2_0                    (0x00000800)        /*!< Bit 0 */
#define  RCC_CFGR_PPRE2_1                    (0x00001000)        /*!< Bit 1 */
#define  RCC_CFGR_PPRE2_2                    (0x00002000)        /*!< Bit 2 */

