the-nw1-group/acb-modules/acb-common/include/stm/stm32f30x.inc
#define  RCC_CFGR_PPRE2_DIV1                 (0x00000000)        /*!< HCLK not divided */
#define  RCC_CFGR_PPRE2_DIV2                 (0x00002000)        /*!< HCLK divided by 2 */
#define  RCC_CFGR_PPRE2_DIV4                 (0x00002800)        /*!< HCLK divided by 4 */
#define  RCC_CFGR_PPRE2_DIV8                 (0x00003000)        /*!< HCLK divided by 8 */
#define  RCC_CFGR_PPRE2_DIV16                (0x00003800)        /*!< HCLK divided by 16 */

#define  RCC_CFGR_PLLSRC                     (0x00010000)        /*!< PLL entry clock source */

#define  RCC_CFGR_PLLXTPRE                   (0x00020000)        /*!< HSE divider for PLL entry */

#define  RCC_CFGR_PLLMULL                    (0x003C0000)        /*!< PLLMUL[3:0] bits (PLL multiplication factor) */
#define  RCC_CFGR_PLLMULL_0                  (0x00040000)        /*!< Bit 0 */
#define  RCC_CFGR_PLLMULL_1                  (0x00080000)        /*!< Bit 1 */
#define  RCC_CFGR_PLLMULL_2                  (0x00100000)        /*!< Bit 2 */
#define  RCC_CFGR_PLLMULL_3                  (0x00200000)        /*!< Bit 3 */

#define  RCC_CFGR_PLLSRC_HSI_Div2            (0x00000000)        /*!< HSI clock divided by 2 selected as PLL entry clock source */
#define  RCC_CFGR_PLLSRC_HSI_PREDIV          (0x00008000)        /*!< HSI PREDIV clock selected as PLL entry clock source 
                                                                                (This bit and configuration is only available for STM32F303xE devices)*/

#define  RCC_CFGR_PLLSRC_PREDIV1             (0x00010000)        /*!< PREDIV1 clock selected as PLL entry clock source */

#define  RCC_CFGR_PLLXTPRE_PREDIV1           (0x00000000)        /*!< PREDIV1 clock not divided for PLL entry */
#define  RCC_CFGR_PLLXTPRE_PREDIV1_Div2      (0x00020000)        /*!< PREDIV1 clock divided by 2 for PLL entry */

#define  RCC_CFGR_PLLMULL2                   (0x00000000)        /*!< PLL input clock*2 */
#define  RCC_CFGR_PLLMULL3                   (0x00040000)        /*!< PLL input clock*3 */
#define  RCC_CFGR_PLLMULL4                   (0x00080000)        /*!< PLL input clock*4 */
#define  RCC_CFGR_PLLMULL5                   (0x000C0000)        /*!< PLL input clock*5 */
#define  RCC_CFGR_PLLMULL6                   (0x00100000)        /*!< PLL input clock*6 */
#define  RCC_CFGR_PLLMULL7                   (0x00140000)        /*!< PLL input clock*7 */
#define  RCC_CFGR_PLLMULL8                   (0x00180000)        /*!< PLL input clock*8 */
#define  RCC_CFGR_PLLMULL9                   (0x001C0000)        /*!< PLL input clock*9 */
#define  RCC_CFGR_PLLMULL10                  (0x00200000)        /*!< PLL input clock10 */
#define  RCC_CFGR_PLLMULL11                  (0x00240000)        /*!< PLL input clock*11 */
#define  RCC_CFGR_PLLMULL12                  (0x00280000)        /*!< PLL input clock*12 */
#define  RCC_CFGR_PLLMULL13                  (0x002C0000)        /*!< PLL input clock*13 */
#define  RCC_CFGR_PLLMULL14                  (0x00300000)        /*!< PLL input clock*14 */
#define  RCC_CFGR_PLLMULL15                  (0x00340000)        /*!< PLL input clock*15 */
#define  RCC_CFGR_PLLMULL16                  (0x00380000)        /*!< PLL input clock*16 */

#define  RCC_CFGR_USBPRE                     (0x00400000)        /*!< USB prescaler */

#define  RCC_CFGR_I2SSRC                     (0x00800000)        /*!< I2S external clock source selection */

#define  RCC_CFGR_MCO                        (0x07000000)        /*!< MCO[2:0] bits (Microcontroller Clock Output) */
#define  RCC_CFGR_MCO_0                      (0x01000000)        /*!< Bit 0 */
#define  RCC_CFGR_MCO_1                      (0x02000000)        /*!< Bit 1 */
#define  RCC_CFGR_MCO_2                      (0x04000000)        /*!< Bit 2 */

#define  RCC_CFGR_MCO_NOCLOCK                (0x00000000)        /*!< No clock */
#define  RCC_CFGR_MCO_LSI                    (0x02000000)        /*!< LSI clock selected as MCO source */
#define  RCC_CFGR_MCO_LSE                    (0x03000000)        /*!< LSE clock selected as MCO source */
#define  RCC_CFGR_MCO_SYSCLK                 (0x04000000)        /*!< System clock selected as MCO source */
#define  RCC_CFGR_MCO_HSI                    (0x05000000)        /*!< HSI clock selected as MCO source */
#define  RCC_CFGR_MCO_HSE                    (0x06000000)        /*!< HSE clock selected as MCO source  */
#define  RCC_CFGR_MCO_PLL                    (0x07000000)        /*!< PLL clock divided by 2 selected as MCO source */

#define  RCC_CFGR_MCOF                       (0x10000000)        /*!< Microcontroller Clock Output Flag */

#define  RCC_CFGR_MCO_PRE                    (0x70000000)        /*!< MCO prescaler */
#define  RCC_CFGR_MCO_PRE_1                  (0x00000000)        /*!< MCO is divided by 1 */
#define  RCC_CFGR_MCO_PRE_2                  (0x10000000)        /*!< MCO is divided by 2 */
#define  RCC_CFGR_MCO_PRE_4                  (0x20000000)        /*!< MCO is divided by 4 */
#define  RCC_CFGR_MCO_PRE_8                  (0x30000000)        /*!< MCO is divided by 8 */
#define  RCC_CFGR_MCO_PRE_16                 (0x40000000)        /*!< MCO is divided by 16 */
#define  RCC_CFGR_MCO_PRE_32                 (0x50000000)        /*!< MCO is divided by 32 */
#define  RCC_CFGR_MCO_PRE_64                 (0x60000000)        /*!< MCO is divided by 64 */
#define  RCC_CFGR_MCO_PRE_128                (0x70000000)        /*!< MCO is divided by 128 */

#define  RCC_CFGR_PLLNODIV                   (0x80000000)        /*!< PLL is not divided to MCO */

#define  RCC_CIR_LSIRDYF                     (0x00000001)        /*!< LSI Ready Interrupt flag */
#define  RCC_CIR_LSERDYF                     (0x00000002)        /*!< LSE Ready Interrupt flag */
#define  RCC_CIR_HSIRDYF                     (0x00000004)        /*!< HSI Ready Interrupt flag */
#define  RCC_CIR_HSERDYF                     (0x00000008)        /*!< HSE Ready Interrupt flag */
#define  RCC_CIR_PLLRDYF                     (0x00000010)        /*!< PLL Ready Interrupt flag */
#define  RCC_CIR_CSSF                        (0x00000080)        /*!< Clock Security System Interrupt flag */
#define  RCC_CIR_LSIRDYIE                    (0x00000100)        /*!< LSI Ready Interrupt Enable */
#define  RCC_CIR_LSERDYIE                    (0x00000200)        /*!< LSE Ready Interrupt Enable */
#define  RCC_CIR_HSIRDYIE                    (0x00000400)        /*!< HSI Ready Interrupt Enable */
#define  RCC_CIR_HSERDYIE                    (0x00000800)        /*!< HSE Ready Interrupt Enable */
#define  RCC_CIR_PLLRDYIE                    (0x00001000)        /*!< PLL Ready Interrupt Enable */
#define  RCC_CIR_LSIRDYC                     (0x00010000)        /*!< LSI Ready Interrupt Clear */
#define  RCC_CIR_LSERDYC                     (0x00020000)        /*!< LSE Ready Interrupt Clear */
#define  RCC_CIR_HSIRDYC                     (0x00040000)        /*!< HSI Ready Interrupt Clear */
#define  RCC_CIR_HSERDYC                     (0x00080000)        /*!< HSE Ready Interrupt Clear */
#define  RCC_CIR_PLLRDYC                     (0x00100000)        /*!< PLL Ready Interrupt Clear */
#define  RCC_CIR_CSSC                        (0x00800000)        /*!< Clock Security System Interrupt Clear */

#define  RCC_APB2RSTR_SYSCFGRST              (0x00000001)        /*!< SYSCFG reset */
#define  RCC_APB2RSTR_TIM1RST                (0x00000200)        /*!< TIM1 reset */
#define  RCC_APB2RSTR_SPI1RST                (0x00001000)        /*!< SPI1 reset */
#define  RCC_APB2RSTR_TIM8RST                (0x00002000)        /*!< TIM8 reset */
#define  RCC_APB2RSTR_USART1RST              (0x00004000)        /*!< USART1 reset */
#define  RCC_APB2RSTR_SPI4RST                (0x00008000)        /*!< SPI4 reset */
#define  RCC_APB2RSTR_TIM15RST               (0x00010000)        /*!< TIM15 reset */
#define  RCC_APB2RSTR_TIM16RST               (0x00020000)        /*!< TIM16 reset */
#define  RCC_APB2RSTR_TIM17RST               (0x00040000)        /*!< TIM17 reset */
#define  RCC_APB2RSTR_TIM20RST               (0x00100000)        /*!< TIM20 reset */
#define  RCC_APB2RSTR_HRTIM1RST              (0x20000000)        /*!< HRTIM1 reset */

#define  RCC_APB1RSTR_TIM2RST                (0x00000001)        /*!< Timer 2 reset */
#define  RCC_APB1RSTR_TIM3RST                (0x00000002)        /*!< Timer 3 reset */
#define  RCC_APB1RSTR_TIM4RST                (0x00000004)        /*!< Timer 4 reset */
#define  RCC_APB1RSTR_TIM6RST                (0x00000010)        /*!< Timer 6 reset */
#define  RCC_APB1RSTR_TIM7RST                (0x00000020)        /*!< Timer 7 reset */
#define  RCC_APB1RSTR_WWDGRST                (0x00000800)        /*!< Window Watchdog reset */
#define  RCC_APB1RSTR_SPI2RST                (0x00004000)        /*!< SPI2 reset */
#define  RCC_APB1RSTR_SPI3RST                (0x00008000)        /*!< SPI3 reset */
#define  RCC_APB1RSTR_USART2RST              (0x00020000)        /*!< USART 2 reset */
#define  RCC_APB1RSTR_USART3RST              (0x00040000)        /*!< USART 3 reset */
#define  RCC_APB1RSTR_UART4RST               (0x00080000)        /*!< UART 4 reset */
#define  RCC_APB1RSTR_UART5RST               (0x00100000)        /*!< UART 5 reset */
#define  RCC_APB1RSTR_I2C1RST                (0x00200000)        /*!< I2C 1 reset */
#define  RCC_APB1RSTR_I2C2RST                (0x00400000)        /*!< I2C 2 reset */
#define  RCC_APB1RSTR_USBRST                 (0x00800000)        /*!< USB reset */
#define  RCC_APB1RSTR_CAN1RST                (0x02000000)        /*!< CAN reset */
#define  RCC_APB1RSTR_PWRRST                 (0x10000000)        /*!< PWR reset */
#define  RCC_APB1RSTR_DAC1RST                (0x20000000)        /*!< DAC 1 reset */
#define  RCC_APB1RSTR_I2C3RST                (0x40000000)        /*!< I2C 3 reset */
#define  RCC_APB1RSTR_DAC2RST                (0x04000000)        /*!< DAC 2 reset */
#define  RCC_APB1RSTR_DACRST                 RCC_APB1RSTR_DAC1RST          /*!< DAC reset */

#define  RCC_AHBENR_DMA1EN                   (0x00000001)        /*!< DMA1 clock enable */
#define  RCC_AHBENR_DMA2EN                   (0x00000002)        /*!< DMA2 clock enable */
#define  RCC_AHBENR_SRAMEN                   (0x00000004)        /*!< SRAM interface clock enable */
#define  RCC_AHBENR_FLITFEN                  (0x00000010)        /*!< FLITF clock enable */
#define  RCC_AHBENR_FMCEN                    (0x00000020)        /*!< FMC clock enable */
#define  RCC_AHBENR_CRCEN                    (0x00000040)        /*!< CRC clock enable */
#define  RCC_AHBENR_GPIOHEN                  (0x00010000)        /*!< GPIOH clock enable */
#define  RCC_AHBENR_GPIOAEN                  (0x00020000)        /*!< GPIOA clock enable */
#define  RCC_AHBENR_GPIOBEN                  (0x00040000)        /*!< GPIOB clock enable */
#define  RCC_AHBENR_GPIOCEN                  (0x00080000)        /*!< GPIOC clock enable */
#define  RCC_AHBENR_GPIODEN                  (0x00100000)        /*!< GPIOD clock enable */
#define  RCC_AHBENR_GPIOEEN                  (0x00200000)        /*!< GPIOE clock enable */
#define  RCC_AHBENR_GPIOFEN                  (0x00400000)        /*!< GPIOF clock enable */
#define  RCC_AHBENR_GPIOGEN                  (0x00800000)        /*!< GPIOG clock enable */
#define  RCC_AHBENR_TSEN                     (0x01000000)        /*!< TS clock enable */
#define  RCC_AHBENR_ADC12EN                  (0x10000000)        /*!< ADC1/ ADC2 clock enable */
#define  RCC_AHBENR_ADC34EN                  (0x20000000)        /*!< ADC1/ ADC2 clock enable */

