the-nw1-group/acb-modules/acb-common/include/stm/stm32f30x.inc
#define  RCC_APB2ENR_SYSCFGEN                (0x00000001)        /*!< SYSCFG clock enable */
#define  RCC_APB2ENR_TIM1EN                  (0x00000800)        /*!< TIM1 clock enable */
#define  RCC_APB2ENR_SPI1EN                  (0x00001000)        /*!< SPI1 clock enable */
#define  RCC_APB2ENR_TIM8EN                  (0x00002000)        /*!< TIM8 clock enable */ 
#define  RCC_APB2ENR_USART1EN                (0x00004000)        /*!< USART1 clock enable */
#define  RCC_APB2ENR_SPI4EN                  (0x00008000)        /*!< SPI4 clock enable */
#define  RCC_APB2ENR_TIM15EN                 (0x00010000)        /*!< TIM15 clock enable */
#define  RCC_APB2ENR_TIM16EN                 (0x00020000)        /*!< TIM16 clock enable */
#define  RCC_APB2ENR_TIM17EN                 (0x00040000)        /*!< TIM17 clock enable */
#define  RCC_APB2ENR_TIM20EN                 (0x00100000)        /*!< TIM20 clock enable */
#define  RCC_APB2ENR_HRTIM1                  (0x20000000)        /*!< HRTIM1 clock enable */

#define  RCC_APB1ENR_TIM2EN                  (0x00000001)        /*!< Timer 2 clock enable */
#define  RCC_APB1ENR_TIM3EN                  (0x00000002)        /*!< Timer 3 clock enable */
#define  RCC_APB1ENR_TIM4EN                  (0x00000004)        /*!< Timer 4 clock enable */
#define  RCC_APB1ENR_TIM6EN                  (0x00000010)        /*!< Timer 6 clock enable */
#define  RCC_APB1ENR_TIM7EN                  (0x00000020)        /*!< Timer 7 clock enable */
#define  RCC_APB1ENR_WWDGEN                  (0x00000800)        /*!< Window Watchdog clock enable */
#define  RCC_APB1ENR_SPI2EN                  (0x00004000)        /*!< SPI2 clock enable */
#define  RCC_APB1ENR_SPI3EN                  (0x00008000)        /*!< SPI3 clock enable */
#define  RCC_APB1ENR_USART2EN                (0x00020000)        /*!< USART 2 clock enable */
#define  RCC_APB1ENR_USART3EN                (0x00040000)        /*!< USART 3 clock enable */
#define  RCC_APB1ENR_UART4EN                 (0x00080000)        /*!< UART 4 clock enable */
#define  RCC_APB1ENR_UART5EN                 (0x00100000)        /*!< UART 5 clock enable */
#define  RCC_APB1ENR_I2C1EN                  (0x00200000)        /*!< I2C 1 clock enable */
#define  RCC_APB1ENR_I2C2EN                  (0x00400000)        /*!< I2C 2 clock enable */
#define  RCC_APB1ENR_USBEN                   (0x00800000)        /*!< USB clock enable */
#define  RCC_APB1ENR_CAN1EN                  (0x02000000)        /*!< CAN clock enable */
#define  RCC_APB1ENR_DAC2EN                  (0x04000000)        /*!< DAC 2 clock enable */
#define  RCC_APB1ENR_PWREN                   (0x10000000)        /*!< PWR clock enable */
#define  RCC_APB1ENR_DAC1EN                  (0x20000000)        /*!< DAC clock enable */
#define  RCC_APB1ENR_I2C3EN                  (0x40000000)        /*!< I2C 3 clock enable */
#define  RCC_APB1ENR_DACEN                   RCC_APB1ENR_DAC1EN

#define  RCC_BDCR_LSEON                      (0x00000001)        /*!< External Low Speed oscillator enable */
#define  RCC_BDCR_LSERDY                     (0x00000002)        /*!< External Low Speed oscillator Ready */
#define  RCC_BDCR_LSEBYP                     (0x00000004)        /*!< External Low Speed oscillator Bypass */

#define  RCC_BDCR_LSEDRV                     (0x00000018)        /*!< LSEDRV[1:0] bits (LSE Osc. drive capability) */
#define  RCC_BDCR_LSEDRV_0                   (0x00000008)        /*!< Bit 0 */
#define  RCC_BDCR_LSEDRV_1                   (0x00000010)        /*!< Bit 1 */


#define  RCC_BDCR_RTCSEL                     (0x00000300)        /*!< RTCSEL[1:0] bits (RTC clock source selection) */
#define  RCC_BDCR_RTCSEL_0                   (0x00000100)        /*!< Bit 0 */
#define  RCC_BDCR_RTCSEL_1                   (0x00000200)        /*!< Bit 1 */

#define  RCC_BDCR_RTCSEL_NOCLOCK             (0x00000000)        /*!< No clock */
#define  RCC_BDCR_RTCSEL_LSE                 (0x00000100)        /*!< LSE oscillator clock used as RTC clock */
#define  RCC_BDCR_RTCSEL_LSI                 (0x00000200)        /*!< LSI oscillator clock used as RTC clock */
#define  RCC_BDCR_RTCSEL_HSE                 (0x00000300)        /*!< HSE oscillator clock divided by 32 used as RTC clock */

#define  RCC_BDCR_RTCEN                      (0x00008000)        /*!< RTC clock enable */
#define  RCC_BDCR_BDRST                      (0x00010000)        /*!< Backup domain software reset  */

#define  RCC_CSR_LSION                       (0x00000001)        /*!< Internal Low Speed oscillator enable */
#define  RCC_CSR_LSIRDY                      (0x00000002)        /*!< Internal Low Speed oscillator Ready */
#define  RCC_CSR_RMVF                        (0x01000000)        /*!< Remove reset flag */
#define  RCC_CSR_OBLRSTF                     (0x02000000)        /*!< OBL reset flag */
#define  RCC_CSR_PINRSTF                     (0x04000000)        /*!< PIN reset flag */
#define  RCC_CSR_PORRSTF                     (0x08000000)        /*!< POR/PDR reset flag */
#define  RCC_CSR_SFTRSTF                     (0x10000000)        /*!< Software Reset flag */
#define  RCC_CSR_IWDGRSTF                    (0x20000000)        /*!< Independent Watchdog reset flag */
#define  RCC_CSR_WWDGRSTF                    (0x40000000)        /*!< Window watchdog reset flag */
#define  RCC_CSR_LPWRRSTF                    (0x80000000)        /*!< Low-Power reset flag */

#define  RCC_AHBRSTR_FMCRST                  (0x00000020)         /*!< FMC reset */
#define  RCC_AHBRSTR_GPIOHRST                (0x00010000)         /*!< GPIOH reset */
#define  RCC_AHBRSTR_GPIOARST                (0x00020000)         /*!< GPIOA reset */
#define  RCC_AHBRSTR_GPIOBRST                (0x00040000)         /*!< GPIOB reset */
#define  RCC_AHBRSTR_GPIOCRST                (0x00080000)         /*!< GPIOC reset */
#define  RCC_AHBRSTR_GPIODRST                (0x00010000)         /*!< GPIOD reset */
#define  RCC_AHBRSTR_GPIOERST                (0x00200000)         /*!< GPIOE reset */
#define  RCC_AHBRSTR_GPIOFRST                (0x00400000)         /*!< GPIOF reset */
#define  RCC_AHBRSTR_GPIOGRST                (0x00800000)         /*!< GPIOG reset */
#define  RCC_AHBRSTR_TSRST                   (0x00100000)         /*!< TS reset */
#define  RCC_AHBRSTR_ADC12RST                (0x01000000)         /*!< ADC1 & ADC2 reset */
#define  RCC_AHBRSTR_ADC34RST                (0x02000000)         /*!< ADC3 & ADC4 reset */

