the-nw1-group/acb-modules/acb-common/include/stm/stm32f30x.inc
#define  RCC_CFGR2_PREDIV1                   (0x0000000F)        /*!< PREDIV1[3:0] bits */
#define  RCC_CFGR2_PREDIV1_0                 (0x00000001)        /*!< Bit 0 */
#define  RCC_CFGR2_PREDIV1_1                 (0x00000002)        /*!< Bit 1 */
#define  RCC_CFGR2_PREDIV1_2                 (0x00000004)        /*!< Bit 2 */
#define  RCC_CFGR2_PREDIV1_3                 (0x00000008)        /*!< Bit 3 */

#define  RCC_CFGR2_PREDIV1_DIV1              (0x00000000)        /*!< PREDIV1 input clock not divided */
#define  RCC_CFGR2_PREDIV1_DIV2              (0x00000001)        /*!< PREDIV1 input clock divided by 2 */
#define  RCC_CFGR2_PREDIV1_DIV3              (0x00000002)        /*!< PREDIV1 input clock divided by 3 */
#define  RCC_CFGR2_PREDIV1_DIV4              (0x00000003)        /*!< PREDIV1 input clock divided by 4 */
#define  RCC_CFGR2_PREDIV1_DIV5              (0x00000004)        /*!< PREDIV1 input clock divided by 5 */
#define  RCC_CFGR2_PREDIV1_DIV6              (0x00000005)        /*!< PREDIV1 input clock divided by 6 */
#define  RCC_CFGR2_PREDIV1_DIV7              (0x00000006)        /*!< PREDIV1 input clock divided by 7 */
#define  RCC_CFGR2_PREDIV1_DIV8              (0x00000007)        /*!< PREDIV1 input clock divided by 8 */
#define  RCC_CFGR2_PREDIV1_DIV9              (0x00000008)        /*!< PREDIV1 input clock divided by 9 */
#define  RCC_CFGR2_PREDIV1_DIV10             (0x00000009)        /*!< PREDIV1 input clock divided by 10 */
#define  RCC_CFGR2_PREDIV1_DIV11             (0x0000000A)        /*!< PREDIV1 input clock divided by 11 */
#define  RCC_CFGR2_PREDIV1_DIV12             (0x0000000B)        /*!< PREDIV1 input clock divided by 12 */
#define  RCC_CFGR2_PREDIV1_DIV13             (0x0000000C)        /*!< PREDIV1 input clock divided by 13 */
#define  RCC_CFGR2_PREDIV1_DIV14             (0x0000000D)        /*!< PREDIV1 input clock divided by 14 */
#define  RCC_CFGR2_PREDIV1_DIV15             (0x0000000E)        /*!< PREDIV1 input clock divided by 15 */
#define  RCC_CFGR2_PREDIV1_DIV16             (0x0000000F)        /*!< PREDIV1 input clock divided by 16 */

#define  RCC_CFGR2_ADCPRE12                  (0x000001F0)        /*!< ADCPRE12[8:4] bits */
#define  RCC_CFGR2_ADCPRE12_0                (0x00000010)        /*!< Bit 0 */
#define  RCC_CFGR2_ADCPRE12_1                (0x00000020)        /*!< Bit 1 */
#define  RCC_CFGR2_ADCPRE12_2                (0x00000040)        /*!< Bit 2 */
#define  RCC_CFGR2_ADCPRE12_3                (0x00000080)        /*!< Bit 3 */
#define  RCC_CFGR2_ADCPRE12_4                (0x00000100)        /*!< Bit 4 */

#define  RCC_CFGR2_ADCPRE12_NO               (0x00000000)        /*!< ADC12 clock disabled, ADC12 can use AHB clock */
#define  RCC_CFGR2_ADCPRE12_DIV1             (0x00000100)        /*!< ADC12 PLL clock divided by 1 */
#define  RCC_CFGR2_ADCPRE12_DIV2             (0x00000110)        /*!< ADC12 PLL clock divided by 2 */
#define  RCC_CFGR2_ADCPRE12_DIV4             (0x00000120)        /*!< ADC12 PLL clock divided by 4 */
#define  RCC_CFGR2_ADCPRE12_DIV6             (0x00000130)        /*!< ADC12 PLL clock divided by 6 */
#define  RCC_CFGR2_ADCPRE12_DIV8             (0x00000140)        /*!< ADC12 PLL clock divided by 8 */
#define  RCC_CFGR2_ADCPRE12_DIV10            (0x00000150)        /*!< ADC12 PLL clock divided by 10 */
#define  RCC_CFGR2_ADCPRE12_DIV12            (0x00000160)        /*!< ADC12 PLL clock divided by 12 */
#define  RCC_CFGR2_ADCPRE12_DIV16            (0x00000170)        /*!< ADC12 PLL clock divided by 16 */
#define  RCC_CFGR2_ADCPRE12_DIV32            (0x00000180)        /*!< ADC12 PLL clock divided by 32 */
#define  RCC_CFGR2_ADCPRE12_DIV64            (0x00000190)        /*!< ADC12 PLL clock divided by 64 */
#define  RCC_CFGR2_ADCPRE12_DIV128           (0x000001A0)        /*!< ADC12 PLL clock divided by 128 */
#define  RCC_CFGR2_ADCPRE12_DIV256           (0x000001B0)        /*!< ADC12 PLL clock divided by 256 */

#define  RCC_CFGR2_ADCPRE34                  (0x00003E00)        /*!< ADCPRE34[13:5] bits */
#define  RCC_CFGR2_ADCPRE34_0                (0x00000200)        /*!< Bit 0 */
#define  RCC_CFGR2_ADCPRE34_1                (0x00000400)        /*!< Bit 1 */
#define  RCC_CFGR2_ADCPRE34_2                (0x00000800)        /*!< Bit 2 */
#define  RCC_CFGR2_ADCPRE34_3                (0x00001000)        /*!< Bit 3 */
#define  RCC_CFGR2_ADCPRE34_4                (0x00002000)        /*!< Bit 4 */

#define  RCC_CFGR2_ADCPRE34_NO               (0x00000000)        /*!< ADC34 clock disabled, ADC34 can use AHB clock */
#define  RCC_CFGR2_ADCPRE34_DIV1             (0x00002000)        /*!< ADC34 PLL clock divided by 1 */
#define  RCC_CFGR2_ADCPRE34_DIV2             (0x00002200)        /*!< ADC34 PLL clock divided by 2 */
#define  RCC_CFGR2_ADCPRE34_DIV4             (0x00002400)        /*!< ADC34 PLL clock divided by 4 */
#define  RCC_CFGR2_ADCPRE34_DIV6             (0x00002600)        /*!< ADC34 PLL clock divided by 6 */
#define  RCC_CFGR2_ADCPRE34_DIV8             (0x00002800)        /*!< ADC34 PLL clock divided by 8 */
#define  RCC_CFGR2_ADCPRE34_DIV10            (0x00002A00)        /*!< ADC34 PLL clock divided by 10 */
#define  RCC_CFGR2_ADCPRE34_DIV12            (0x00002C00)        /*!< ADC34 PLL clock divided by 12 */
#define  RCC_CFGR2_ADCPRE34_DIV16            (0x00002E00)        /*!< ADC34 PLL clock divided by 16 */
#define  RCC_CFGR2_ADCPRE34_DIV32            (0x00003000)        /*!< ADC34 PLL clock divided by 32 */
#define  RCC_CFGR2_ADCPRE34_DIV64            (0x00003200)        /*!< ADC34 PLL clock divided by 64 */
#define  RCC_CFGR2_ADCPRE34_DIV128           (0x00003400)        /*!< ADC34 PLL clock divided by 128 */
#define  RCC_CFGR2_ADCPRE34_DIV256           (0x00003600)        /*!< ADC34 PLL clock divided by 256 */

#define  RCC_CFGR3_USART1SW                  (0x00000003)        /*!< USART1SW[1:0] bits */
#define  RCC_CFGR3_USART1SW_0                (0x00000001)        /*!< Bit 0 */
#define  RCC_CFGR3_USART1SW_1                (0x00000002)        /*!< Bit 1 */

#define  RCC_CFGR3_I2CSW                     (0x00000070)        /*!< I2CSW bits */
#define  RCC_CFGR3_I2C1SW                    (0x00000010)        /*!< I2C1SW bits */ 
#define  RCC_CFGR3_I2C2SW                    (0x00000020)        /*!< I2C2SW bits */
#define  RCC_CFGR3_I2C3SW                    (0x00000040)        /*!< I2C3SW bits */

#define  RCC_CFGR3_TIMSW                     (0x00002F00)        /*!< TIMSW bits */
#define  RCC_CFGR3_TIM1SW                    (0x00000100)        /*!< TIM1SW bits */ 
#define  RCC_CFGR3_TIM8SW                    (0x00000200)        /*!< TIM8SW bits */
#define  RCC_CFGR3_TIM15SW                   (0x00000400)        /*!< TIM15SW bits */
#define  RCC_CFGR3_TIM16SW                   (0x00000800)        /*!< TIM16SW bits */
#define  RCC_CFGR3_TIM17SW                   (0x00002000)        /*!< TIM17SW bits */
#define  RCC_CFGR3_TIM20SW                   (0x00008000)        /*!< TIM20SW bits */
#define  RCC_CFGR3_TIM2SW                    (0x01000000)        /*!< TIM3SW bits */
#define  RCC_CFGR3_TIM3SW                    (0x02000000)        /*!< TIM2SW bits */


#define  RCC_CFGR3_HRTIM1SW                  (0x00001000)        /*!< HRTIM1SW bits */

