the-nw1-group/acb-modules/acb-common/include/stm/stm32f30x.inc
#define  RCC_CFGR3_USART2SW                  (0x00030000)        /*!< USART2SW[1:0] bits */
#define  RCC_CFGR3_USART2SW_0                (0x00010000)        /*!< Bit 0 */
#define  RCC_CFGR3_USART2SW_1                (0x00020000)        /*!< Bit 1 */

#define  RCC_CFGR3_USART3SW                  (0x000C0000)        /*!< USART3SW[1:0] bits */
#define  RCC_CFGR3_USART3SW_0                (0x00040000)        /*!< Bit 0 */
#define  RCC_CFGR3_USART3SW_1                (0x00080000)        /*!< Bit 1 */

#define  RCC_CFGR3_UART4SW                   (0x00300000)        /*!< UART4SW[1:0] bits */
#define  RCC_CFGR3_UART4SW_0                 (0x00100000)        /*!< Bit 0 */
#define  RCC_CFGR3_UART4SW_1                 (0x00200000)        /*!< Bit 1 */

#define  RCC_CFGR3_UART5SW                   (0x00C00000)        /*!< UART5SW[1:0] bits */
#define  RCC_CFGR3_UART5SW_0                 (0x00400000)        /*!< Bit 0 */
#define  RCC_CFGR3_UART5SW_1                 (0x00800000)        /*!< Bit 1 */

#define  RCC_CFGR3_TIM2SW                    (0x01000000)        /*!< TIM3SW bits */
#define  RCC_CFGR3_TIM3SW                    (0x02000000)        /*!< TIM2SW bits */

#define RTC_TR_PM                            (0x00400000)
#define RTC_TR_HT                            (0x00300000)
#define RTC_TR_HT_0                          (0x00100000)
#define RTC_TR_HT_1                          (0x00200000)
#define RTC_TR_HU                            (0x000F0000)
#define RTC_TR_HU_0                          (0x00010000)
#define RTC_TR_HU_1                          (0x00020000)
#define RTC_TR_HU_2                          (0x00040000)
#define RTC_TR_HU_3                          (0x00080000)
#define RTC_TR_MNT                           (0x00007000)
#define RTC_TR_MNT_0                         (0x00001000)
#define RTC_TR_MNT_1                         (0x00002000)
#define RTC_TR_MNT_2                         (0x00004000)
#define RTC_TR_MNU                           (0x00000F00)
#define RTC_TR_MNU_0                         (0x00000100)
#define RTC_TR_MNU_1                         (0x00000200)
#define RTC_TR_MNU_2                         (0x00000400)
#define RTC_TR_MNU_3                         (0x00000800)
#define RTC_TR_ST                            (0x00000070)
#define RTC_TR_ST_0                          (0x00000010)
#define RTC_TR_ST_1                          (0x00000020)
#define RTC_TR_ST_2                          (0x00000040)
#define RTC_TR_SU                            (0x0000000F)
#define RTC_TR_SU_0                          (0x00000001)
#define RTC_TR_SU_1                          (0x00000002)
#define RTC_TR_SU_2                          (0x00000004)
#define RTC_TR_SU_3                          (0x00000008)

#define RTC_DR_YT                            (0x00F00000)
#define RTC_DR_YT_0                          (0x00100000)
#define RTC_DR_YT_1                          (0x00200000)
#define RTC_DR_YT_2                          (0x00400000)
#define RTC_DR_YT_3                          (0x00800000)
#define RTC_DR_YU                            (0x000F0000)
#define RTC_DR_YU_0                          (0x00010000)
#define RTC_DR_YU_1                          (0x00020000)
#define RTC_DR_YU_2                          (0x00040000)
#define RTC_DR_YU_3                          (0x00080000)
#define RTC_DR_WDU                           (0x0000E000)
#define RTC_DR_WDU_0                         (0x00002000)
#define RTC_DR_WDU_1                         (0x00004000)
#define RTC_DR_WDU_2                         (0x00008000)
#define RTC_DR_MT                            (0x00001000)
#define RTC_DR_MU                            (0x00000F00)
#define RTC_DR_MU_0                          (0x00000100)
#define RTC_DR_MU_1                          (0x00000200)
#define RTC_DR_MU_2                          (0x00000400)
#define RTC_DR_MU_3                          (0x00000800)
#define RTC_DR_DT                            (0x00000030)
#define RTC_DR_DT_0                          (0x00000010)
#define RTC_DR_DT_1                          (0x00000020)
#define RTC_DR_DU                            (0x0000000F)
#define RTC_DR_DU_0                          (0x00000001)
#define RTC_DR_DU_1                          (0x00000002)
#define RTC_DR_DU_2                          (0x00000004)
#define RTC_DR_DU_3                          (0x00000008)

#define RTC_CR_COE                           (0x00800000)
#define RTC_CR_OSEL                          (0x00600000)
#define RTC_CR_OSEL_0                        (0x00200000)
#define RTC_CR_OSEL_1                        (0x00400000)
#define RTC_CR_POL                           (0x00100000)
#define RTC_CR_COSEL                         (0x00080000)
#define RTC_CR_BCK                           (0x00040000)
#define RTC_CR_SUB1H                         (0x00020000)
#define RTC_CR_ADD1H                         (0x00010000)
#define RTC_CR_TSIE                          (0x00008000)
#define RTC_CR_WUTIE                         (0x00004000)
#define RTC_CR_ALRBIE                        (0x00002000)
#define RTC_CR_ALRAIE                        (0x00001000)
#define RTC_CR_TSE                           (0x00000800)
#define RTC_CR_WUTE                          (0x00000400)
#define RTC_CR_ALRBE                         (0x00000200)
#define RTC_CR_ALRAE                         (0x00000100)
#define RTC_CR_FMT                           (0x00000040)
#define RTC_CR_BYPSHAD                       (0x00000020)
#define RTC_CR_REFCKON                       (0x00000010)
#define RTC_CR_TSEDGE                        (0x00000008)
#define RTC_CR_WUCKSEL                       (0x00000007)
#define RTC_CR_WUCKSEL_0                     (0x00000001)
#define RTC_CR_WUCKSEL_1                     (0x00000002)
#define RTC_CR_WUCKSEL_2                     (0x00000004)

#define RTC_ISR_RECALPF                      (0x00010000)
#define RTC_ISR_TAMP3F                       (0x00008000)
#define RTC_ISR_TAMP2F                       (0x00004000)
#define RTC_ISR_TAMP1F                       (0x00002000)
#define RTC_ISR_TSOVF                        (0x00001000)
#define RTC_ISR_TSF                          (0x00000800)
#define RTC_ISR_WUTF                         (0x00000400)
#define RTC_ISR_ALRBF                        (0x00000200)
#define RTC_ISR_ALRAF                        (0x00000100)
#define RTC_ISR_INIT                         (0x00000080)
#define RTC_ISR_INITF                        (0x00000040)
#define RTC_ISR_RSF                          (0x00000020)
#define RTC_ISR_INITS                        (0x00000010)
#define RTC_ISR_SHPF                         (0x00000008)
#define RTC_ISR_WUTWF                        (0x00000004)
#define RTC_ISR_ALRBWF                       (0x00000002)
#define RTC_ISR_ALRAWF                       (0x00000001)

