the-nw1-group/acb-modules/acb-common/include/stm/stm32f30x.inc
#define RTC_BKP1R                            (0xFFFFFFFF)

#define RTC_BKP2R                            (0xFFFFFFFF)

#define RTC_BKP3R                            (0xFFFFFFFF)

#define RTC_BKP4R                            (0xFFFFFFFF)

#define RTC_BKP5R                            (0xFFFFFFFF)

#define RTC_BKP6R                            (0xFFFFFFFF)

#define RTC_BKP7R                            (0xFFFFFFFF)

#define RTC_BKP8R                            (0xFFFFFFFF)

#define RTC_BKP9R                            (0xFFFFFFFF)

#define RTC_BKP10R                           (0xFFFFFFFF)

#define RTC_BKP11R                           (0xFFFFFFFF)

#define RTC_BKP12R                           (0xFFFFFFFF)

#define RTC_BKP13R                           (0xFFFFFFFF)

#define RTC_BKP14R                           (0xFFFFFFFF)

#define RTC_BKP15R                           (0xFFFFFFFF)

#define  SPI_CR1_CPHA                        (0x0001)            /*!< Clock Phase */
#define  SPI_CR1_CPOL                        (0x0002)            /*!< Clock Polarity */
#define  SPI_CR1_MSTR                        (0x0004)            /*!< Master Selection */

#define  SPI_CR1_BR                          (0x0038)            /*!< BR[2:0] bits (Baud Rate Control) */
#define  SPI_CR1_BR_0                        (0x0008)            /*!< Bit 0 */
#define  SPI_CR1_BR_1                        (0x0010)            /*!< Bit 1 */
#define  SPI_CR1_BR_2                        (0x0020)            /*!< Bit 2 */

#define  SPI_CR1_SPE                         (0x0040)            /*!< SPI Enable */
#define  SPI_CR1_LSBFIRST                    (0x0080)            /*!< Frame Format */
#define  SPI_CR1_SSI                         (0x0100)            /*!< Internal slave select */
#define  SPI_CR1_SSM                         (0x0200)            /*!< Software slave management */
#define  SPI_CR1_RXONLY                      (0x0400)            /*!< Receive only */
#define  SPI_CR1_CRCL                        (0x0800)            /*!< CRC Length */
#define  SPI_CR1_CRCNEXT                     (0x1000)            /*!< Transmit CRC next */
#define  SPI_CR1_CRCEN                       (0x2000)            /*!< Hardware CRC calculation enable */
#define  SPI_CR1_BIDIOE                      (0x4000)            /*!< Output enable in bidirectional mode */
#define  SPI_CR1_BIDIMODE                    (0x8000)            /*!< Bidirectional data mode enable */

#define  SPI_CR2_RXDMAEN                     (0x0001)            /*!< Rx Buffer DMA Enable */
#define  SPI_CR2_TXDMAEN                     (0x0002)            /*!< Tx Buffer DMA Enable */
#define  SPI_CR2_SSOE                        (0x0004)            /*!< SS Output Enable */
#define  SPI_CR2_NSSP                        (0x0008)            /*!< NSS pulse management Enable */
#define  SPI_CR2_FRF                         (0x0010)            /*!< Frame Format Enable */
#define  SPI_CR2_ERRIE                       (0x0020)            /*!< Error Interrupt Enable */
#define  SPI_CR2_RXNEIE                      (0x0040)            /*!< RX buffer Not Empty Interrupt Enable */
#define  SPI_CR2_TXEIE                       (0x0080)            /*!< Tx buffer Empty Interrupt Enable */

#define  SPI_CR2_DS                          (0x0F00)            /*!< DS[3:0] Data Size */
#define  SPI_CR2_DS_0                        (0x0100)            /*!< Bit 0 */
#define  SPI_CR2_DS_1                        (0x0200)            /*!< Bit 1 */
#define  SPI_CR2_DS_2                        (0x0400)            /*!< Bit 2 */
#define  SPI_CR2_DS_3                        (0x0800)            /*!< Bit 3 */

#define  SPI_CR2_FRXTH                       (0x1000)            /*!< FIFO reception Threshold */
#define  SPI_CR2_LDMARX                      (0x2000)            /*!< Last DMA transfer for reception */
#define  SPI_CR2_LDMATX                      (0x4000)            /*!< Last DMA transfer for transmission */

#define  SPI_SR_RXNE                         (0x0001)            /*!< Receive buffer Not Empty */
#define  SPI_SR_TXE                          (0x0002)            /*!< Transmit buffer Empty */
#define  SPI_SR_CRCERR                       (0x0010)            /*!< CRC Error flag */
#define  SPI_SR_MODF                         (0x0020)            /*!< Mode fault */
#define  SPI_SR_OVR                          (0x0040)            /*!< Overrun flag */
#define  SPI_SR_BSY                          (0x0080)            /*!< Busy flag */
#define  SPI_SR_FRE                          (0x0100)            /*!< TI frame format error */
#define  SPI_SR_FRLVL                        (0x0600)            /*!< FIFO Reception Level */
#define  SPI_SR_FRLVL_0                      (0x0200)            /*!< Bit 0 */
#define  SPI_SR_FRLVL_1                      (0x0400)            /*!< Bit 1 */
#define  SPI_SR_FTLVL                        (0x1800)            /*!< FIFO Transmission Level */
#define  SPI_SR_FTLVL_0                      (0x0800)            /*!< Bit 0 */
#define  SPI_SR_FTLVL_1                      (0x1000)            /*!< Bit 1 */  

#define  SPI_DR_DR                           (0xFFFF)            /*!< Data Register */

#define  SPI_CRCPR_CRCPOLY                   (0xFFFF)            /*!< CRC polynomial register */

#define  SPI_RXCRCR_RXCRC                    (0xFFFF)            /*!< Rx CRC Register */

#define  SPI_TXCRCR_TXCRC                    (0xFFFF)            /*!< Tx CRC Register */

#define  SPI_I2SCFGR_CHLEN                   (0x0001)            /*!<Channel length (number of bits per audio channel) */

#define  SPI_I2SCFGR_DATLEN                  (0x0006)            /*!<DATLEN[1:0] bits (Data length to be transferred) */
#define  SPI_I2SCFGR_DATLEN_0                (0x0002)            /*!<Bit 0 */
#define  SPI_I2SCFGR_DATLEN_1                (0x0004)            /*!<Bit 1 */

#define  SPI_I2SCFGR_CKPOL                   (0x0008)            /*!<steady state clock polarity */

#define  SPI_I2SCFGR_I2SSTD                  (0x0030)            /*!<I2SSTD[1:0] bits (I2S standard selection) */
#define  SPI_I2SCFGR_I2SSTD_0                (0x0010)            /*!<Bit 0 */
#define  SPI_I2SCFGR_I2SSTD_1                (0x0020)            /*!<Bit 1 */

#define  SPI_I2SCFGR_PCMSYNC                 (0x0080)            /*!<PCM frame synchronization */

#define  SPI_I2SCFGR_I2SCFG                  (0x0300)            /*!<I2SCFG[1:0] bits (I2S configuration mode) */
#define  SPI_I2SCFGR_I2SCFG_0                (0x0100)            /*!<Bit 0 */
#define  SPI_I2SCFGR_I2SCFG_1                (0x0200)            /*!<Bit 1 */

