the-nw1-group/acb-modules/acb-common/include/stm/stm32f30x.inc
#define  SPI_I2SCFGR_I2SE                    (0x0400)            /*!<I2S Enable */
#define  SPI_I2SCFGR_I2SMOD                  (0x0800)            /*!<I2S mode selection */

#define  SPI_I2SPR_I2SDIV                    (0x00FF)            /*!<I2S Linear prescaler */
#define  SPI_I2SPR_ODD                       (0x0100)            /*!<Odd factor for the prescaler */
#define  SPI_I2SPR_MCKOE                     (0x0200)            /*!<Master Clock Output Enable */

#define SYSCFG_CFGR1_MEM_MODE               (0x00000007) /*!< SYSCFG_Memory Remap Config */
#define SYSCFG_CFGR1_MEM_MODE_0             (0x00000001) /*!< Bit 0 */
#define SYSCFG_CFGR1_MEM_MODE_1             (0x00000002) /*!< Bit 1 */
#define SYSCFG_CFGR1_MEM_MODE_2             (0x00000004) /*!< Bit 2 */
#define SYSCFG_CFGR1_USB_IT_RMP             (0x00000020) /*!< USB interrupt remap */
#define SYSCFG_CFGR1_TIM1_ITR3_RMP          (0x00000040) /*!< Timer 1 ITR3 selection */
#define SYSCFG_CFGR1_DAC1_TRIG1_RMP         (0x00000080) /*!< DAC1 Trigger1 remap */
#define SYSCFG_CFGR1_ADC24_DMA_RMP          (0x00000100) /*!< ADC2 and ADC4 DMA remap */
#define SYSCFG_CFGR1_TIM16_DMA_RMP          (0x00000800) /*!< Timer 16 DMA remap */
#define SYSCFG_CFGR1_TIM17_DMA_RMP          (0x00001000) /*!< Timer 17 DMA remap */
#define SYSCFG_CFGR1_TIM6DAC1Ch1_DMA_RMP    (0x00002000) /*!< Timer 6 / DAC1 CH1 DMA remap */
#define SYSCFG_CFGR1_TIM7DAC1Ch2_DMA_RMP    (0x00004000) /*!< Timer 7 / DAC1 CH2 DMA remap */
#define SYSCFG_CFGR1_DAC2Ch1_DMA_RMP        (0x00008000) /*!< DAC2 CH1 DMA remap */
#define SYSCFG_CFGR1_I2C_PB6_FMP            (0x00010000) /*!< I2C PB6 Fast mode plus */
#define SYSCFG_CFGR1_I2C_PB7_FMP            (0x00020000) /*!< I2C PB7 Fast mode plus */
#define SYSCFG_CFGR1_I2C_PB8_FMP            (0x00040000) /*!< I2C PB8 Fast mode plus */
#define SYSCFG_CFGR1_I2C_PB9_FMP            (0x00080000) /*!< I2C PB9 Fast mode plus */
#define SYSCFG_CFGR1_I2C1_FMP               (0x00100000) /*!< I2C1 Fast mode plus */
#define SYSCFG_CFGR1_I2C2_FMP               (0x00200000) /*!< I2C2 Fast mode plus */
#define SYSCFG_CFGR1_ENCODER_MODE           (0x00C00000) /*!< Encoder Mode */
#define SYSCFG_CFGR1_ENCODER_MODE_0         (0x00400000) /*!< Encoder Mode 0 */
#define SYSCFG_CFGR1_ENCODER_MODE_1         (0x00800000) /*!< Encoder Mode 1 */
#define SYSCFG_CFGR1_I2C3_FMP               (0x01000000) /*!< I2C3 Fast mode plus */
#define SYSCFG_CFGR1_FPU_IE                 (0xFC000000) /*!< Floating Point Unit Interrupt Enable */
#define SYSCFG_CFGR1_FPU_IE_0               (0x04000000) /*!< Floating Point Unit Interrupt Enable 0 */
#define SYSCFG_CFGR1_FPU_IE_1               (0x08000000) /*!< Floating Point Unit Interrupt Enable 1 */
#define SYSCFG_CFGR1_FPU_IE_2               (0x10000000) /*!< Floating Point Unit Interrupt Enable 2 */
#define SYSCFG_CFGR1_FPU_IE_3               (0x20000000) /*!< Floating Point Unit Interrupt Enable 3 */
#define SYSCFG_CFGR1_FPU_IE_4               (0x40000000) /*!< Floating Point Unit Interrupt Enable 4 */
#define SYSCFG_CFGR1_FPU_IE_5               (0x80000000) /*!< Floating Point Unit Interrupt Enable 5 */
#define SYSCFG_CFGR1_DAC_TRIG_RMP           SYSCFG_CFGR1_DAC1_TRIG1_RMP  /*!< Old define maintained for legacy purpose */
#define SYSCFG_CFGR1_TIM6DAC1               SYSCFG_CFGR1_TIM6DAC1Ch1_DMA_RMP /*!< Old define maintained for legacy purpose */
#define SYSCFG_CFGR1_TIM7DAC2               SYSCFG_CFGR1_TIM7DAC1Ch2_DMA_RMP /*!< Old define maintained for legacy purpose */
#define SYSCFG_RCR_PAGE0          (0x00000001) /*!< ICODE SRAM Write protection page 0 */
#define SYSCFG_RCR_PAGE1          (0x00000002) /*!< ICODE SRAM Write protection page 1 */
#define SYSCFG_RCR_PAGE2          (0x00000004) /*!< ICODE SRAM Write protection page 2 */
#define SYSCFG_RCR_PAGE3          (0x00000008) /*!< ICODE SRAM Write protection page 3 */
#define SYSCFG_RCR_PAGE4          (0x00000010) /*!< ICODE SRAM Write protection page 4 */
#define SYSCFG_RCR_PAGE5          (0x00000020) /*!< ICODE SRAM Write protection page 5 */
#define SYSCFG_RCR_PAGE6          (0x00000040) /*!< ICODE SRAM Write protection page 6 */
#define SYSCFG_RCR_PAGE7          (0x00000080) /*!< ICODE SRAM Write protection page 7 */
#define SYSCFG_RCR_PAGE8          (0x00000100) /*!< ICODE SRAM Write protection page 8 */
#define SYSCFG_RCR_PAGE9          (0x00000200) /*!< ICODE SRAM Write protection page 9 */
#define SYSCFG_RCR_PAGE10         (0x00000400) /*!< ICODE SRAM Write protection page 10 */
#define SYSCFG_RCR_PAGE11         (0x00000800) /*!< ICODE SRAM Write protection page 11 */
#define SYSCFG_RCR_PAGE12         (0x00001000) /*!< ICODE SRAM Write protection page 12 */
#define SYSCFG_RCR_PAGE13         (0x00002000) /*!< ICODE SRAM Write protection page 13 */
#define SYSCFG_RCR_PAGE14         (0x00004000) /*!< ICODE SRAM Write protection page 14 */
#define SYSCFG_RCR_PAGE15         (0x00008000) /*!< ICODE SRAM Write protection page 15 */


#define SYSCFG_EXTICR1_EXTI0            (0x000F) /*!< EXTI 0 configuration */
#define SYSCFG_EXTICR1_EXTI1            (0x00F0) /*!< EXTI 1 configuration */
#define SYSCFG_EXTICR1_EXTI2            (0x0F00) /*!< EXTI 2 configuration */
#define SYSCFG_EXTICR1_EXTI3            (0xF000) /*!< EXTI 3 configuration */

/** 
  * @brief  EXTI0 configuration  
  */ 
#define SYSCFG_EXTICR1_EXTI0_PA         (0x0000) /*!< PA[0] pin */
#define SYSCFG_EXTICR1_EXTI0_PB         (0x0001) /*!< PB[0] pin */
#define SYSCFG_EXTICR1_EXTI0_PC         (0x0002) /*!< PC[0] pin */
#define SYSCFG_EXTICR1_EXTI0_PD         (0x0003) /*!< PD[0] pin */
#define SYSCFG_EXTICR1_EXTI0_PE         (0x0004) /*!< PE[0] pin */
#define SYSCFG_EXTICR1_EXTI0_PF         (0x0005) /*!< PF[0] pin */
#define SYSCFG_EXTICR1_EXTI0_PG         (0x0006) /*!< PG[0] pin */
#define SYSCFG_EXTICR1_EXTI0_PH         (0x0007) /*!< PH[0] pin */


/** 
  * @brief  EXTI1 configuration  
  */ 
#define SYSCFG_EXTICR1_EXTI1_PA         (0x0000) /*!< PA[1] pin */
#define SYSCFG_EXTICR1_EXTI1_PB         (0x0010) /*!< PB[1] pin */
#define SYSCFG_EXTICR1_EXTI1_PC         (0x0020) /*!< PC[1] pin */
#define SYSCFG_EXTICR1_EXTI1_PD         (0x0030) /*!< PD[1] pin */
#define SYSCFG_EXTICR1_EXTI1_PE         (0x0040) /*!< PE[1] pin */
#define SYSCFG_EXTICR1_EXTI1_PF         (0x0050) /*!< PF[1] pin */
#define SYSCFG_EXTICR1_EXTI1_PG         (0x0060) /*!< PG[1] pin */
#define SYSCFG_EXTICR1_EXTI1_PH         (0x0070) /*!< PH[1] pin */

/** 
  * @brief  EXTI2 configuration  
  */ 
#define SYSCFG_EXTICR1_EXTI2_PA         (0x0000) /*!< PA[2] pin */
#define SYSCFG_EXTICR1_EXTI2_PB         (0x0100) /*!< PB[2] pin */
#define SYSCFG_EXTICR1_EXTI2_PC         (0x0200) /*!< PC[2] pin */
#define SYSCFG_EXTICR1_EXTI2_PD         (0x0300) /*!< PD[2] pin */
#define SYSCFG_EXTICR1_EXTI2_PE         (0x0400) /*!< PE[2] pin */
#define SYSCFG_EXTICR1_EXTI2_PF         (0x0500) /*!< PF[2] pin */
#define SYSCFG_EXTICR1_EXTI2_PG         (0x0600) /*!< PG[2] pin */

/** 
  * @brief  EXTI3 configuration  
  */ 
#define SYSCFG_EXTICR1_EXTI3_PA         (0x0000) /*!< PA[3] pin */
#define SYSCFG_EXTICR1_EXTI3_PB         (0x1000) /*!< PB[3] pin */
#define SYSCFG_EXTICR1_EXTI3_PC         (0x2000) /*!< PC[3] pin */
#define SYSCFG_EXTICR1_EXTI3_PD         (0x3000) /*!< PD[3] pin */
#define SYSCFG_EXTICR1_EXTI3_PE         (0x4000) /*!< PE[3] pin */
#define SYSCFG_EXTICR1_EXTI3_PF         (0x5000) /*!< PE[3] pin */
#define SYSCFG_EXTICR1_EXTI3_PG         (0x6000) /*!< PG[3] pin */

#define SYSCFG_EXTIRCR_EXTI4            (0x000F) /*!< EXTI 4 configuration */
#define SYSCFG_EXTIRCR_EXTI5            (0x00F0) /*!< EXTI 5 configuration */
#define SYSCFG_EXTIRCR_EXTI6            (0x0F00) /*!< EXTI 6 configuration */
#define SYSCFG_EXTIRCR_EXTI7            (0xF000) /*!< EXTI 7 configuration */

/** 
  * @brief  EXTI4 configuration  
  */ 
#define SYSCFG_EXTIRCR_EXTI4_PA         (0x0000) /*!< PA[4] pin */
#define SYSCFG_EXTIRCR_EXTI4_PB         (0x0001) /*!< PB[4] pin */
#define SYSCFG_EXTIRCR_EXTI4_PC         (0x0002) /*!< PC[4] pin */
#define SYSCFG_EXTIRCR_EXTI4_PD         (0x0003) /*!< PD[4] pin */
#define SYSCFG_EXTIRCR_EXTI4_PE         (0x0004) /*!< PE[4] pin */
#define SYSCFG_EXTIRCR_EXTI4_PF         (0x0005) /*!< PF[4] pin */
#define SYSCFG_EXTIRCR_EXTI4_PG         (0x0006) /*!< PG[4] pin */
#define SYSCFG_EXTIRCR_EXTI4_PH         (0x0007) /*!< PH[4] pin */

/** 
  * @brief  EXTI5 configuration  
  */ 
#define SYSCFG_EXTIRCR_EXTI5_PA         (0x0000) /*!< PA[5] pin */
#define SYSCFG_EXTIRCR_EXTI5_PB         (0x0010) /*!< PB[5] pin */
#define SYSCFG_EXTIRCR_EXTI5_PC         (0x0020) /*!< PC[5] pin */
#define SYSCFG_EXTIRCR_EXTI5_PD         (0x0030) /*!< PD[5] pin */
#define SYSCFG_EXTIRCR_EXTI5_PE         (0x0040) /*!< PE[5] pin */
#define SYSCFG_EXTIRCR_EXTI5_PF         (0x0050) /*!< PF[5] pin */
#define SYSCFG_EXTIRCR_EXTI5_PG         (0x0060) /*!< PG[5] pin */

/** 
  * @brief  EXTI6 configuration  
  */ 
#define SYSCFG_EXTIRCR_EXTI6_PA         (0x0000) /*!< PA[6] pin */
#define SYSCFG_EXTIRCR_EXTI6_PB         (0x0100) /*!< PB[6] pin */
#define SYSCFG_EXTIRCR_EXTI6_PC         (0x0200) /*!< PC[6] pin */
#define SYSCFG_EXTIRCR_EXTI6_PD         (0x0300) /*!< PD[6] pin */
#define SYSCFG_EXTIRCR_EXTI6_PE         (0x0400) /*!< PE[6] pin */
#define SYSCFG_EXTIRCR_EXTI6_PF         (0x0500) /*!< PF[6] pin */
#define SYSCFG_EXTIRCR_EXTI6_PG         (0x0600) /*!< PG[6] pin */

/** 
  * @brief  EXTI7 configuration  
  */ 
#define SYSCFG_EXTIRCR_EXTI7_PA         (0x0000) /*!< PA[7] pin */
#define SYSCFG_EXTIRCR_EXTI7_PB         (0x1000) /*!< PB[7] pin */
#define SYSCFG_EXTIRCR_EXTI7_PC         (0x2000) /*!< PC[7] pin */
#define SYSCFG_EXTIRCR_EXTI7_PD         (0x3000) /*!< PD[7] pin */
#define SYSCFG_EXTIRCR_EXTI7_PE         (0x4000) /*!< PE[7] pin */
#define SYSCFG_EXTIRCR_EXTI7_PF         (0x5000) /*!< PF[7] pin */
#define SYSCFG_EXTIRCR_EXTI7_PG         (0x6000) /*!< PG[7] pin */

#define SYSCFG_EXTICR3_EXTI8            (0x000F) /*!< EXTI 8 configuration */
#define SYSCFG_EXTICR3_EXTI9            (0x00F0) /*!< EXTI 9 configuration */
#define SYSCFG_EXTICR3_EXTI10           (0x0F00) /*!< EXTI 10 configuration */
#define SYSCFG_EXTICR3_EXTI11           (0xF000) /*!< EXTI 11 configuration */

/** 
  * @brief  EXTI8 configuration  
  */ 
#define SYSCFG_EXTICR3_EXTI8_PA         (0x0000) /*!< PA[8] pin */
#define SYSCFG_EXTICR3_EXTI8_PB         (0x0001) /*!< PB[8] pin */
#define SYSCFG_EXTICR3_EXTI8_PC         (0x0002) /*!< PC[8] pin */
#define SYSCFG_EXTICR3_EXTI8_PD         (0x0003) /*!< PD[8] pin */
#define SYSCFG_EXTICR3_EXTI8_PE         (0x0004) /*!< PE[8] pin */
#define SYSCFG_EXTICR3_EXTI8_PF         (0x0005) /*!< PF[8] pin */
#define SYSCFG_EXTICR3_EXTI8_PG         (0x0006) /*!< PG[8] pin */
/** 
  * @brief  EXTI9 configuration  
  */ 
#define SYSCFG_EXTICR3_EXTI9_PA         (0x0000) /*!< PA[9] pin */
#define SYSCFG_EXTICR3_EXTI9_PB         (0x0010) /*!< PB[9] pin */
#define SYSCFG_EXTICR3_EXTI9_PC         (0x0020) /*!< PC[9] pin */
#define SYSCFG_EXTICR3_EXTI9_PD         (0x0030) /*!< PD[9] pin */
#define SYSCFG_EXTICR3_EXTI9_PE         (0x0040) /*!< PE[9] pin */
#define SYSCFG_EXTICR3_EXTI9_PF         (0x0050) /*!< PF[9] pin */
#define SYSCFG_EXTICR3_EXTI9_PG         (0x0060) /*!< PG[9] pin */

/** 
  * @brief  EXTI10 configuration  
  */ 
#define SYSCFG_EXTICR3_EXTI10_PA        (0x0000) /*!< PA[10] pin */
#define SYSCFG_EXTICR3_EXTI10_PB        (0x0100) /*!< PB[10] pin */
#define SYSCFG_EXTICR3_EXTI10_PC        (0x0200) /*!< PC[10] pin */
#define SYSCFG_EXTICR3_EXTI10_PD        (0x0300) /*!< PD[10] pin */
#define SYSCFG_EXTICR3_EXTI10_PE        (0x0400) /*!< PE[10] pin */
#define SYSCFG_EXTICR3_EXTI10_PF        (0x0500) /*!< PF[10] pin */
#define SYSCFG_EXTICR3_EXTI10_PG        (0x0600) /*!< PG[10] pin */

/** 
  * @brief  EXTI11 configuration  
  */ 
#define SYSCFG_EXTICR3_EXTI11_PA        (0x0000) /*!< PA[11] pin */
#define SYSCFG_EXTICR3_EXTI11_PB        (0x1000) /*!< PB[11] pin */
#define SYSCFG_EXTICR3_EXTI11_PC        (0x2000) /*!< PC[11] pin */
#define SYSCFG_EXTICR3_EXTI11_PD        (0x3000) /*!< PD[11] pin */
#define SYSCFG_EXTICR3_EXTI11_PE        (0x4000) /*!< PE[11] pin */
#define SYSCFG_EXTICR3_EXTI11_PF        (0x5000) /*!< PF[11] pin */
#define SYSCFG_EXTICR3_EXTI11_PG        (0x6000) /*!< PG[11] pin */

#define SYSCFG_EXTICR4_EXTI12           (0x000F) /*!< EXTI 12 configuration */
#define SYSCFG_EXTICR4_EXTI13           (0x00F0) /*!< EXTI 13 configuration */
#define SYSCFG_EXTICR4_EXTI14           (0x0F00) /*!< EXTI 14 configuration */
#define SYSCFG_EXTICR4_EXTI15           (0xF000) /*!< EXTI 15 configuration */

/** 
  * @brief  EXTI12 configuration  
  */ 
#define SYSCFG_EXTICR4_EXTI12_PA        (0x0000) /*!< PA[12] pin */
#define SYSCFG_EXTICR4_EXTI12_PB        (0x0001) /*!< PB[12] pin */
#define SYSCFG_EXTICR4_EXTI12_PC        (0x0002) /*!< PC[12] pin */
#define SYSCFG_EXTICR4_EXTI12_PD        (0x0003) /*!< PD[12] pin */
#define SYSCFG_EXTICR4_EXTI12_PE        (0x0004) /*!< PE[12] pin */
#define SYSCFG_EXTICR4_EXTI12_PF        (0x0005) /*!< PF[12] pin */
#define SYSCFG_EXTICR4_EXTI12_PG        (0x0006) /*!< PG[12] pin */

/** 
  * @brief  EXTI13 configuration  
  */ 
#define SYSCFG_EXTICR4_EXTI13_PA        (0x0000) /*!< PA[13] pin */
#define SYSCFG_EXTICR4_EXTI13_PB        (0x0010) /*!< PB[13] pin */
#define SYSCFG_EXTICR4_EXTI13_PC        (0x0020) /*!< PC[13] pin */
#define SYSCFG_EXTICR4_EXTI13_PD        (0x0030) /*!< PD[13] pin */
#define SYSCFG_EXTICR4_EXTI13_PE        (0x0040) /*!< PE[13] pin */
#define SYSCFG_EXTICR4_EXTI13_PF        (0x0050) /*!< PF[13] pin */
#define SYSCFG_EXTICR4_EXTI13_PG        (0x0060) /*!< PG[13] pin */

/** 
  * @brief  EXTI14 configuration  
  */ 
#define SYSCFG_EXTICR4_EXTI14_PA        (0x0000) /*!< PA[14] pin */
#define SYSCFG_EXTICR4_EXTI14_PB        (0x0100) /*!< PB[14] pin */
#define SYSCFG_EXTICR4_EXTI14_PC        (0x0200) /*!< PC[14] pin */
#define SYSCFG_EXTICR4_EXTI14_PD        (0x0300) /*!< PD[14] pin */
#define SYSCFG_EXTICR4_EXTI14_PE        (0x0400) /*!< PE[14] pin */
#define SYSCFG_EXTICR4_EXTI14_PF        (0x0500) /*!< PF[14] pin */
#define SYSCFG_EXTICR4_EXTI14_PG        (0x0600) /*!< PG[14] pin */

/** 
  * @brief  EXTI15 configuration  
  */ 
#define SYSCFG_EXTICR4_EXTI15_PA        (0x0000) /*!< PA[15] pin */
#define SYSCFG_EXTICR4_EXTI15_PB        (0x1000) /*!< PB[15] pin */
#define SYSCFG_EXTICR4_EXTI15_PC        (0x2000) /*!< PC[15] pin */
#define SYSCFG_EXTICR4_EXTI15_PD        (0x3000) /*!< PD[15] pin */
#define SYSCFG_EXTICR4_EXTI15_PE        (0x4000) /*!< PE[15] pin */
#define SYSCFG_EXTICR4_EXTI15_PF        (0x5000) /*!< PF[15] pin */
#define SYSCFG_EXTICR4_EXTI15_PG        (0x6000) /*!< PG[15] pin */

