the-nw1-group/acb-modules/acb-common/include/stm/stm32f30x.inc
#define SYSCFG_CFGR2_LOCKUP_LOCK               (0x00000001) /*!< Enables and locks the PVD connection with Timer1/8/15/16/17 Break Input and also the PVD_EN and PVDSEL[2:0] bits of the Power Control Interface */
#define SYSCFG_CFGR2_SRAM_PARITY_LOCK          (0x00000002) /*!< Enables and locks the SRAM_PARITY error signal with Break Input of TIMER1/8/15/16/17 */
#define SYSCFG_CFGR2_PVD_LOCK                  (0x00000004) /*!< Enables and locks the LOCKUP (Hardfault) output of CortexM4 with Break Input of TIMER1/8/15/16/17 */
#define SYSCFG_CFGR2_BYP_ADDR_PAR              (0x00000010) /*!< Disables the address parity check on RAM */
#define SYSCFG_CFGR2_SRAM_PE                   (0x00000100) /*!< SRAM Parity error flag */

#define SYSCFG_CFGR3_SPI1_RX_DMA_RMP           (0x00000003) /*!< SPI1 RX DMA remap */
#define SYSCFG_CFGR3_SPI1_RX_DMA_RMP_0         (0x00000001) /*!< SPI1 RX DMA remap bit 0 */
#define SYSCFG_CFGR3_SPI1_RX_DMA_RMP_1         (0x00000002) /*!< SPI1 RX DMA remap bit 1 */
#define SYSCFG_CFGR3_SPI1_TX_DMA_RMP           (0x0000000C) /*!< SPI1 TX DMA remap */
#define SYSCFG_CFGR3_SPI1_TX_DMA_RMP_0         (0x00000004) /*!< SPI1 TX DMA remap bit 0 */
#define SYSCFG_CFGR3_SPI1_TX_DMA_RMP_1         (0x00000008) /*!< SPI1 TX DMA remap bit 1 */
#define SYSCFG_CFGR3_I2C1_RX_DMA_RMP           (0x00000030) /*!< I2C1 RX DMA remap */
#define SYSCFG_CFGR3_I2C1_RX_DMA_RMP_0         (0x00000010) /*!< I2C1 RX DMA remap bit 0 */
#define SYSCFG_CFGR3_I2C1_RX_DMA_RMP_1         (0x00000020) /*!< I2C1 RX DMA remap bit 1 */
#define SYSCFG_CFGR3_I2C1_TX_DMA_RMP           (0x000000C0) /*!< I2C1 RX DMA remap */
#define SYSCFG_CFGR3_I2C1_TX_DMA_RMP_0         (0x00000040) /*!< I2C1 TX DMA remap bit 0 */
#define SYSCFG_CFGR3_I2C1_TX_DMA_RMP_1         (0x00000080) /*!< I2C1 TX DMA remap bit 1 */
#define SYSCFG_CFGR3_ADC2_DMA_RMP              (0x00000300) /*!< ADC2 DMA remap */
#define SYSCFG_CFGR3_ADC2_DMA_RMP_0            (0x00000100) /*!< ADC2 DMA remap bit 0 */
#define SYSCFG_CFGR3_ADC2_DMA_RMP_1            (0x00000200) /*!< ADC2 DMA remap bit 1 */
#define SYSCFG_CFGR3_DAC1_TRG3_RMP             (0x00010000) /*!< DAC1 TRG3 remap */
#define SYSCFG_CFGR3_DAC1_TRG5_RMP             (0x00020000) /*!< DAC1 TRG5 remap */

#define SYSCFG_CFGR4_ADC12_EXT2_RMP            (0x00000001) /*!< ADC12 regular channel EXT2 remap */
#define SYSCFG_CFGR4_ADC12_EXT3_RMP            (0x00000002) /*!< ADC12 regular channel EXT3 remap */
#define SYSCFG_CFGR4_ADC12_EXT5_RMP            (0x00000004) /*!< ADC12 regular channel EXT5 remap */
#define SYSCFG_CFGR4_ADC12_EXT13_RMP           (0x00000008) /*!< ADC12 regular channel EXT13 remap */
#define SYSCFG_CFGR4_ADC12_EXT15_RMP           (0x00000010) /*!< ADC12 regular channel EXT15 remap */
#define SYSCFG_CFGR4_ADC12_JEXT3_RMP           (0x00000020) /*!< ADC12 injected channel JEXT3 remap */
#define SYSCFG_CFGR4_ADC12_JEXT6_RMP           (0x00000040) /*!< ADC12 injected channel JEXT6 remap */
#define SYSCFG_CFGR4_ADC12_JEXT13_RMP          (0x00000080) /*!< ADC12 injected channel JEXT13 remap */
#define SYSCFG_CFGR4_ADC34_EXT5_RMP            (0x00000100) /*!< ADC34 regular channel EXT5 remap */
#define SYSCFG_CFGR4_ADC34_EXT6_RMP            (0x00000200) /*!< ADC34 regular channel EXT6 remap */
#define SYSCFG_CFGR4_ADC34_EXT15_RMP           (0x00000400) /*!< ADC34 regular channel EXT15 remap */
#define SYSCFG_CFGR4_ADC34_JEXT5_RMP           (0x00000800) /*!< ADC34 injected channel JEXT5 remap */
#define SYSCFG_CFGR4_ADC34_JEXT11_RMP          (0x00001000) /*!< ADC34 injected channel JEXT11 remap */
#define SYSCFG_CFGR4_ADC34_JEXT14_RMP          (0x00002000) /*!< ADC34 injected channel JEXT14 remap */

#define  TIM_CR1_CEN                         (0x0001)            /*!<Counter enable */
#define  TIM_CR1_UDIS                        (0x0002)            /*!<Update disable */
#define  TIM_CR1_URS                         (0x0004)            /*!<Update request source */
#define  TIM_CR1_OPM                         (0x0008)            /*!<One pulse mode */
#define  TIM_CR1_DIR                         (0x0010)            /*!<Direction */

#define  TIM_CR1_CMS                         (0x0060)            /*!<CMS[1:0] bits (Center-aligned mode selection) */
#define  TIM_CR1_CMS_0                       (0x0020)            /*!<Bit 0 */
#define  TIM_CR1_CMS_1                       (0x0040)            /*!<Bit 1 */

#define  TIM_CR1_ARPE                        (0x0080)            /*!<Auto-reload preload enable */

#define  TIM_CR1_CKD                         (0x0300)            /*!<CKD[1:0] bits (clock division) */
#define  TIM_CR1_CKD_0                       (0x0100)            /*!<Bit 0 */
#define  TIM_CR1_CKD_1                       (0x0200)            /*!<Bit 1 */

#define  TIM_CR1_UIFREMAP                    (0x0800)            /*!<Update interrupt flag remap */

#define  TIM_CR2_CCPC                        (0x00000001)            /*!<Capture/Compare Preloaded Control */
#define  TIM_CR2_CCUS                        (0x00000004)            /*!<Capture/Compare Control Update Selection */
#define  TIM_CR2_CCDS                        (0x00000008)            /*!<Capture/Compare DMA Selection */

#define  TIM_CR2_MMS                         (0x00000070)            /*!<MMS[2:0] bits (Master Mode Selection) */
#define  TIM_CR2_MMS_0                       (0x00000010)            /*!<Bit 0 */
#define  TIM_CR2_MMS_1                       (0x00000020)            /*!<Bit 1 */
#define  TIM_CR2_MMS_2                       (0x00000040)            /*!<Bit 2 */

#define  TIM_CR2_TI1S                        (0x00000080)            /*!<TI1 Selection */
#define  TIM_CR2_OIS1                        (0x00000100)            /*!<Output Idle state 1 (OC1 output) */
#define  TIM_CR2_OIS1N                       (0x00000200)            /*!<Output Idle state 1 (OC1N output) */
#define  TIM_CR2_OIS2                        (0x00000400)            /*!<Output Idle state 2 (OC2 output) */
#define  TIM_CR2_OIS2N                       (0x00000800)            /*!<Output Idle state 2 (OC2N output) */
#define  TIM_CR2_OIS3                        (0x00001000)            /*!<Output Idle state 3 (OC3 output) */
#define  TIM_CR2_OIS3N                       (0x00002000)            /*!<Output Idle state 3 (OC3N output) */
#define  TIM_CR2_OIS4                        (0x00004000)            /*!<Output Idle state 4 (OC4 output) */
#define  TIM_CR2_OIS5                        (0x00010000)            /*!<Output Idle state 4 (OC4 output) */
#define  TIM_CR2_OIS6                        (0x00020000)            /*!<Output Idle state 4 (OC4 output) */

#define  TIM_CR2_MMS2                        (0x00F00000)            /*!<MMS[2:0] bits (Master Mode Selection) */
#define  TIM_CR2_MMS2_0                      (0x00100000)            /*!<Bit 0 */
#define  TIM_CR2_MMS2_1                      (0x00200000)            /*!<Bit 1 */
#define  TIM_CR2_MMS2_2                      (0x00400000)            /*!<Bit 2 */
#define  TIM_CR2_MMS2_3                      (0x00800000)            /*!<Bit 2 */

#define  TIM_SMCR_SMS                        (0x00010007)            /*!<SMS[2:0] bits (Slave mode selection) */
#define  TIM_SMCR_SMS_0                      (0x00000001)            /*!<Bit 0 */
#define  TIM_SMCR_SMS_1                      (0x00000002)            /*!<Bit 1 */
#define  TIM_SMCR_SMS_2                      (0x00000004)            /*!<Bit 2 */
#define  TIM_SMCR_SMS_3                      (0x00010000)            /*!<Bit 3 */

