the-nw1-group/acb-modules/acb-common/include/stm/stm32f30x.inc
#define  TIM_SMCR_OCCS                       (0x00000008)            /*!< OCREF clear selection */

#define  TIM_SMCR_TS                         (0x00000070)            /*!<TS[2:0] bits (Trigger selection) */
#define  TIM_SMCR_TS_0                       (0x00000010)            /*!<Bit 0 */
#define  TIM_SMCR_TS_1                       (0x00000020)            /*!<Bit 1 */
#define  TIM_SMCR_TS_2                       (0x00000040)            /*!<Bit 2 */

#define  TIM_SMCR_MSM                        (0x00000080)            /*!<Master/slave mode */

#define  TIM_SMCR_ETF                        (0x00000F00)            /*!<ETF[3:0] bits (External trigger filter) */
#define  TIM_SMCR_ETF_0                      (0x00000100)            /*!<Bit 0 */
#define  TIM_SMCR_ETF_1                      (0x00000200)            /*!<Bit 1 */
#define  TIM_SMCR_ETF_2                      (0x00000400)            /*!<Bit 2 */
#define  TIM_SMCR_ETF_3                      (0x00000800)            /*!<Bit 3 */

#define  TIM_SMCR_ETPS                       (0x00003000)            /*!<ETPS[1:0] bits (External trigger prescaler) */
#define  TIM_SMCR_ETPS_0                     (0x00001000)            /*!<Bit 0 */
#define  TIM_SMCR_ETPS_1                     (0x00002000)            /*!<Bit 1 */

#define  TIM_SMCR_ECE                        (0x00004000)            /*!<External clock enable */
#define  TIM_SMCR_ETP                        (0x00008000)            /*!<External trigger polarity */

#define  TIM_DIER_UIE                        (0x0001)            /*!<Update interrupt enable */
#define  TIM_DIER_CC1IE                      (0x0002)            /*!<Capture/Compare 1 interrupt enable */
#define  TIM_DIER_CC2IE                      (0x0004)            /*!<Capture/Compare 2 interrupt enable */
#define  TIM_DIER_CC3IE                      (0x0008)            /*!<Capture/Compare 3 interrupt enable */
#define  TIM_DIER_CC4IE                      (0x0010)            /*!<Capture/Compare 4 interrupt enable */
#define  TIM_DIER_COMIE                      (0x0020)            /*!<COM interrupt enable */
#define  TIM_DIER_TIE                        (0x0040)            /*!<Trigger interrupt enable */
#define  TIM_DIER_BIE                        (0x0080)            /*!<Break interrupt enable */
#define  TIM_DIER_UDE                        (0x0100)            /*!<Update DMA request enable */
#define  TIM_DIER_CC1DE                      (0x0200)            /*!<Capture/Compare 1 DMA request enable */
#define  TIM_DIER_CC2DE                      (0x0400)            /*!<Capture/Compare 2 DMA request enable */
#define  TIM_DIER_CC3DE                      (0x0800)            /*!<Capture/Compare 3 DMA request enable */
#define  TIM_DIER_CC4DE                      (0x1000)            /*!<Capture/Compare 4 DMA request enable */
#define  TIM_DIER_COMDE                      (0x2000)            /*!<COM DMA request enable */
#define  TIM_DIER_TDE                        (0x4000)            /*!<Trigger DMA request enable */

#define  TIM_SR_UIF                          (0x00000001)            /*!<Update interrupt Flag */
#define  TIM_SR_CC1IF                        (0x00000002)            /*!<Capture/Compare 1 interrupt Flag */
#define  TIM_SR_CC2IF                        (0x00000004)            /*!<Capture/Compare 2 interrupt Flag */
#define  TIM_SR_CC3IF                        (0x00000008)            /*!<Capture/Compare 3 interrupt Flag */
#define  TIM_SR_CC4IF                        (0x00000010)            /*!<Capture/Compare 4 interrupt Flag */
#define  TIM_SR_COMIF                        (0x00000020)            /*!<COM interrupt Flag */
#define  TIM_SR_TIF                          (0x00000040)            /*!<Trigger interrupt Flag */
#define  TIM_SR_BIF                          (0x00000080)            /*!<Break interrupt Flag */
#define  TIM_SR_B2IF                         (0x00000100)            /*!<Break2 interrupt Flag */
#define  TIM_SR_CC1OF                        (0x00000200)            /*!<Capture/Compare 1 Over capture Flag */
#define  TIM_SR_CC2OF                        (0x00000400)            /*!<Capture/Compare 2 Over capture Flag */
#define  TIM_SR_CC3OF                        (0x00000800)            /*!<Capture/Compare 3 Over capture Flag */
#define  TIM_SR_CC4OF                        (0x00001000)            /*!<Capture/Compare 4 Over capture Flag */
#define  TIM_SR_CC5IF                        (0x00010000)            /*!<Capture/Compare 5 interrupt Flag */
#define  TIM_SR_CC6IF                        (0x00020000)            /*!<Capture/Compare 6 interrupt Flag */


#define  TIM_EGR_UG                          (0x0001)               /*!<Update Generation */
#define  TIM_EGR_CC1G                        (0x0002)               /*!<Capture/Compare 1 Generation */
#define  TIM_EGR_CC2G                        (0x0004)               /*!<Capture/Compare 2 Generation */
#define  TIM_EGR_CC3G                        (0x0008)               /*!<Capture/Compare 3 Generation */
#define  TIM_EGR_CC4G                        (0x0010)               /*!<Capture/Compare 4 Generation */
#define  TIM_EGR_COMG                        (0x0020)               /*!<Capture/Compare Control Update Generation */
#define  TIM_EGR_TG                          (0x0040)               /*!<Trigger Generation */
#define  TIM_EGR_BG                          (0x0080)               /*!<Break Generation */
#define  TIM_EGR_B2G                         (0x0100)               /*!<Break Generation */


#define  TIM_CCMR1_CC1S                      (0x00000003)            /*!<CC1S[1:0] bits (Capture/Compare 1 Selection) */
#define  TIM_CCMR1_CC1S_0                    (0x00000001)            /*!<Bit 0 */
#define  TIM_CCMR1_CC1S_1                    (0x00000002)            /*!<Bit 1 */

#define  TIM_CCMR1_OC1FE                     (0x00000004)            /*!<Output Compare 1 Fast enable */
#define  TIM_CCMR1_OC1PE                     (0x00000008)            /*!<Output Compare 1 Preload enable */

#define  TIM_CCMR1_OC1M                      (0x00010070)            /*!<OC1M[2:0] bits (Output Compare 1 Mode) */
#define  TIM_CCMR1_OC1M_0                    (0x00000010)            /*!<Bit 0 */
#define  TIM_CCMR1_OC1M_1                    (0x00000020)            /*!<Bit 1 */
#define  TIM_CCMR1_OC1M_2                    (0x00000040)            /*!<Bit 2 */
#define  TIM_CCMR1_OC1M_3                    (0x00010000)            /*!<Bit 3 */

#define  TIM_CCMR1_OC1CE                     (0x00000080)            /*!<Output Compare 1Clear Enable */

#define  TIM_CCMR1_CC2S                      (0x00000300)            /*!<CC2S[1:0] bits (Capture/Compare 2 Selection) */
#define  TIM_CCMR1_CC2S_0                    (0x00000100)            /*!<Bit 0 */
#define  TIM_CCMR1_CC2S_1                    (0x00000200)            /*!<Bit 1 */

