the-nw1-group/acb-modules/acb-common/include/stm/stm32f30x.inc
#define  TIM_CCMR1_OC2FE                     (0x00000400)            /*!<Output Compare 2 Fast enable */
#define  TIM_CCMR1_OC2PE                     (0x00000800)            /*!<Output Compare 2 Preload enable */

#define  TIM_CCMR1_OC2M                      (0x01007000)            /*!<OC2M[2:0] bits (Output Compare 2 Mode) */
#define  TIM_CCMR1_OC2M_0                    (0x00001000)            /*!<Bit 0 */
#define  TIM_CCMR1_OC2M_1                    (0x00002000)            /*!<Bit 1 */
#define  TIM_CCMR1_OC2M_2                    (0x00004000)            /*!<Bit 2 */
#define  TIM_CCMR1_OC2M_3                    (0x01000000)            /*!<Bit 3 */

#define  TIM_CCMR1_OC2CE                     (0x00008000)            /*!<Output Compare 2 Clear Enable */


#define  TIM_CCMR1_IC1PSC                    (0x0000000C)            /*!<IC1PSC[1:0] bits (Input Capture 1 Prescaler) */
#define  TIM_CCMR1_IC1PSC_0                  (0x00000004)            /*!<Bit 0 */
#define  TIM_CCMR1_IC1PSC_1                  (0x00000008)            /*!<Bit 1 */

#define  TIM_CCMR1_IC1F                      (0x000000F0)            /*!<IC1F[3:0] bits (Input Capture 1 Filter) */
#define  TIM_CCMR1_IC1F_0                    (0x00000010)            /*!<Bit 0 */
#define  TIM_CCMR1_IC1F_1                    (0x00000020)            /*!<Bit 1 */
#define  TIM_CCMR1_IC1F_2                    (0x00000040)            /*!<Bit 2 */
#define  TIM_CCMR1_IC1F_3                    (0x00000080)            /*!<Bit 3 */

#define  TIM_CCMR1_IC2PSC                    (0x00000C00)            /*!<IC2PSC[1:0] bits (Input Capture 2 Prescaler) */
#define  TIM_CCMR1_IC2PSC_0                  (0x00000400)            /*!<Bit 0 */
#define  TIM_CCMR1_IC2PSC_1                  (0x00000800)            /*!<Bit 1 */

#define  TIM_CCMR1_IC2F                      (0x0000F000)            /*!<IC2F[3:0] bits (Input Capture 2 Filter) */
#define  TIM_CCMR1_IC2F_0                    (0x00001000)            /*!<Bit 0 */
#define  TIM_CCMR1_IC2F_1                    (0x00002000)            /*!<Bit 1 */
#define  TIM_CCMR1_IC2F_2                    (0x00004000)            /*!<Bit 2 */
#define  TIM_CCMR1_IC2F_3                    (0x00008000)            /*!<Bit 3 */

#define  TIM_CCMR2_CC3S                      (0x00000003)            /*!<CC3S[1:0] bits (Capture/Compare 3 Selection) */
#define  TIM_CCMR2_CC3S_0                    (0x00000001)            /*!<Bit 0 */
#define  TIM_CCMR2_CC3S_1                    (0x00000002)            /*!<Bit 1 */

#define  TIM_CCMR2_OC3FE                     (0x00000004)            /*!<Output Compare 3 Fast enable */
#define  TIM_CCMR2_OC3PE                     (0x00000008)            /*!<Output Compare 3 Preload enable */

#define  TIM_CCMR2_OC3M                      (0x00000070)            /*!<OC3M[2:0] bits (Output Compare 3 Mode) */
#define  TIM_CCMR2_OC3M_0                    (0x00000010)            /*!<Bit 0 */
#define  TIM_CCMR2_OC3M_1                    (0x00000020)            /*!<Bit 1 */
#define  TIM_CCMR2_OC3M_2                    (0x00000040)            /*!<Bit 2 */
#define  TIM_CCMR2_OC3M_3                    (0x00010000)            /*!<Bit 3 */

#define  TIM_CCMR2_OC3CE                     (0x00000080)            /*!<Output Compare 3 Clear Enable */

#define  TIM_CCMR2_CC4S                      (0x00000300)            /*!<CC4S[1:0] bits (Capture/Compare 4 Selection) */
#define  TIM_CCMR2_CC4S_0                    (0x00000100)            /*!<Bit 0 */
#define  TIM_CCMR2_CC4S_1                    (0x00000200)            /*!<Bit 1 */

#define  TIM_CCMR2_OC4FE                     (0x00000400)            /*!<Output Compare 4 Fast enable */
#define  TIM_CCMR2_OC4PE                     (0x00000800)            /*!<Output Compare 4 Preload enable */

#define  TIM_CCMR2_OC4M                      (0x00007000)            /*!<OC4M[2:0] bits (Output Compare 4 Mode) */
#define  TIM_CCMR2_OC4M_0                    (0x00001000)            /*!<Bit 0 */
#define  TIM_CCMR2_OC4M_1                    (0x00002000)            /*!<Bit 1 */
#define  TIM_CCMR2_OC4M_2                    (0x00004000)            /*!<Bit 2 */
#define  TIM_CCMR2_OC4M_3                    (0x00100000)            /*!<Bit 3 */

#define  TIM_CCMR2_OC4CE                     (0x00008000)            /*!<Output Compare 4 Clear Enable */


#define  TIM_CCMR2_IC3PSC                    (0x0000000C)            /*!<IC3PSC[1:0] bits (Input Capture 3 Prescaler) */
#define  TIM_CCMR2_IC3PSC_0                  (0x00000004)            /*!<Bit 0 */
#define  TIM_CCMR2_IC3PSC_1                  (0x00000008)            /*!<Bit 1 */

#define  TIM_CCMR2_IC3F                      (0x000000F0)            /*!<IC3F[3:0] bits (Input Capture 3 Filter) */
#define  TIM_CCMR2_IC3F_0                    (0x00000010)            /*!<Bit 0 */
#define  TIM_CCMR2_IC3F_1                    (0x00000020)            /*!<Bit 1 */
#define  TIM_CCMR2_IC3F_2                    (0x00000040)            /*!<Bit 2 */
#define  TIM_CCMR2_IC3F_3                    (0x00000080)            /*!<Bit 3 */

#define  TIM_CCMR2_IC4PSC                    (0x00000C00)            /*!<IC4PSC[1:0] bits (Input Capture 4 Prescaler) */
#define  TIM_CCMR2_IC4PSC_0                  (0x00000400)            /*!<Bit 0 */
#define  TIM_CCMR2_IC4PSC_1                  (0x00000800)            /*!<Bit 1 */

#define  TIM_CCMR2_IC4F                      (0x0000F000)            /*!<IC4F[3:0] bits (Input Capture 4 Filter) */
#define  TIM_CCMR2_IC4F_0                    (0x00001000)            /*!<Bit 0 */
#define  TIM_CCMR2_IC4F_1                    (0x00002000)            /*!<Bit 1 */
#define  TIM_CCMR2_IC4F_2                    (0x00004000)            /*!<Bit 2 */
#define  TIM_CCMR2_IC4F_3                    (0x00008000)            /*!<Bit 3 */

#define  TIM_CCER_CC1E                       (0x00000001)            /*!<Capture/Compare 1 output enable */
#define  TIM_CCER_CC1P                       (0x00000002)            /*!<Capture/Compare 1 output Polarity */
#define  TIM_CCER_CC1NE                      (0x00000004)            /*!<Capture/Compare 1 Complementary output enable */
#define  TIM_CCER_CC1NP                      (0x00000008)            /*!<Capture/Compare 1 Complementary output Polarity */
#define  TIM_CCER_CC2E                       (0x00000010)            /*!<Capture/Compare 2 output enable */
#define  TIM_CCER_CC2P                       (0x00000020)            /*!<Capture/Compare 2 output Polarity */
#define  TIM_CCER_CC2NE                      (0x00000040)            /*!<Capture/Compare 2 Complementary output enable */
#define  TIM_CCER_CC2NP                      (0x00000080)            /*!<Capture/Compare 2 Complementary output Polarity */
#define  TIM_CCER_CC3E                       (0x00000100)            /*!<Capture/Compare 3 output enable */
#define  TIM_CCER_CC3P                       (0x00000200)            /*!<Capture/Compare 3 output Polarity */
#define  TIM_CCER_CC3NE                      (0x00000400)            /*!<Capture/Compare 3 Complementary output enable */
#define  TIM_CCER_CC3NP                      (0x00000800)            /*!<Capture/Compare 3 Complementary output Polarity */
#define  TIM_CCER_CC4E                       (0x00001000)            /*!<Capture/Compare 4 output enable */
#define  TIM_CCER_CC4P                       (0x00002000)            /*!<Capture/Compare 4 output Polarity */
#define  TIM_CCER_CC4NP                      (0x00008000)            /*!<Capture/Compare 4 Complementary output Polarity */
#define  TIM_CCER_CC5E                       (0x00010000)            /*!<Capture/Compare 5 output enable */
#define  TIM_CCER_CC5P                       (0x00020000)            /*!<Capture/Compare 5 output Polarity */
#define  TIM_CCER_CC6E                       (0x00100000)            /*!<Capture/Compare 6 output enable */
#define  TIM_CCER_CC6P                       (0x00200000)            /*!<Capture/Compare 6 output Polarity */
#define  TIM_CNT_CNT                         (0xFFFFFFFF)            /*!<Counter Value */
#define  TIM_CNT_UIFCPY                      (0x80000000)            /*!<Update interrupt flag copy */
#define  TIM_PSC_PSC                         (0xFFFF)            /*!<Prescaler Value */

#define  TIM_ARR_ARR                         (0xFFFFFFFF)            /*!<actual auto-reload Value */

