the-nw1-group/acb-modules/acb-common/include/stm/stm32f30x.inc
#define  TIM_RCR_REP                         (0xFF)               /*!<Repetition Counter Value */

#define  TIM_CCR1_CCR1                       (0xFFFF)            /*!<Capture/Compare 1 Value */

#define  TIM_CCR2_CCR2                       (0xFFFF)            /*!<Capture/Compare 2 Value */

#define  TIM_CCR3_CCR3                       (0xFFFF)            /*!<Capture/Compare 3 Value */

#define  TIM_CCR4_CCR4                       (0xFFFF)            /*!<Capture/Compare 4 Value */

#define  TIM_CCR5_CCR5                       (0xFFFFFFFF)        /*!<Capture/Compare 5 Value */
#define  TIM_CCR5_GC5C1                      (0x20000000)        /*!<Group Channel 5 and Channel 1 */
#define  TIM_CCR5_GC5C2                      (0x40000000)        /*!<Group Channel 5 and Channel 2 */
#define  TIM_CCR5_GC5C3                      (0x80000000)        /*!<Group Channel 5 and Channel 3 */

#define  TIM_CCR6_CCR6                       (0xFFFF)            /*!<Capture/Compare 6 Value */

#define  TIM_BDTR_DTG                        (0x000000FF)            /*!<DTG[0:7] bits (Dead-Time Generator set-up) */
#define  TIM_BDTR_DTG_0                      (0x00000001)            /*!<Bit 0 */
#define  TIM_BDTR_DTG_1                      (0x00000002)            /*!<Bit 1 */
#define  TIM_BDTR_DTG_2                      (0x00000004)            /*!<Bit 2 */
#define  TIM_BDTR_DTG_3                      (0x00000008)            /*!<Bit 3 */
#define  TIM_BDTR_DTG_4                      (0x00000010)            /*!<Bit 4 */
#define  TIM_BDTR_DTG_5                      (0x00000020)            /*!<Bit 5 */
#define  TIM_BDTR_DTG_6                      (0x00000040)            /*!<Bit 6 */
#define  TIM_BDTR_DTG_7                      (0x00000080)            /*!<Bit 7 */

#define  TIM_BDTR_LOCK                       (0x00000300)            /*!<LOCK[1:0] bits (Lock Configuration) */
#define  TIM_BDTR_LOCK_0                     (0x00000100)            /*!<Bit 0 */
#define  TIM_BDTR_LOCK_1                     (0x00000200)            /*!<Bit 1 */

#define  TIM_BDTR_OSSI                       (0x00000400)            /*!<Off-State Selection for Idle mode */
#define  TIM_BDTR_OSSR                       (0x00000800)            /*!<Off-State Selection for Run mode */
#define  TIM_BDTR_BKE                        (0x00001000)            /*!<Break enable for Break1 */
#define  TIM_BDTR_BKP                        (0x00002000)            /*!<Break Polarity for Break1 */
#define  TIM_BDTR_AOE                        (0x00004000)            /*!<Automatic Output enable */
#define  TIM_BDTR_MOE                        (0x00008000)            /*!<Main Output enable */

#define  TIM_BDTR_BKF                        (0x000F0000)            /*!<Break Filter for Break1 */
#define  TIM_BDTR_BK2F                       (0x00F00000)            /*!<Break Filter for Break2 */

#define  TIM_BDTR_BK2E                       (0x01000000)            /*!<Break enable for Break2 */
#define  TIM_BDTR_BK2P                       (0x02000000)            /*!<Break Polarity for Break2 */

#define  TIM_DCR_DBA                         (0x001F)            /*!<DBA[4:0] bits (DMA Base Address) */
#define  TIM_DCR_DBA_0                       (0x0001)            /*!<Bit 0 */
#define  TIM_DCR_DBA_1                       (0x0002)            /*!<Bit 1 */
#define  TIM_DCR_DBA_2                       (0x0004)            /*!<Bit 2 */
#define  TIM_DCR_DBA_3                       (0x0008)            /*!<Bit 3 */
#define  TIM_DCR_DBA_4                       (0x0010)            /*!<Bit 4 */

#define  TIM_DCR_DBL                         (0x1F00)            /*!<DBL[4:0] bits (DMA Burst Length) */
#define  TIM_DCR_DBL_0                       (0x0100)            /*!<Bit 0 */
#define  TIM_DCR_DBL_1                       (0x0200)            /*!<Bit 1 */
#define  TIM_DCR_DBL_2                       (0x0400)            /*!<Bit 2 */
#define  TIM_DCR_DBL_3                       (0x0800)            /*!<Bit 3 */
#define  TIM_DCR_DBL_4                       (0x1000)            /*!<Bit 4 */

#define  TIM_DMAR_DMAB                       (0xFFFF)            /*!<DMA register for burst accesses */

#define TIM16_OR_TI1_RMP                     (0x00C0)            /*!<TI1_RMP[1:0] bits (TIM16 Input 1 remap) */
#define TIM16_OR_TI1_RMP_0                   (0x0040)            /*!<Bit 0 */
#define TIM16_OR_TI1_RMP_1                   (0x0080)            /*!<Bit 1 */

#define TIM1_OR_ETR_RMP                      (0x000F)            /*!<ETR_RMP[3:0] bits (TIM1 ETR remap) */
#define TIM1_OR_ETR_RMP_0                    (0x0001)            /*!<Bit 0 */
#define TIM1_OR_ETR_RMP_1                    (0x0002)            /*!<Bit 1 */
#define TIM1_OR_ETR_RMP_2                    (0x0004)            /*!<Bit 2 */
#define TIM1_OR_ETR_RMP_3                    (0x0008)            /*!<Bit 3 */

#define TIM8_OR_ETR_RMP                      (0x000F)            /*!<ETR_RMP[3:0] bits (TIM8 ETR remap) */
#define TIM8_OR_ETR_RMP_0                    (0x0001)            /*!<Bit 0 */
#define TIM8_OR_ETR_RMP_1                    (0x0002)            /*!<Bit 1 */
#define TIM8_OR_ETR_RMP_2                    (0x0004)            /*!<Bit 2 */
#define TIM8_OR_ETR_RMP_3                    (0x0008)            /*!<Bit 3 */

#define TIM20_OR_ETR_RMP                     (0x0000000F)            /*!<ETR_RMP[3:0] bits (TIM20 ETR remap) */
#define TIM20_OR_ETR_RMP_0                   (0x00000001)            /*!<Bit 0 */
#define TIM20_OR_ETR_RMP_1                   (0x00000002)            /*!<Bit 1 */
#define TIM20_OR_ETR_RMP_2                   (0x00000004)            /*!<Bit 2 */
#define TIM20_OR_ETR_RMP_3                   (0x00000008)            /*!<Bit 3 */

#define  TIM_CCMR3_OC5FE                     (0x00000004)            /*!<Output Compare 5 Fast enable */
#define  TIM_CCMR3_OC5PE                     (0x00000008)            /*!<Output Compare 5 Preload enable */

#define  TIM_CCMR3_OC5M                      (0x00000070)            /*!<OC5M[2:0] bits (Output Compare 5 Mode) */
#define  TIM_CCMR3_OC5M_0                    (0x00000010)            /*!<Bit 0 */
#define  TIM_CCMR3_OC5M_1                    (0x00000020)            /*!<Bit 1 */
#define  TIM_CCMR3_OC5M_2                    (0x00000040)            /*!<Bit 2 */
#define  TIM_CCMR3_OC5M_3                    (0x00010000)            /*!<Bit 3 */

#define  TIM_CCMR3_OC5CE                     (0x00000080)            /*!<Output Compare 5 Clear Enable */

#define  TIM_CCMR3_OC6FE                     (0x00000400)            /*!<Output Compare 4 Fast enable */
#define  TIM_CCMR3_OC6PE                     (0x00000800)            /*!<Output Compare 4 Preload enable */

#define  TIM_CCMR3_OC6M                      (0x00007000)            /*!<OC4M[2:0] bits (Output Compare 4 Mode) */
#define  TIM_CCMR3_OC6M_0                    (0x00001000)            /*!<Bit 0 */
#define  TIM_CCMR3_OC6M_1                    (0x00002000)            /*!<Bit 1 */
#define  TIM_CCMR3_OC6M_2                    (0x00004000)            /*!<Bit 2 */
#define  TIM_CCMR3_OC6M_3                    (0x00100000)            /*!<Bit 3 */

#define  TIM_CCMR3_OC6CE                     (0x00008000)            /*!<Output Compare 4 Clear Enable */

#define  USART_CR1_UE                        (0x00000001)            /*!< USART Enable */
#define  USART_CR1_UESM                      (0x00000002)            /*!< USART Enable in STOP Mode */
#define  USART_CR1_RE                        (0x00000004)            /*!< Receiver Enable */
#define  USART_CR1_TE                        (0x00000008)            /*!< Transmitter Enable */
#define  USART_CR1_IDLEIE                    (0x00000010)            /*!< IDLE Interrupt Enable */
#define  USART_CR1_RXNEIE                    (0x00000020)            /*!< RXNE Interrupt Enable */
#define  USART_CR1_TCIE                      (0x00000040)            /*!< Transmission Complete Interrupt Enable */
#define  USART_CR1_TXEIE                     (0x00000080)            /*!< TXE Interrupt Enable */
#define  USART_CR1_PEIE                      (0x00000100)            /*!< PE Interrupt Enable */
#define  USART_CR1_PS                        (0x00000200)            /*!< Parity Selection */
#define  USART_CR1_PCE                       (0x00000400)            /*!< Parity Control Enable */
#define  USART_CR1_WAKE                      (0x00000800)            /*!< Receiver Wakeup method */
#define  USART_CR1_M                         (0x00001000)            /*!< Word length */
#define  USART_CR1_MME                       (0x00002000)            /*!< Mute Mode Enable */
#define  USART_CR1_CMIE                      (0x00004000)            /*!< Character match interrupt enable */
#define  USART_CR1_OVER8                     (0x00008000)            /*!< Oversampling by 8-bit or 16-bit mode */
#define  USART_CR1_DEDT                      (0x001F0000)            /*!< DEDT[4:0] bits (Driver Enable Deassertion Time) */
#define  USART_CR1_DEDT_0                    (0x00010000)            /*!< Bit 0 */
#define  USART_CR1_DEDT_1                    (0x00020000)            /*!< Bit 1 */
#define  USART_CR1_DEDT_2                    (0x00040000)            /*!< Bit 2 */
#define  USART_CR1_DEDT_3                    (0x00080000)            /*!< Bit 3 */
#define  USART_CR1_DEDT_4                    (0x00100000)            /*!< Bit 4 */
#define  USART_CR1_DEAT                      (0x03E00000)            /*!< DEAT[4:0] bits (Driver Enable Assertion Time) */
#define  USART_CR1_DEAT_0                    (0x00200000)            /*!< Bit 0 */
#define  USART_CR1_DEAT_1                    (0x00400000)            /*!< Bit 1 */
#define  USART_CR1_DEAT_2                    (0x00800000)            /*!< Bit 2 */
#define  USART_CR1_DEAT_3                    (0x01000000)            /*!< Bit 3 */
#define  USART_CR1_DEAT_4                    (0x02000000)            /*!< Bit 4 */
#define  USART_CR1_RTOIE                     (0x04000000)            /*!< Receive Time Out interrupt enable */
#define  USART_CR1_EOBIE                     (0x08000000)            /*!< End of Block interrupt enable */

#define  USART_CR2_ADDM7                     (0x00000010)            /*!< 7-bit or 4-bit Address Detection */
#define  USART_CR2_LBDL                      (0x00000020)            /*!< LIN Break Detection Length */
#define  USART_CR2_LBDIE                     (0x00000040)            /*!< LIN Break Detection Interrupt Enable */
#define  USART_CR2_LBCL                      (0x00000100)            /*!< Last Bit Clock pulse */
#define  USART_CR2_CPHA                      (0x00000200)            /*!< Clock Phase */
#define  USART_CR2_CPOL                      (0x00000400)            /*!< Clock Polarity */
#define  USART_CR2_CLKEN                     (0x00000800)            /*!< Clock Enable */
#define  USART_CR2_STOP                      (0x00003000)            /*!< STOP[1:0] bits (STOP bits) */
#define  USART_CR2_STOP_0                    (0x00001000)            /*!< Bit 0 */
#define  USART_CR2_STOP_1                    (0x00002000)            /*!< Bit 1 */
#define  USART_CR2_LINEN                     (0x00004000)            /*!< LIN mode enable */
#define  USART_CR2_SWAP                      (0x00008000)            /*!< SWAP TX/RX pins */
#define  USART_CR2_RXINV                     (0x00010000)            /*!< RX pin active level inversion */
#define  USART_CR2_TXINV                     (0x00020000)            /*!< TX pin active level inversion */
#define  USART_CR2_DATAINV                   (0x00040000)            /*!< Binary data inversion */
#define  USART_CR2_MSBFIRST                  (0x00080000)            /*!< Most Significant Bit First */
#define  USART_CR2_ABREN                     (0x00100000)            /*!< Auto Baud-Rate Enable*/
#define  USART_CR2_ABRMODE                   (0x00600000)            /*!< ABRMOD[1:0] bits (Auto Baud-Rate Mode) */
#define  USART_CR2_ABRMODE_0                 (0x00200000)            /*!< Bit 0 */
#define  USART_CR2_ABRMODE_1                 (0x00400000)            /*!< Bit 1 */
#define  USART_CR2_RTOEN                     (0x00800000)            /*!< Receiver Time-Out enable */
#define  USART_CR2_ADD                       (0xFF000000)            /*!< Address of the USART node */

