the-nw1-group/acb-modules/acb-common/include/stm/stm32f30x.inc
#define  WWDG_CR_T                           (0x7F)               /*!<T[6:0] bits (7-Bit counter (MSB to LSB)) */
#define  WWDG_CR_T0                          (0x01)               /*!<Bit 0 */
#define  WWDG_CR_T1                          (0x02)               /*!<Bit 1 */
#define  WWDG_CR_T2                          (0x04)               /*!<Bit 2 */
#define  WWDG_CR_T3                          (0x08)               /*!<Bit 3 */
#define  WWDG_CR_T4                          (0x10)               /*!<Bit 4 */
#define  WWDG_CR_T5                          (0x20)               /*!<Bit 5 */
#define  WWDG_CR_T6                          (0x40)               /*!<Bit 6 */

#define  WWDG_CR_WDGA                        (0x80)               /*!<Activation bit */

#define  WWDG_CFR_W                          (0x007F)            /*!<W[6:0] bits (7-bit window value) */
#define  WWDG_CFR_W0                         (0x0001)            /*!<Bit 0 */
#define  WWDG_CFR_W1                         (0x0002)            /*!<Bit 1 */
#define  WWDG_CFR_W2                         (0x0004)            /*!<Bit 2 */
#define  WWDG_CFR_W3                         (0x0008)            /*!<Bit 3 */
#define  WWDG_CFR_W4                         (0x0010)            /*!<Bit 4 */
#define  WWDG_CFR_W5                         (0x0020)            /*!<Bit 5 */
#define  WWDG_CFR_W6                         (0x0040)            /*!<Bit 6 */

#define  WWDG_CFR_WDGTB                      (0x0180)            /*!<WDGTB[1:0] bits (Timer Base) */
#define  WWDG_CFR_WDGTB0                     (0x0080)            /*!<Bit 0 */
#define  WWDG_CFR_WDGTB1                     (0x0100)            /*!<Bit 1 */

#define  WWDG_CFR_EWI                        (0x0200)            /*!<Early Wakeup Interrupt */

#define  WWDG_SR_EWIF                        (0x01)               /*!<Early Wakeup Interrupt Flag */

#if defined (STM32F303xC)
#define ADC1_IRQn                         ADC1_2_IRQn                       
#define CAN1_TX_IRQn                      USB_HP_CAN1_TX_IRQn               
#define CAN1_RX0_IRQn                     USB_LP_CAN1_RX0_IRQn              
#define TIM6_DAC1_IRQn                    TIM6_DAC_IRQn                     
#define TIM7_DAC2_IRQn                    TIM7_IRQn                         
#define COMP2_IRQn                        COMP1_2_3_IRQn                    
#define COMP4_6_IRQn                      COMP4_5_6_IRQn                    

#define ADC1_IRQHandler                   ADC1_2_IRQHandler                 
#define CAN1_TX_IRQHandler                USB_HP_CAN1_TX_IRQHandler         
#define CAN1_RX0_IRQHandler               USB_LP_CAN1_RX0_IRQHandler        
#define TIM6_DAC1_IRQHandler              TIM6_DAC_IRQHandler               
#define TIM7_DAC2_IRQHandler              TIM7_IRQHandler                   
#define COMP2_IRQHandler                  COMP1_2_3_IRQHandler              
#define COMP4_6_IRQHandler                COMP4_5_6_IRQHandler              

#elif defined (STM32F334x8)
#define ADC1_IRQn                         ADC1_2_IRQn                       
#define USB_HP_CAN1_TX_IRQn               CAN1_TX_IRQn                                     
#define USB_LP_CAN1_RX0_IRQn              CAN1_RX0_IRQn                                   
#define TIM6_DAC_IRQn                     TIM6_DAC1_IRQn                                         
#define TIM7_IRQn                         TIM7_DAC2_IRQn                                             
#define COMP1_2_3_IRQn                    COMP2_IRQn                                            
#define COMP4_5_6_IRQn                    COMP4_6_IRQn                                          

#define ADC1_IRQHandler                   ADC1_2_IRQHandler                 
#define USB_HP_CAN1_TX_IRQHandler         CAN1_TX_IRQHandler                               
#define USB_LP_CAN1_RX0_IRQHandler        CAN1_RX0_IRQHandler                             
#define TIM6_DAC_IRQHandler               TIM6_DAC1_IRQHandler                                   
#define TIM7_IRQHandler                   TIM7_DAC2_IRQHandler                                       
#define COMP1_2_3_IRQHandler              COMP2_IRQHandler                                     
#define COMP4_5_6_IRQHandler              COMP4_6_IRQHandler                

#elif defined (STM32F302x8)
#define ADC1_2_IRQn                       ADC1_IRQn                           
#define CAN1_TX_IRQn                      USB_HP_CAN1_TX_IRQn               
#define CAN1_RX0_IRQn                     USB_LP_CAN1_RX0_IRQn               
#define TIM6_DAC1_IRQn                    TIM6_DAC_IRQn                       
#define COMP1_2_3_IRQn                    COMP2_IRQn                                            
#define COMP4_5_6_IRQn                    COMP4_6_IRQn                       

#define ADC1_2_IRQHandler                 ADC1_IRQHandler                     
#define CAN1_TX_IRQHandler                USB_HP_CAN1_TX_IRQHandler         
#define CAN1_RX0_IRQHandler               USB_LP_CAN1_RX0_IRQHandler         
#define TIM6_DAC1_IRQHandler              TIM6_DAC_IRQHandler                 
#define COMP1_2_3_IRQHandler              COMP2_IRQHandler                                      
#define COMP4_5_6_IRQHandler              COMP4_6_IRQHandler                   

#elif defined (STM32F303xE)   
#define ADC1_IRQn                         ADC1_2_IRQn                       
#define CAN1_TX_IRQn                      USB_HP_CAN1_TX_IRQn               
#define CAN1_RX0_IRQn                     USB_LP_CAN1_RX0_IRQn              
#define TIM6_DAC1_IRQn                    TIM6_DAC_IRQn                     
#define TIM7_DAC2_IRQn                    TIM7_IRQn                         
#define COMP2_IRQn                        COMP1_2_3_IRQn                    
#define COMP4_6_IRQn                      COMP4_5_6_IRQn                    

#define ADC1_IRQHandler                   ADC1_2_IRQHandler                 
#define CAN1_TX_IRQHandler                USB_HP_CAN1_TX_IRQHandler         
#define CAN1_RX0_IRQHandler               USB_LP_CAN1_RX0_IRQHandler        
#define TIM6_DAC1_IRQHandler              TIM6_DAC_IRQHandler               
#define TIM7_DAC2_IRQHandler              TIM7_IRQHandler                   
#define COMP2_IRQHandler                  COMP1_2_3_IRQHandler              
#define COMP4_6_IRQHandler                COMP4_5_6_IRQHandler              

#endif /* STM32F303xC */        
/**
  * @}
  */

 /**
  * @}
  */ 

#ifdef USE_STDPERIPH_DRIVER
#endif /*!< USE_STDPERIPH_DRIVER */

/** @addtogroup Exported_macro
  * @{
  */

#define SET_BIT(REG, BIT)     ((REG) |= (BIT))

#define CLEAR_BIT(REG, BIT)   ((REG) &= ~(BIT))

#define READ_BIT(REG, BIT)    ((REG) & (BIT))

#define CLEAR_REG(REG)        ((REG) = (0x0))

#define WRITE_REG(REG, VAL)   ((REG) = (VAL))

#define READ_REG(REG)         ((REG))

#define MODIFY_REG(REG, CLEARMASK, SETMASK)  WRITE_REG((REG), (((READ_REG(REG)) & (~(CLEARMASK))) | (SETMASK)))

/**
  * @}
  */

#ifdef __cplusplus
#endif /* __cplusplus */

#endif /* __STM32F30x_H */

/**
  * @}
  */

  /**
  * @}
  */

